{"aliases":["54","deck_of_many_things","deckofmanythings","deck","many","things","domt","dmt"],"author":"592532889208356876","title":"Deck of Many Things","color":null,"iconURL":null,"imageURL":null,"params":{},"fields":[{"name":"Stop-In Effect:","value":"You may draw as many cards from the deck of many things as you wish, gaining a random effect from the following table per card. Once a card has been drawn, it is gone until all cards have been drawn, after which the deck refills. You may not draw more cards than there are in the deck."},{"name":"1. Sun:","value":"Gain $500.\n2. Moon: Gain three wishes. Each wish may cancel the effects of one thing that happens to you (examples: a stop-in effect, a drive-by effect, a card draw). You may not prevent this card from being drawn, and you may not cancel effects once the turn the effect occured on is over.\n3. Star: The rent of one of your properties at random increases by 50%.\n4. Throne: Gain a random property.\n5. Key: You need not pay your next rent.\n6. Knight: An NPC spawns on a random area with $200 and takes turns with you. You control them and may trade with them.\n7. The Void: Your soul becomes trapped on a random space. You cannot win the game while this is the case, if everyone else is bankrupted then the game ends without you winning anyways. The only way to free your soul is if someone lands on that space.\n8. Flames: A demon forces you to give a property to another player."},{"name":"1. Sun (cont.):","value":"9. Skull: An NPC reaper spawns on the other side of the board, taking turns just like you do and will do everything in their power to catch up to you. They cannot have money for all intents and purposes but cannot go bankrupt and will trigger drive-by effects and stop-in effects. If they catch up to you, lose all your money and then mortgage all your properties.\n10. Ruin: All your properties become mortgaged and you may not unmortgage them until you pass your starting space.\n11. Eurayle: All properties cost 10% more rent to you (rounded up). You may get rid of this affliction by spending $400.\n12. Rogue: One player secretly becomes your enemy. If you get bankrupted, they gain $2000. If they get bankrupted, you gain $2000.\n13. Jester: Draw two more cards than planned."}],"meta":{},"desc":"Post 54","id":53,"locked":false}