{"aliases":["hearts","heart","♥️","❤️","poker"],"author":"298205270201597955","title":"Hearts","color":"be1931","iconURL":"https://cdn.discordapp.com/attachments/1299839162236665897/1332137680842260520/10a9d54eb98cfde23a5d.png","params":{"basic":"False"},"fields":[{"name":"Betting:","value":"- You may play up to five Poker cards at once, but they don't immediately leave your hand and don't get revealed.\n- All that's revealed is that you have made a Bet.\n- Until the next turn of the initial Better, Poker cards are always playable.\n- Bets are revealed and scored upon the start of the initial Better's next turn.\n- The Score of a Bet hand is equal to the combined Ranks of Scoring cards, multiplied by the Number of the matching Poker Hand from the list below. (e.g. Flush's Number is 6.)\n- Highest score wins. RNG breaks ties.\n- The winner places their Bet cards onto the Play Pile, while losers **Exhaust** their Bet cards. Both effects also apply to non-scored cards.\n- The winner additionally gains **Money**, while each loser gains **Card Shards**, both in amounts equal to the Number of the winning hand.\n- Players who don't submit a Bet don't lose."},{"name":"Poker Hands:","value":"1. High Card - Cards match no hand listed below. Only highest Rank card gets scored.\n2. Pair - Score only two cards of equal Rank.\n3. Two Pair - Score only two separate Pairs.\n4. Three-of-a-Kind - Score exactly three cards of equal Rank.\n5. Straight - Exactly five cards, all with consecutive Ranks with no gaps or repeats.\n6. Flush - Exactly five cards of the same color.\n7. Full House - A Pair and a separate Three-of-a-Kind together.\n8. Four-of-a-Kind - Score exactly four cards of equal Rank.\n9. Straight Flush - A Straight made entirely of a single Color.\n10. Royal Flush - A Straight Flush where every card is Rank 10 and above."}],"meta":{"emoji":"♥️"},"desc":"- One of the four Poker colors.\n- Playable off of ♥️♦️♣️♠️<:red:1106234051129507932>\n- All Poker cards additionally have a Rank. If none is specified, it's equal to the post number's last digit (with 0 being Rank 10)\n- Each time you play a Poker card, you may spend 1 **Money** to draw another random Poker card.","id":61,"locked":false}