{"aliases":["2124","lament_configuration","lamentconfiguration","lament","configuration","lc"],"author":"775954146075082752","title":"Lament Configuration","color":null,"iconURL":null,"imageURL":null,"params":{"uno_color":"<:gloom:1187518684143550605>+<:partisan:1107460550268559380>+🆔+<:ex:1118578840529281114>","base":"False"},"fields":[{"name":"EDIT:","value":"i feel like this was not explained good enough, so i will explain this easier.\nafter 4 rounds, chain hunts begin if the 🆔 is not removed. once chain hunts begin, every player except for the one with this 🆔, gets 3 chains. your gloom amount is exactly identical to the chains, and the gloom cannot be removed by any normal means. this means, if someone solves the box like a goodie two shoes, every player gets all the gloom they have from the chains removed, also removing the chains. if the 🆔 gets removed, all chains end and the chain hunts never build up again."}],"meta":{"spawn_as":"uno_color:<:gloom:1187518684143550605>,<:partisan:1107460550268559380>,🆔,<:ex:1118578840529281114>","color_choices":"<:gloom:1187518684143550605>+<:partisan:1107460550268559380>+🆔+<:ex:1118578840529281114>","post":"2124"},"desc":"Post 2124\n- The Lament Configuration fell into curious hands. And when it was solved, they came.\n- While in your ID zone, open a Gateway, building up **Chain Hunts** on every other player.\n- Every round, the **Chain Hunts** increase by 1.\n- When the **Chain Hunts** build up to 4, three chains grab every other player, inflicting 1 **Gloom** for every Chain on top of them.\n- A player may skip their turn and draw a <:red:1106234051129507932> card to pull a chain out, removing 1 stack of **Gloom**. **THIS IS THE ONLY WAY TO REMOVE IT, BESIDES THE 🆔 BEING REMOVED.**\n- Alternatively, a player may skip their next 3 turns to solve the Lament Configuration, gaining 3 <:partisan:1107460550268559380> points and drawing 2 <:partisan:1107460550268559380> cards. This ends the **Chain Hunts,** resetting the timer, and also removes all Chains from every player.\n- Also, when the **Chain Hunts** are active, all players who have less cards then the one with this 🆔 get a chain every round, and anyone who plays a negative effect on the one with this 🆔 gets a chain.\n- Also, the one with this 🆔 may skip their turn to place a chain on any player of their choosing.","id":240}