{"aliases":["1916","billy_mays","billymays","billy","mays","bm"],"author":"775954146075082752","title":"Billy Mays","color":null,"iconURL":null,"imageURL":null,"params":{"uno_color":"<:white:1107514189574045726>","base":"False"},"fields":[],"meta":{"spawn_as":"uno_color:<:white:1107514189574045726>","color_choices":"<:white:1107514189574045726>","post":"1916"},"desc":"Post 1916\n- If you got a real mess and want to win like the pros, then you’ve got to see this! Hi, Billy Mays here with +2 Card, the best Uno card I’ve ever used. It has the strength and the muscle to pick up and hold over 1 card. Look at this! +2 Card attracts Uno wins like a magnet! It doesn’t matter if it’s red, yellow, even light blue! Watch as this powerful vacuum action pulls and cleans the lose from out of the carpet – just that quick. The secret's in the X27 fiber technology, making +2 Card over 27 times more absorbent than regular cards! Forget cards that just do nothing. And, unlike other cards that smell, +2 Card is odor-free and leaves a path of clean. Now, you could clean and dry and never leave any wins behind! You’ll be amazed at just how much they work – and they’re machine washable. Win Uno against your entire family, even your dog! Use any cleaner for a streak-free window. An average family uses up to two rolls of paper towels every week. That’s Ws in the trash! Save money and even help save the environment. You get two jumbo +2 Cards plus three extra large for only $14.99. But call right now and I’ll send you another five +2 Cards absolutely free! That’s 10 +2 Cards for only $14.99! And as a special bonus, we’ll also include our Micromen Microfiber Duster free. It’s great for blinds, plants, glass, and more – and attracts dust like a magnet! That's a $60 value, all for just $14.99! And here's the best part, we'll send you a set of +2 Cards free, whenever you need them, for life! Just pay shipping and processing. But you gotta call now!\n- Draw 20 +2s (post 11) with the color <:wild:1106237191388143838>.\n- Any time you draw a +2 (post 11), it's **Phantom.** (includes the 20 cards you just drew.)","id":460}