{"aliases":["2060","trivia_murder_party","triviamurderparty","trivia","murder","party","tmp"],"author":"775954146075082752","title":"Trivia Murder Party","color":"bf6952","iconURL":"https://cdn.discordapp.com/attachments/1107710055425519636/1294851768097968168/crossed_swords.png","imageURL":null,"params":{"uno_color":"⚔️+<:gloom:1187518684143550605>","base":"False"},"fields":[{"name":"Quiplash:","value":"Lets relax and play a game of Quiplash! 2 players (not the person who played this card) get a prompt sent to their device. (example: A murder's favorite way to kill someone) (mine is bear traps.) After both players submit an answer, every OTHER player votes on their favorite. I'll KILL the person with the least amount of votes. Host breaks ties."},{"name":"Gifts:","value":"Every player gets a gift! Every single player except for one gets 5 💵 **Money**, and one player gets a random gift item.\n\nYour gift options are as follows."},{"name":"Bomb:","value":"Roll 10d6. That is how many hours the bomb has before it blows up. When it this player's turn, count down the bomb by an hour for every hour they took for their turn. (Example: if they have 6 hours left, and took 5 hours and 24 minutes to take their turn, they would have 1 hour left.) If the bomb blows up, the player holding it is **Destroyed.**"},{"name":"Grandma Despair's Knife:","value":"Roll 1d10. If it is anything but a 10, the player who gets the knife must choose a finger to cut off, blocking out a color. (example: you could cut out the color green, but from then on, whenever you get a green card, its frozen.) If you have a turn where you cant play any card, cut out another finger. If you somehow run out of colors, you DIE, and get **Destroyed.** If it's 10, this effect is applied to every single player, except the one with the Knife."},{"name":"Mother's Wig:","value":"Here, put it on. OH! MOTHER! IT'S YOU! I couldn't possibly skip your turn! Discard any card you want if you have a turn where you can't play any card. (once.)"},{"name":"Dad's Hat:","value":"Oh. Dad. It's *you.* If you have a turn where you can play a card, I'll skip your turn instead! And take a **Gloom**! This is for abandoning me! (once.)"},{"name":"Grandpappy Jack's Glasses:","value":"SUPERNATURAL MADNESS!!! The player with this card gets post numbers, card names, and card colors removed from their player channel, instead just seeing them as random BS and every color as a random emoji that is not a color. You will also roll more negative, shitty, confusing, weird, and complicated cards. (host's discretion.)"},{"name":"Scratch Off:","value":"I'm giving you all Scratch Tickets. What a quirky last minute gift! There are 9 spaces. Find and scratch 3 $ signs to live. You may keep scratching after you get 3 $ signs. You get 2 💵 **Money** after you scratch off a Dollar sign, but you DIE if you scratch even one of the 3 **Skulls** on the ticket."},{"name":"Mirror:","value":"The host will write down a word and reveal it to every player. Then, every player and the host writes a word, and they are all shown to everybody. Guess the host's word. If you are correct, you live."},{"name":"Pegs:","value":"The host finds a marble racing video on **Youtube,** revealing every marble in the video. Then, players pick a marble. If your marble wins, you Live. If it does not, you DIE."},{"name":"Phones:","value":"Ah, the scariest thing of all. Talking to someone on a phone. The host posts 3 Phone Numbers. The first player to post a phone number is Safe, and locks that phone number for everyone else. If you do not answer a call, you DIE. (note: this game does not use actual phone numbers or calling anybody. The phone numbers are just a string of random numbers.)"},{"name":"Donations:","value":"Everyone gets 500 points. you may give any amount of points to any other player, and whoever has the most amount of points dies. But if the player you give points to ends up with 800 or more, i will kill YOU instead."},{"name":"High Rollers:","value":"Oh hey! More Dice! It's real simple. Everyone gets 3 dice. Whoever rolls the highest dies, but every player gets to choose someone else to roll another Die. The player who played this card is immune to having more then 3 die."},{"name":"Skewers:","value":"There is a 3x4 box. Every player chooses a spot to hide in, then the player who played this card stabs a skewer 3 spaces vertically or horizontally into the box."},{"name":"Tattoo:","value":"Everyone draws a tattoo on the host's back. Then, the host chooses the worst Tattoo. That player dies."},{"name":"Skull Dice:","value":"Oh look, it's Dice! Every player rolls dice, one at a time, as many times as they want. The player with the lowest score dies. But go over 21, and you die instead! The host may decide to roll some dice, and if they roll a 1, every other player gets a 1 added to their score."},{"name":"Dumbwaiters:","value":"Their are two Dumbwaiters. Every player secretly picks one to hop into. The one with the heaviest weight drops, Killing everyone inside. But if everyone is on the same side, Nobody dies. If there is an even amount of players, Add a weight worth one player to one of the dumbwaiters."},{"name":"Lock And Key:","value":"Every player gets put into a box slowly filling with water. There are keys equal to the amount of players in the game x 3. Only one of the keys unlock the boxes, And if nobody finds the right key, everyone except the player who played this card DROWNS AND DIES. (the player who played this card had a leak in their box.)"}],"meta":{"spawn_as":"uno_color:⚔️,<:gloom:1187518684143550605>","color_choices":"⚔️+<:gloom:1187518684143550605>","post":"2060"},"desc":"Post 2060\n- Hold on, let me turn up my voice filter.\n- **intimidating voice** \"EVERYONE will play a minigame from Trivia Murder Party 2. Anyone who DIES draws a card, and gains 2 **Gloom.**\"","id":54}