{"aliases":["2137","parallel_universe","paralleluniverse","parallel","universe","pu"],"author":"298205270201597955","title":"Parallel Universe","color":"b260e9","iconURL":"https://cdn.discordapp.com/emojis/1107516323426213888.webp","imageURL":null,"params":{"uno_color":"<:enchantment:1107516323426213888>+<:rulebreaker:1120899966555127899>","base":"False"},"fields":[{"name":"Destroy:","value":"Target player draws 10 cards. Destray a player who already had 20 cards or more to win instantly."},{"name":"Bias:","value":"Target a player. They gain Biased (N), and only draws cards thar harm theirself and/or others. You gain Biased (P), and you only draw cards that help yourself and/or others."},{"name":"Mulligan:","value":"Draw cards up to your hand size, then discard that same number of cards, but specifically the ones with the lowest post numbers."},{"name":"Shield/🛡️:","value":"Each turn, Shielded players randomly discard a card and lose a point of Shield."},{"name":"Flip:","value":"To flip a card, add 1 to the total amount of post numbers, then subtract its own post number. Replace it with the card with the resulting post number. If the result can't be drawn, randomize it instead."},{"name":"Muscle/💪:","value":"Each time you make another player draw any number of cards, make them draw a card for each Muscle you have."},{"name":"Money/💵:","value":"If you have 5 money, you may spend it to exchange any card in your hand for another card of your choice, with the exact same color(s).\n\n<@&1118589872823881828>:\nYou may use it during anyone else's turn to skip their turn."},{"name":"Happy/😃:","value":"When a Happy player draws a card, they are presented with a second card. They may draw the second card instead of the first, at the cost of one Happy stack."},{"name":"Linked:","value":"Players that are linked both win together the moment either one of them wins by any means."},{"name":"Adventure Mode:","value":"Players in Adventure Mode replace another card in their hand with a :builder: card each time they play a non-:builder: card.\n\n**Enhance:**\nAs you play an Enhanced card, you may immediately play an amount of duplicates of the card equal to or less than its Enhancement level. Any duplicates you choose not to play, are simply removed from the game.\n\n**Spell Slots/🪄:**\nA currency necessary to play some cards. Players start with 0, but gain 1 per turn for each card in their hand that requires any number of Spell Slots.\n\n**Suffocate:**\nSuffocated players cannot play the same number as the top of the play pile. They will be Destroyed if they end a turn without playing or discarding a card. Suffocate can be ended by being Suffocated again.\n\n**Slick:**\nWhenever this player plays a card on another player, that player may give a card to this player. This lasts for two turns, unless otherwise specified."},{"name":"Peek:","value":"Learn the next 5 cards a player will gain as a result of future card draws."},{"name":"Injured:","value":"If you have two or more injuries, you bleed out and gain a Deep Wound."},{"name":"Deep Wound:","value":"If you draw a card, you become Destroyed. This effect is removed via healing (e.g. anything that removes Injuries) or if their turn is skipped. Deep Wound is NOT activated again if you draw more then one card at a time. (e.g. if you draw 2 cards from one card.)"},{"name":"Card Shard/🔹:","value":"A public currency, Every time you reach 3 Card Shards, you lose them and must choose another player to discard a random card."},{"name":"Stoned:","value":"A status effect for a card, playing an Armored card makes you draw an Armored card that doesn't share any colors with the card you played.\n\n**Armored:**\nA status effect for a card, playing an Armored card makes you draw a card that doesn't share any colors with the card you played."},{"name":"Phantom:","value":"If you have no other legal cards to play during a turn and you may play a Phantom card regardless of top color/number.\n\n**Ethereal:**\nOnce per round, you may play an Ethereal card during someone else's turn."},{"name":"Tipsy:","value":"Tipsy is a status effect, players have a 25% to randomize any targets of their card, each time they play one. Default duration is their next 3 turns if unspecified.\n\n**Obssession:**\nA status shared by 2 players, the Obsessed and the Obsession. Only one player may be the Obsession at a time, but they may have multiple players who are Obsessed over them."},{"name":"Banish:","value":"When a card is Banishes, it and all present and future copies of itself are discarded.\n\n**Exposed:**\nYour hand is made public while this status effect is active, default length is 1 turn."},{"name":"Gloom/<:gloom:1187518684143550605>:","value":"Stackable, default of 1. A Gloomed player's card draw amounts are doubled. This effect lasts for an indefinite number of turns, but is decreased if the victim draws, plays, or is directly targeted by a card with the following colors: :holy: :hyrulean: :partisan: :slightlylightergreenbutwithalitt: :wild:. Gloom also decreases itself by 1 for each additional card it forces upon its target.\n\n**Dull Totem:**\nThere is 1 Dull Totem per game. Effects may turn it into a Hex Totem or Boon Totem, but if one already exists, it is replaced. A player with a hex totem who has their turn skipped may instead have their hex totem destroyed."},{"name":"Countdown:","value":"Mechanic for 🎲 cards. Countdowns are a number, for example, 12. Half the value of each die you roll (rounded down) will automatically decrease the Countdowns of all cards in your hand. You may still use the die for another 🎲 card, but you cannot manually use a die to decrease a Countdown any faster.\n\n**Plus X:**\nAdd X to the affected card's post number, then replace the card with the one that has such a post number. If it can't be spawned, Plus 1 it again until you get a card that can be spawned. If the post number would exceed the highest post number, wrap back around to 1."},{"name":"Minus X:","value":"Subtract X from the affected card's post number, then replace the card with the one that has such a post number. If it can't be spawned, Minus 1 it again until you get a card that can be spawned. If the post number would fall below 1, wrap back around to the highest post number.\n\n**Exhaust:**\nThe target of this effect takes a specified number of cards from whoever has the most cards in their hand. If the target of this effect is such player, nothing happens."}],"meta":{"spawn_as":"uno_color:<:enchantment:1107516323426213888>,<:rulebreaker:1120899966555127899>","color_choices":"<:enchantment:1107516323426213888>+<:rulebreaker:1120899966555127899>","post":"2137"},"desc":"Post 2137\n*Woah, everything's different!*\n- As you play this card, a (vanilla) **Flip** occurs.\n- Then, rewrite the effects of Keywords in all other cards to the contents of the attached file:","id":69}