{"aliases":["3086","battleship"],"author":"327918538419601409","title":"Battleship","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Unstoppable","defense":"Powerful"},"fields":[{"name":"Abilities:","value":"- Challenge someone each night to a game of Battleship."},{"name":"Attributes:","value":"- A channel is created that only the host and the challenged may type in. Both players will secretly place five ships on their own 10x10 board: a Carrier 5 pegs long, a Battleship 4, a Cruiser 3, a Submarine 3, and a Destroyer 2. Ships cannot overlap or extend off of the board, however they can touch each other (unlike some modern versions of the game.)\n- During the next day, each player takes turns firing a salvo of rounds. You fire 5 rounds per salvo, the challenged only fires 3. Every shot must target a specific square on the coordinate plane (A1-J10). After each salvo is fired, it is revealed in the channel what shots were fired, and which ones were hits and misses. You always go first, and each player has 5 salvoes to sink as many ships as they can."},{"name":"Attributes (cont.):","value":"- For the challenged player, each ship has to represent a living player. Whenever you sink a ship, whoever is linked to that ship dies. If you hit but don’t sink a ship, whoever is linked to that ship cannot perform any abilities the next night. You will learn if the challenged player selects you and where your location is. Players can select themselves to link themselves to ships.\n- If the opponent sinks any of your ships, you cannot use that ship in future battles. If the opponent sinks all of your ships, you die.\n- If the game is incomplete by the end of the day, you may instead fire three Powerful attacks at living players.\n- If you challenge a player who dies the same night, they will still play when they are dead. However, they will call out their shots from their private channel instead of typing in the main channel.\n- If the target cannot select 5 targets, there will only be as many enemy ships as there are living players.\n- Challenging is Astral."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{},"desc":"Post 3086\n*Do you know how hard this is to recreate without just saying \"two people play, one dies\"?*","id":1168}