{"aliases":["5036","a.b.a","aba"],"author":"329331408269213696","title":"A.B.A","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Fighter","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Light Punch: Visit a player. Gain 1 Combo if you're the only visitor. Attack them if you have 3+ Combo.\n- [__BONDING AND DISSOLVING__]: Requires 1 Combo. Choose a player and guess a number 1-10. They are prompted to also guess a number 1-10. A random number is generated by the host: if your number is closer to it than them or you tie, you will deal a basic attack to them, gain 1 combo, and enter Jealous Rage tomorrow night, then consume all Jealousy and extend Jealous Rage by the same number of nights as Jealousy consumed.\n- [__INTERTWINE AND TILT__]: Requires 3 Combo. Can only be used on full moons. Rampage at a player's house and gain 1 Combo if you kill more than 1 player. During Jealous Rage, gain no combo, but can be used even on non-full moons.\n- [__FRENZY AND ASTONISHMENT__]: Spend [1] Combo. Gain powerful defense tonight and detection immunity. Gain 1 Combo for each Jealousy you gain tonight. During Jealous Rage, gain no combo, but instead all your visits are astral."},{"name":"Abilities (cont.):","value":"- Overdrive (__THE LAW IS KEY, KEY IS KING __): Requires 5 Combo. Deal an Overkill attack to anyone. Also, all players see this video in daychat, and the victim is pinged. https://www.youtube.com/watch?v=B5vSWQtyYRg&ab_channel=LegacyOfKaiser"},{"name":"Attributes:","value":"- While in Jealous Rage, you can use two abilities each night, but lose 1 Jealousy each night. Jealous Rage can only be entered using certain abilities. You exit Jealous Rage once you are reach 0 Jealousy.\n- You have a resource called Jealousy, starting at 0 and capped at 3. Each time you visit someone or are visited, you gain 1 Jealousy."},{"name":"Goal:","value":"Kill the other Fighter, then be the last one standing."}],"meta":{},"desc":"Post 5036\n*ALL CONSUMING FLAME OF ~~JEALOUSY~~ LOVE*","id":1410,"locked":false}