{"aliases":["1507","crystalist"],"author":"562746047596593163","title":"Crystalist","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Cult","subalignment":"Casual","unique":"False","attack":"Powerful","defense":"None"},"fields":[{"name":"Abilities:","value":"- During the day, forge a random crystal. You'll receive it at the beginning of the night.\n- At night, infuse a crystal with a positive or negative energy, then give it to another player."},{"name":"Attributes:","value":"- Every even numbered day, you'll gain an extra crystal by forging. This can cumulate to a maximum of 4, capping out at night 6.\n- The following crystals have the following effects:\n- Ruby: Positive grants a one-time Powerful attack, Negative deals a Powerful attack.\n- Amethyst: Positive permanently increases the defense tier, while Negative permanently decreases it. If decreasing from Vulnerable, it kills the player.\n- Jade: Positive grants a two-use roleblock ability and roleblock immunity, Negative roleblocks a player.\n- Sapphire: Positive increases the amount of times someone can use their ability per phase, negative decreases it. If it's 0, roleblock them every other night instead.\n- Amber grants a one-time use controlling ability and control and redirect immunity, negative redirects to a random non-Cult target."},{"name":"Attributes (cont.):","value":"- Topaz grants a one-time use investigation ability which reveals a target's true role and detection immunity, negative will force a random Investigative role to target the player, and they will know who they were redirected to.\n- Jasper: Positive permanently increases the attack tier, granting an attack ability if needed, while Negative permanently decreases it.\n- Opal: Positive permanently grants an extra anonymous vote, while negative forces the target to vote themself.\n- You may give yourself and other Cult members a crystal.\n- You may hold as many crystals as you want at a time.\n- This role is converted from Town Casual roles."},{"name":"Goal:","value":"Cult goal"}],"meta":{},"desc":"Post 1507\n*In this world, Mithras and Corax have far too many who would rather witness the end of their followers. Serving numerous purposes in this world will assist you in ensuring that doesn't happen.*","id":1421,"locked":false}