{"aliases":["50","4128","post_4128","post4128","post","p4"],"author":"654448067969548338","title":"Post 4128","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Cackle (Brainless Support):","value":"**Attack:** None\n**Defense:** Basic\n**Abilities:**\n- **Tinkering:** Choose a player each night and provide them with a random item from your inventory.\n- **Peddler:** Once per game, during the day, you may offer a trade by selecting two players. If both players agree, their roles and abilities will be swapped. This trade can only occur on Tuesday and Friday.\n**Attributes:**\n- During Tuesday and Friday, Cackle may choose the item **Tinkering** gives.\n- Items in Cackle's inventory have unique passive effects that can activate upon being used by the recipient.\n**Goal:** Rot the brains of the Town.\n**Items in Inventory:**\n1. **Whispering Quill:** When used by a Town Investigative role, the investigation results are whispered directly to the target, bypassing any potential spies.\n2. **Sparkling Elixir:** When used on a player, their next ability will have an additional charge.\n3. **Mirror of Reflection:** When used on a player, any negative effects they receive will be reflected back onto the original caster."},{"name":"Cackle (Brainless Support) (cont.):","value":"4. **Dusty Hourglass:** When used on a player, their night action is delayed by one night.\n5. **Shimmering Lantern:** When used on a player, it will reveal the true identity of any disguised players visiting them that night.\n6. **Cursed Coin:** When used on a player, they will have their vote counted as two during the next day.\n7. **Enchanted Compass:** When used on a player, they will be immune to any redirection or transportation effects for that night.\n8. **Mischievous Voodoo Doll:** When used on a player, any role-blocking abilities targeting them will be redirected to another random player.\n9. **Flickering Talisman:** When used on a player, they will become immune to being controlled or manipulated for that night."}],"meta":{},"desc":"Post 50","id":1993,"locked":false}