{"aliases":["3906","ghostbusters"],"author":"562746047596593163","title":"Ghostbusters","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Power","unique":"False","attack":"Piercing (Powerful)","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Use an EMF reader at a player's house for traces of paranormal activity.\n- Suck up a player with your Vacuum Cleaner 6000, dealing a Piercing attack if they are classified as a Ghost.\n- Fucking shoot someone, because vacuum cleaners can't do everything, dealing a Powerful attack. 2 uses, fails on players classified as Ghosts."},{"name":"Attributes:","value":"- Players classified as a Ghost include members of the Spirit faction, members of the Ghost faction, and other roles the host could interpret as a ghost-type role.\n- Note about the Ghost faction's traitor: While the traitor *is* considered a Ghost, they cannot be sucked up by the vacuum, but they can be shot. They give off EMF readings as normal.\n- The above also applies to any player framed by a Ghost.\n- Your EMF reader will detect paranormal activity and give off different signals depending on the below circumstances. You will only be notified of the highest level.\n* Level 1: If none of the below are true.\n* Level 2: If your target visited a player classified as a Ghost."},{"name":"Abilities (cont.):","value":"* Level 3: If your target was visited by a player classified as a Ghost.\n* Level 4: If your target is classified as a Ghost, or is framed by a player classified as a Ghost.\n* Level 5: If your target was either attacked by or attacked a player classified as a Ghost. The attack does not need to be successful.\n- **Piercing** - Your attack ignores all defense, if your target is classified as a Ghost.\n- You suffer no penalty for shooting a Townie."},{"name":"Goal:","value":"Hang every criminal and evildoer, **and** exterminate the Town of ghosts, including ones you would normally be able to win with."}],"meta":{},"desc":"Post 3906\n*Who you gonna call?*","id":2110,"locked":false}