{"aliases":["6969","gim_or_something,_i_wouldn't_know,_i_never_played_it","gim_or_something_i_wouldnt_know_i_never_played_it","gimorsomething,iwouldn'tknow,ineverplayedit","gimorsomethingiwouldntknowineverplayedit","gim","something","wouldnt","know","never","played","something,","wouldn't","know,","gosiwkinpi","gswknp"],"author":"361152876048809984","title":"GIM or something, I wouldn't know, I never played it","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Passives:","value":"\n\nGIM in a nutshell - When rolling this role, you either actually get this role, or secretly roll into a role called \"I refuse to exist\", which is a role that will instantly die upon the player speaking ANYWHERE in the server.  However, the player will not be aware of this. What are the chances of this you ask? Well ask the host idfk man\n\nGET SHIT ON BITCH - The first 3 people to attack you will become a toilet upon visiting your house, therefore being unconditionally roleblocked. Then, your fat American grandma will come into house and sit on the player-now-toilet, and proceed to shit while she's sitting down. The toilet will immediately shatter due to not only dying of stench, but also due to the fact that your fat American grandma weighing a literal truck. Once the player has died, grandma will whisper \"get shit on bitch, gg no re kid\" to their ghost, to which the ghost will proceed to die of embarrassment, and the player will be unable to be revived under any circumstances."},{"name":"Passives (cont.):","value":"(Host)ile Takeover - When the host makes an error that becomes public, kill the host and become the host, because you are clearly a more competent host than that motherfucker"},{"name":"Abilities:","value":"\n\nScrew you, and you, and you - Roll 3 [alive-players] die. Whatever number the dice rolls, you will point your finger at them. Then, Ace-Attorney style, your finger will blast air at them, and pronounce them guilty. They will then die, without exceptions. The bass-boosted amongus theme will then start playing. Day time use.\n\nWeed dealer - Give 1 person weed. They will become so high that they re-roll into a different role. Night time use."},{"name":"Goal:","value":"Fuck with people. Yes, you immediately win. Unless you secretly roll into \"I don't want to exist\", then fuck you I guess"}],"meta":{"cannot_spawn":"true"},"desc":"Post 6969","id":2197,"locked":false}