{"aliases":["3481","the_clusterfuck_of_a_role_that_is_all_my_bad_ideas_i_came_up_with_while_watching_a_south_park_episode_mixed_into_one","theclusterfuckofarolethatisallmybadideasicameupwithwhilewatchingasouthparkepisodemixedintoone","clusterfuck","role","is","all","my","bad","ideas","came","up","while","watching","south","park","episode","mixed","into","one","tcoartiambiicuwwwaspemio","criambicuwwspemio"],"author":"655633028516937729","title":"The Clusterfuck Of A Role That Is All My Bad Ideas I Came Up With While Watching A South Park Episode Mixed Into One","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Any","unique":"False","attack":"Variable","defense":"Variable"},"fields":[{"name":"Abilities:","value":"-Make someone a WEEB, forcing them to change their name into Weeb for the rest of the game\n-Extinguish someone with a Overkill attack jacked up on steroids, causing them to die one billion times. This floods the day chat, making it so players have a limit of 30 messages that day, as well as any other deaths being unable to be announced\n-Send someone to Britain, forcing them to be stabbed. This is done by every other player, forcing everyone but you to visit your target, but not using their ability (they’re too busy stabbing the guy)\n-Abolish a rule, making any one rule in <#978786268597063700> void, allowing it to be ignored. You get to choose the role and the host can’t do anything to stop you\n-File someone’s teeth down to stubs, making it so they’re unable to talk the next day, as well as giving them a “bleeding” effect (does essentially the same thing as poison, but is fancy and will cover your target’s will in blood if they die, making it unreadable)"},{"name":"Abilities (cont.):","value":"-Raise the forces of hell, causing all dead players to be able to attack any one person (that isn’t you) with a basic attack\n-Vanish. You quit. You die instantly and there is no reviving you. Ever. Unless one person is modkilled I guess, whether it be a role or they made a goofy mistake. You’re instantly revived if someone’s modkilled and given lynch immunity until attacked with an attack of none or below.\n-Ban all attacks against you. You are given 9 trillion Overprotective autovests for the next 3 nights"},{"name":"Attributes:","value":"-Half of your abilities are astral. This is chosen by random. This doesn’t apply to your 3rd ability, that one’s always astral.\n-If the host, for whatever reason, keeps this role then they must roll a d20 for defense. Less than 10 gives you no defense, 11-15 gives you basic defense, 16-19 is powerful defense, and a nat 20 is Invincible defense. \n-You must select one role at the beginning of the game. One person is forced to reroll into that role. \n-You originate from America, so at any time you can choose to forfeit all your abilities to gain infinite uses of 2725’s bazooka without any consequences. Flip a coin to see if this is also astral or not\n-If you’re hung, you must play a game of chess with the host. If you win, you are un-hung the next day and cannot be lynched for the next 2 days \n-You have to give a 5 sentence summary of a random topic given to you by the host every 3rd night. If you fail to do so, you explode, killing you and your closest living neighbors"},{"name":"Attributes (cont.):","value":"-If viri is hosting and they allow this role to exist, then they must give nitro to the person who dies first if their faction wins. They don’t really have to, but if they don’t then uhhh they are roleblocked the first night of the next game they play. This attribute overwrites any rules that say that they can’t be affected by roles that don’t exist \n-If anyone says the phrase “Wiggly Worms Workin Out At The Gym” (with capitalization exactly as shown) then immediately reroll this into a different non-good faction role\n-You must choose your own goal at the beginning of the game. Cannot be “I win immediately” or anything along those lines. The goal must be somewhat difficult to achieve. This is determined by ME (Spaggyt3) if the goal is ok"},{"name":"Goal:","value":"Fuck idk make one yourself"}],"meta":{"spawn_as_any":"subalignment"},"desc":"Post 3481","id":2201,"locked":false}