{"aliases":["1839","combo_serial_killer","comboserialkiller","combo_sk","combosk","csk","sk"],"author":"298205270201597955","title":"Combo Serial Killer","params":{"faction":"SK","subalignment":"Killing","unique":"True","attack":"Basic (Variable)","defense":"None (Basic)"},"fields":[{"name":"Abilities:","value":"- Slice: Attack a player. You may use another ability tonight.\n- Circle: You may use another ability tonight. In the next night, you may use another ability.\n- Prepare: Your next attack will have its tier increased by 1.\n- Sift: Roll three abilities other than this one. You must choose one to use.\n- Expose: Reduce a target player's defense by 1 tonight, down to None.\n- Hide: One random ability that is used on you tonight will fail. You may use another ability tonight.\n- Kick: Attack a player tonight. They will lose a use for up to one ability with limited uses, if they have any.\n- Bandage: Provide yourself with Basic Defense for tonight.\n- Hamstring: Attack and roleblock a player tonight.\n- Venom: Poison a player tonight. They will die at the end of the next night if they lack defense.\n- Focus: Choose one of your own abilities to delete. You may use another ability."},{"name":"Abilities (cont.):","value":"- Backstab: Use an attack against a player tonight, with the tier being equal to the amount of abilities you have used tonight, other than this one. Maximum of Overkill. 1 use."},{"name":"Attributes:","value":"- At the start of each night, you will be prompted with a random ability from the above list. That is the ability you must use that night, if you wish to use anything.\n- All your abilities resolve immediately. You cannot undo them.\n- Once you kill someone, your Attack level will be forcefully set to None for the rest of the night.\n- Abilities you gain tonight will not carry over into future nights, unless otherwise specified.\n- If the host is feeling generous, they might allow you to roll the next ability yourself, so long as you use the bot within your own channel to decide your next ability."}],"meta":{},"desc":"Post 1839\n*Wanna see me slit your throat? Wanna see me do it again?*","id":226}