{"aliases":["3559","vault_boy","vaultboy","vault","boy","vb"],"author":"655633028516937729","title":"Vault Boy","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Basic/Powerful/Unstoppable/Overkill","defense":"None/Basic/Powerful/Invincible/Overprotective"},"fields":[{"name":"Abilities:","value":"-Attack a player at night\n-Spend a level point to increase on of your levels, up to a max of 10 for each category"},{"name":"Attributes:","value":"-You gain a point for every kill you get\n**Strength:** For every 2 levels in this category you have, your attack will go up one tier. After spending 6 points, spending 2 more will make your attack rampage. At level 10, you will be able to pierce through protective abilities.\n**Perception:** For every 2 points in this category, you may check a player. 2 points for a sheriff check, 4 for an invest check, 6 for a tracker check, 8 for exact role, and 10 for exact role bypassing result changing effects\n**Endurance:** For every 2 points in this category, your defense level will raise by 1 tier. Level 10 will make you immune to any negative effects as well\n**Charisma:** For every 4 points in this category, you can talk your way out of a hanging, up to two times. Level 5 will make jailor type roles unable to execute you. Level 10 will allow you to direct your hanging to another person"},{"name":"Abilities (cont.):","value":"**Intelligence:** For every 2 points you have in this category, you will learn three roles, one of which is in the current game. At level 5, you will instead learn one role in the current game. At level 10, you will learn who is that role.\n**Agility:** For every 2 points in this category, you will perform your action faster (this can be interpreted by the host). Any actions submitted before yours will affect your visit. At level 10, you may perform your action at the beginning of the night.\n**Luck:** For every 2 points in this category, the chance for an ability to be redirected back to the person targeting you increases by 10%. At level 10, only negative abilities will be affected, and it has a 50% chance to be reflected."},{"name":"Goal:","value":"Be the last one standing"}],"meta":{},"desc":"Post 3559\n_What makes YOU s.p.e.c.i.a.l?_","id":2366,"locked":false}