{"aliases":["400","1989","400%_speedrun","400%speedrun","400%","speedrun","1989b"],"author":"298205270201597955","title":"400% SPEEDRUN (Second)","params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Variable","defense":"Variable"},"fields":[{"name":"Abilities (second):","value":"- Disguise one player as any non-evil player. The disguised player will appear innocent, and all results will be based on what would happen if the disguise was checked instead. You will be notified that this failed if you try to choose an evil player as the disguise.\n- Choose a player, and write a fake role and last will to be revealed if they die.\n- Choose a player to frame at night. They will appear as a Framer to investigators.\n- Choose a player and write a fake feedback message for them to see.\n- Choose a player to clean at night, doing such a good job that nobody will even know they died. They will appear alive publicly, but they can’t speak, vote, whisper, or use abilities, not even ones they could normally use while dead. All abilities will also fail against them, no matter what.\n- Lie in wait at a player’s house at night. If someone visits them, you will attack the visitor, which counts as indirect. Otherwise, you will directly attack your target.\n- Attack someone each night."},{"name":"Abilities (second, Cont.):","value":"- Attack someone each night, but with Control Immunity.\n- Choose a player each night to silence.\n- Learn a player’s exact role each night.\n- Roleblock a player each night."},{"name":"Attributes (second):","value":"- Detection Immunity\n- Roleblock Immunity\n- You will overhear all whispers.\n- All of your kills will appear as a result of the Factional Mafia Kill by default."},{"name":"Attributes (global):","value":"- You start the game in your First form. In addition to these attributes, you will have the attributes and abilities marked as First.\n- You must complete your First Goal. Once you do, the game will restart, with all players retaining the roles they started the game with, but you will move on to your Second form.\n- Completing the game in your Second form will restart it with your Third form, then your Fourth form, then finally you’ll win the game.\n- The game will not restart if you fail to complete your current goal.\n- You won’t be allowed to join factional chats in any form.\n- You can’t target yourself with any abilities except for those that specifically say they can.\n- You may multitask.\n- ALL deaths are cleaned until you reach your Fourth form.\n- Conversion Immunity"},{"name":"Goal:","value":"Second: Live to kill anyone that will not submit to the Mafia."}],"meta":{"cannot_spawn":"true"},"desc":"Post 1989B","id":259}