{"aliases":["3230","whalebearer"],"author":"327918538419601409","title":"Whalebearer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Each day, whisper someone a message containing the Good Word. This is actually just the first whisper you send each day, and the contents of said message don't matter. They become Whaled.\n- Each night, grant someone Powerful defense. Because whales. You may target yourself."},{"name":"Attributes:","value":"- Whenever someone is Whaled, the first 3 whispers they send each day will spread the effect. They may spread the effect the same day they get Whaled.\n- The first person to whisper you each day will also get the Whaled effect.\n- You will know who is Whaled at all times.\n- When all living players become Whaled, you will become (3231) Wailord, Whaleman of the Whalepocalypse *at the end of the day*. The town will be notified that \"The Whale God has risen!\"\n- This role cannot spawn with Partisans, and no player can become a Partisan while you are alive.\n- Douse Immunity"},{"name":"Abilities (cont.):","value":"*You do support whales.*\nAttack: Unstoppable | Defense: Invincible\nAbilities:\n- Flop on someone's house, killing them and all visitors. You can kill Astral visitors this way.\nAttributes:\n- Roleblock, Control, Redirect, Frame, Mute, Rolestop and Conversion Immunity.\n- Flopping is Astral.\n- It is constantly raining outside, and people don't want to go out much. They cannot visit more than four houses away from them. You are immune to this.\n- Anyone who visits you or you directly kill will drown, dying and appearing as Drowned in the graveyard (role/will cleaned). Drowned players cannot be targeted by any living players.\n- You can drown Astral visitors to you.\n- You cannot be modkilled.\n- If you are Jailed, you will attack the Jailor and all of their visitors. The Jailor will be Drowned."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{},"desc":"Post 3230\n*Do you support whales?*","id":2599,"locked":false}