{"aliases":["400","1989","400%_speedrun","400%speedrun","400%","speedrun","1989d"],"author":"298205270201597955","title":"400% SPEEDRUN (Fourth)","params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Variable","defense":"Variable"},"fields":[{"name":"Abilities (fourth):","value":"- Choose a dead player. You will learn their role, and add its abilities and attributes to your own. Your goal will not change.\n- Heal yourself with Powerful Defense and purge negative effects. Bypasses jailing and blocks execution. (2 uses)\n- Put on a bulletproof vest at night, granting yourself basic defense. (4 uses)\n- Choose a player in the day to duel in the following night, roleblocking them. You will secretly choose Scimitar, Rapier, and Pistol. Your target will secretly choose Sidestep, Chainmail, or Backpedal.  Scimitar beats Sidestep, Rapier beats Chainmail, and Pistol beats Backpedal. If your target loses, they are dealt a Powerful Attack.\n- Infect a player with the Plague each night, which will spread whenever players visit you or infected players.\n- Powerful Rampage at a target’s house each night. This is only usable once all players are infected by the Plague."},{"name":"Abilities (fourth, Cont):","value":"- Entrance a player into becoming your Thrall permanently. You learn the role of every Thrall and may choose their actions each night. You still have to kill your Thralls to win. You must wait a night after using this ability successfully.\n- Control one player each night, forcing them to target another, if possible. You will learn the role of the player you control.\n- Douse a player each night, disguising them as the “Arsonist (87)”. If you target yourself with this ability, you will instead deal an unstoppable attack to all Doused players.\n- Powerful attack a player on full moon nights. Once this ability kills one player, it can be used every night. After the second kill, this ability rampages. After the third kill, it deals an unstoppable rampage instead.\n- Basic attack a player each night.\n- Powerful Rampage at someone’s night during full moon nights. Or, choose yourself to attack your own visitors instead."},{"name":"Attributes (fourth):","value":"- Detection Immunity\n- Roleblock Immunity\n- Control Immunity\n- Basic Defense\n- Invincible Defense once all other living players become infected by the Plague.\n- The first time you are lynched, you will survive. The following night, you may choose a guilty or abstaining voter to haunt, killing them with an unstoppable attack.\n- If someone attempts to roleblock you, you will retaliate with a basic attack instead. If this kills them, it will make their will unreadable by covering it in blood. In any night, you may opt to spare roleblockers instead."},{"name":"Attributes (global):","value":"- You start the game in your First form. In addition to these attributes, you will have the attributes and abilities marked as First.\n- You must complete your First Goal. Once you do, the game will restart, with all players retaining the roles they started the game with, but you will move on to your Second form.\n- Completing the game in your Second form will restart it with your Third form, then your Fourth form, then finally you’ll win the game.\n- The game will not restart if you fail to complete your current goal.\n- You won’t be allowed to join factional chats in any form.\n- You can’t target yourself with any abilities except for those that specifically say they can.\n- You may multitask.\n- ALL deaths are cleaned until you reach your Fourth form.\n- Conversion Immunity"},{"name":"Goal:","value":"Fourth: Live to kill every last player, including all neutrals."}],"meta":{},"desc":"Post 1989D","id":261}