{"aliases":["1607","seasonal_affective_disorder","seasonalaffectivedisorder","seasonal","affective","disorder","sad","1097u"],"author":"189932350791090176","title":"Seasonal Affective Disorder","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Unseen","subalignment":"Support","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Converted from:","value":"Uwa!"},{"name":"Abilities:","value":"- Autumn (Night): Choose someone to accumulate a leaf pile in front of their house. The path to their house will become much more obscured. Your target's ability will fail if they target someone that is not within two spaces of the role list of them, and vice versa.\n- Winter (Night): Choose a target and lower the temperature in their house. They will be roleblocked and covered in frost. If they are not visited by at least two non-Unseen players tomorrow night, they will be dealt an Astral Basic Attack. They will receive the standard message for being covered in frost.\n- Spring (Night): Bully someone. They will become much more self-conscious about performing their ability. Their ability will fail if any other player visits their target."},{"name":"Abilities (cont.):","value":"- Summer (Night): Apply a sunburn to your target. This will cause your target to perform their ability much more slowly as they will be in pain from their sunburn. Their action will have the lowest possible priority, and they will count as visiting the smaller number of players in between them and their target on the role list. This will additionally ignite any douses on the target."},{"name":"Attributes:","value":"- If you were converted from Uwa!, you will continue where you left off on your ability order; otherwise, on Night 1, you may use the ability of the season it was on the actual day when Day 1 started.\n- The effects of your abilities only apply the night you use them."},{"name":"Goal:","value":"Unseen, except the U is pronounced with a Y sound and the double Es are pronounced like one E."}],"meta":{},"desc":"Post 1607 (I think)\n*Everything can stop on a quarter...*","id":2725,"locked":false}