{"aliases":["1579","w.d._gaster","wd_gaster","w.d.gaster","wdgaster","wd","gaster","w.d.","wg"],"author":"189932350791090176","title":"W.D. Gaster","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Set your FUN event values, FUN value gains, and location on Night 1. This action processes immediately.\n- Select a player and set their FUN value to a particular number at night."},{"name":"Attributes:","value":"- Each player in the game has a certain FUN value associated with them. They will not be told what this value is unless they are informed via a FUN event. A FUN value is a number in the range of 0 - 9. All players start with a FUN value of 0. If a player’s FUN value exceeds 9, it instead becomes the last digit.\n- You must choose a player on Night 1 to create a Fake Hallway at their house. If this player dies, you must re-place the Fake Hallway the following night, which processes immediately.\n- If you are attacked at night, your attacker will be notified that their target vanished before their very eyes. If you are lynched during the day, the Town will be notified that the player they attempted to lynch vanished before their very eyes. In both cases, the kill **will** fail."},{"name":"Attributes (cont.):","value":"- Players can modify their FUN value by performing certain actions. You must assign a FUN value gain to each of the following actions during the first night. FUN value gains are a positive number that will be added to a player’s FUN value once they perform this action. You cannot assign the same gain to more than one action. If you leave any actions unassigned, they will be randomized.\n> - Visit another player.\n> - Kill another player.\n> - Have your ability stopped (roleblock, fail, prevented).\n> - Be visited by more than one player.\n> - Vote for another player.\n> - Survive an attack.\n> - Send a whisper.\n> - Receive a piece of night feedback other than ability results, notifications from a FUN event, or “slept peacefully”.\n> - Do not perform your night ability.\n> - Visit W.D. Gaster’s location."},{"name":"Attributes (moar.):","value":"- There are certain FUN events that are triggered when a player reaches a certain FUN value. FUN events are triggered at the end of a day or night phase. Five FUN events will be selected at random: one of the Gaster Follower Encounters, one of either Goner Kid or Clam Girl Encounter, Sound Test, one of Wrong Number Song or Alphys Call, and Fake Hallway. You must assign fun values to each of these five events. If you do not assign FUN values to them, they will be randomly assigned, and you will not be notified what the values are (other than Fake Hallway).\n> - Gaster Follower 1 Encounter: Player will be notified of their FUN value.\n> - Gaster Follower 2 Encounter: Player will be notified of one of the FUN values of the Fake Hallway event.\n> - Gaster Follower 3 Encounter: Player will be given three players one of which whose house is the location of the the mysterious door.\n> - Goner Kid Encounter: Player will learn the FUN value gain associated with one random action."},{"name":"Attributes (why.):","value":"> - Clam Girl Encounter: Player will learn the last digit of their total FUN value gain over the past day and night phase.\n> - Sound Test Room: If player visited a player within two spots of the role list of W.D. Gaster’s location, they will hear Gaster’s Theme being played.\n> - Wrong Number Song: Player will be notified of three players who are not W.D. Gaster.\n> - Alphys Call: Player will be notified of three players whose houses are not the location of W.D. Gaster.\n> - Fake Hallway (2 values): Player will be able to encounter W.D. Gaster if they visit W.D. Gaster’s location.\n- If a player visits the player whose house you hid the Fake Hallway at AND the player's FUN value is equal to one of the FUN values of the Fake Hallway event, you will instantly vanish from the game, and the player(s) who found you will automatically win the game."},{"name":"Goal:","value":"Survive until the end of the game without being located."}],"meta":{},"desc":"Post 1579\n*Beware of the man who speaks in hands.*","id":2729,"locked":false}