{"aliases":["-17","sax_is_mean_and_a_bully_and_should_perish_and_die","saxismeanandabullyandshouldperishanddie","sax","is","mean","bully","should","perish","die","simaabaspad","simbspd"],"author":"536648090183270441","title":"Sax Is Mean And A Bully And Should Perish And Die","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Killing","unique":"False","attack":"Overkill","defense":"None (Overprotective against Sax and any of their roles)"},"fields":[{"name":"Ability:","value":"Check if someone is either Sax or one of their roles. If they are, you will mark them."},{"name":"Attributes:","value":"When Sax and all of their living roles are marked, you will kill them all at once, and automatically win, as the UN arrests all of the Town for their crimes against Sax.\n-You automatically roll if Post -16 Is rolled. Then Post -16 Is rerolled to this role. This bypasses everything and cannot be stopped, no matter what any other rolecard states. You win against Post -16 no matter what their rolecard says. This Is final and cannot be stopped by anything. Any edits done to Post -16 after this are immediately retconned."},{"name":"Current Post -16:","value":"> Post -16\n> Accent Is Mean And A Bully And Should Perish And Die (Town Killing)\n> Attack: Overkill\n> Defense: None (Overprotective against Accent and any of her roles, including Sax Is Mean And A Bully And Should Perish And Die)\n> _ _\n> Ability: Check if someone is either Accent or one of her roles. If they are, you will mark them.\n> _ _\n> Attributes: When Accent and all of her living roles are marked, you will kill them all at once, and automatically win, as the UN arrests all of the Town for their crimes against Accent. You cannot die to Sax Is Mean And A Bully And Should Perish And Die, even though it says otherwise. You do not care what that role card says, because they're just words on a piece of plastic. All votes against you made by Accent or one of her roles are invalidated.\n> _ _\n> Goal: Kill Accent and all of her roles."},{"name":"Goal:","value":"Kill Sax and all of their roles."}],"meta":{"cannot_spawn":"true"},"desc":"Post -17","id":2966,"locked":false}