{"aliases":["2451","darumaka"],"author":"536648090183270441","title":"Darumaka","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Pokemon","subalignment":"Base","unique":"False","attack":"Basic","defense":"None"},"fields":[{"name":"Abilities:","value":"-During the day, switch between your two Pokémon Abilities. May be used alongside any other day abilities\n-**Flare Blitz** - Deal an Attack to a player. You choose the value of this attack. You will get hit back with an attack aswell depending on the value you chose. None and lower: None. Basic: Basic. Powerful: Powerful. Unstoppable:  Unstoppable. Overkill: Overkill.\n-**Focus Energy** - Day Ability. The following night, any chances of additional effects while using your abilities is tripled.\n-**Ice Punch** - Has a 10% chance of freezing target player. If it doesnt, it roleblocks target player.\n-**Evolve**  Evolve into Darmanitan, Galarian Darmanitan, Darmanitan Zen Mode, or Galarian Darmanitan Zen Mode.\nYou may not use this ability until you have successfully killed two players.\nThe form you will evolve into depends on the following:\nYou're holding an Icy Rock --> Galarian Darmanitan\nYou're not holding an Icy Rock --> Darmanitan"},{"name":"Abilities (cont.):","value":"You're holding an Icy Rock and you had the Inner Focus Ability at the moment of the evolution --> Galarian Darmanitan Zen Mode\nYou're not holding an Icy Rock and you had the Inner Focus Ability at the moment of the evolution --> Darmanitan Zen Mode"},{"name":"Attributes:","value":"-Any time you successfully freeze a player, you will be given the option to hold an Icy Rock or not."},{"name":"Pokémon Ability:","value":"**Hustle** - Any of your Attacks' values are upped by 1, but you have  a 20% chance of missing them. If you miss them, you will not attack and any other role will act as if you never committed the ability in the first place.\n--\n**Inner Focus** - Any of the additional effects while using your abilities is doubled."},{"name":"Goal:","value":"Pokémon Goal"}],"meta":{},"desc":"Post 2451\n*People used to use feces of Darumaka for heat.*","id":2980,"locked":false}