{"aliases":["2203","your_turn_to_die","yourturntodie","your","turn","die","yttd","ytd"],"author":"536648090183270441","title":"Your Turn To Die","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"None","defense":"None (Invincible)"},"fields":[{"name":"Ability:","value":"-Night 3, Force half of all living players into the Main Game."},{"name":"Attributes:","value":"-The game has 2 phases: a \"Trading Phase\" and a \"Main Game Phase.\" The \"Main Game Phase\" is divided into 2 Phases. The \"Preliminary Phase\" and \"Voting Phase.\"\n-Each Phase lasts 24 hours (except the Main Game Phase, who lasts 48)\n-At the beginning of the Trading Phase, everyone is assigned a card: One person gets the Keymaster card, another gets the Sage card, and a final one gets the Sacrifice card. Everyone else gets Commoner cards.\n-For the rest of the Trading Phase, players may choose any player (including themselves)'s card to be traded with another player of their choice. The player(s) do not know who caused the trade, or who originally had the card they were traded with. They will only know a trade has happened, and what their new card is.\n-During the Preliminary Phase, players discuss and vote for players. At the end of this Phase, half of the players with the most votes will be the only available players to vote in the next phase, and everyone else is saved."},{"name":"Attributes (cont.):","value":"-During the Voting Phase, players discuss and vote for players. Then, at the end of the game, the players with the most votes is dealt an Unstoppable Attack (or something else happens according to the card they had).\n\n--Cards--"},{"name":"Commoner:","value":"This does nothing.\nIf they have the most votes at the end of the Voting Phase, they will be dealt an Unstoppable Attack."},{"name":"Keymaster:","value":"This does nothing.\nIf they have the most votes at the end of the Voting Phase, everyone (themselves included) is dealt an Unstoppable Attack."},{"name":"Sage:","value":"At any point during the Voting Phase, the Sage can use their Divination to learn the current Identity of the Keymaster. 1 use. The Sage cannot lie about their results.\nIf they have the most votes at the end of the Voting Phase, they will be dealt an Unstoppable Attack."},{"name":"Sacrifice:","value":"The Sacrifice can place two votes during the Preliminary Phase and Voting Phase.\nIf the Sacrifice has the most votes at the end of the Voting Phase, everyone except the Sacrifice is dealt an Unstoppable Attack. The Sacrifice can choose one player that will not be dealt an Unstoppable Attack alongside the Sacrifice."},{"name":"Goal:","value":"Survive the Main Game."}],"meta":{},"desc":"Post 2203","id":3002,"locked":false}