{"aliases":["1396","last_demon","lastdemon","last","demon","ld"],"author":"536648090183270441","title":"Last Demon","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Evil","unique":"False","attack":"None","defense":"*Hell Bent*"},"fields":[{"name":"Abilities:","value":"-Add someone into your **Soul.**\n-Pick someone in your **Soul**. Redirect them to someone else of your choosing. May include you.\n-Tempt a player's house, redirecting all of their visitors into the next player on the player list. The last player cycles back to the first.\n-[Soul Blast-4] When using this ability, you may pay the cost. If you do, you redirect all of the players in your **Soul** to you.\n-[Counter Blast-2] When using this ability, you may pay the cost. If you do, pick a player, and remove them from the game entirely. They will be readded back the following night.\n-[Counter Blast-2] When using this ability, you may pay the cost. If you do, you may use up to 2 abilities the next night.\n-[Counter Blast-2] When using this ability, you may pay the cost. If you do, you may use your ability twice the next night."},{"name":"Abilities (cont.):","value":"-[Counter Blast-3] When using this ability, you may pay the cost. If you do, pick 2 players. They now win with you, and you open up a chat with them. If they are Town, they no longer win with Town.\n-[Counter Blast-4] When using this ability, you may pay the cost. If you do, the Town has 2 days to find and kill you, otherwise they automatically lose the game. This Is announced to the Town the following day."},{"name":"Attributes:","value":"-**Counter Blast-X** Pick X damages in your damage zone, and activate them. Once you activate a damage, you cannot deactivate It. You cannot activate an already activated damage. If you cannot activate exactly X damages, you may not Counter Blast."},{"name":"Goal:","value":"Make everyone submit to your tempting. (Live to see the Town lose the game.)"}],"meta":{},"desc":"Post 1396\n*I activate Bunta, Explosion Scientist's ability. I put a damage into the damage zone. I activate Limit Break.*","id":3070,"locked":false}