{"aliases":["102","ringmaster"],"author":"536648090183270441","title":"Ringmaster","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Pale Moon","subalignment":"Head","unique":"True","attack":"Unstoppable/\"Apocalyptic\" (Beats Basic, Powerful and Invincible defense.)","defense":"Basic"},"fields":[{"name":"Abilities:","value":"-Give someone a ticket for the Pale Moon Circus Show.\n-Sacrifice a Pale Moon member."},{"name":"Attributes:","value":"-Giving a ticket roleblocks them for the night, but does not give a special roleblock message.\n-Players with tickets will remove their ticket if they visit any Pale Moon Members. You will be notified of this.\n-Any players will immediately be dealt an Apocalyptic Attack if they have a ticket at the start of the PMCS.\n-If the Ringmaster Is killed, all tickets **that were given out by the Ringmaster** are instantly removed.\n-Sacrificing a Pale Moon member will deal an Apocalyptic Attack to them, and will let you deal an Unstoppable Attack to one player.\n-Players with tickets are notified they have tickets Day 3.\n-You will not kill anybody if the sacrificed Pale Moon does not die."},{"name":"Messages:","value":"\"You have decided to give a ticket at your target.\"\n\"You have decided to sacrifice one of your Pale Moon allies.\"\n\"You were sacrificed by the Ringmaster!\"\n\"You gave a ticket to your target.\"\n\"You saw Player Name burn down their ticket after visiting your circus.\"\n\"The Pale Moon Show has begun. You have trapped all those with a ticket in your Circus!\"\n\"You noticed a Pale Moon ticket in your house's drawer.\"\n\"You were trapped in the Pale Moon Circus Show and was burned alive!\"\n\"You were killed by the Ringmaster using their ally's blood!\"\n\"...they were burned alive in the Pale Moon Circus Show.\"\n\"...they were killed by the Ringmaster.\""}],"meta":{},"desc":"Post 102\n*Welcome to the Pale Moon Circus! Nye heh heh!*\nDetection Immunity\nRoleblock Immunity\nRedirection Immunity","id":3183,"locked":false}