{"aliases":["818","thanos"],"author":"309466628997775360","title":"Thanos","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"True","attack":"Powerful","defense":"Invincible"},"fields":[{"name":"Abilities:","value":"- Check a player for owning an Infinity Stone during the night.\n- Snap half of all living players during the day, immediately modkilling them. 0 Uses, +1 Use if all Infinity Stones are acquired."},{"name":"Attributes:","value":"- At the start of the game, the following Infinity Stones will be distributed randomly between players besides Thanos.\n> Space Stone - The owner of the Space Stone will be informed of all visits to them at the end of each night, and their effects. They may choose to redirect any number of these visits. Can't redirect Thanos.\n> Mind Stone - The owner of the Mind Stone will know the roles of all players. May not be given to a Town or Neutral Benign player.\n> Reality Stone - The owner of the Reality Stone gains Powerful Defense.\n> Power Stone - The owner of the Power Stone may deal a Basic attack to any number of players during the night instead of their normal abilities.\n> Time Stone - The owner of the Time Stone may know who was visited with what effects at the end of each night.\n> Soul Stone - The owner of the Soul Stone will be informed of all whispers and may access any private chat between two or more people."},{"name":"Attributes (cont.):","value":"- Any player with an Infinity Stone who discusses the Infinity Stones, unless they are Thanos themselves, is immediately modkilled, their Infinity Stone forfeited to Thanos.\n- When you find a player with an Infinity Stone, they may choose to either hand it over to you or fight. If they choose to fight, you will both attack each other with your normal attack values. You will then reduce each others' defense levels by 1. Repeat, until one player kills the other, gaining/keeping the Infinity Stone. If you kill each other at the same time, you live and they don't.\n- The host is encouraged to __not__ snap half of all living players randomly, instead doing so as they see fit."},{"name":"Goal:","value":"Find all 6 Infinity Stones and Snap half of all life."}],"meta":{},"desc":"Post 818","id":3304,"locked":false}