{"aliases":["1386","foreboder"],"author":"189932350791090176","title":"Foreboder","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"None","defense":"None (Invincible)"},"fields":[{"name":"Abilities:","value":"- Choose an omen and give it to someone each night."},{"name":"Attributes:","value":"- A player with an omen will be given a disadvantage for the rest of the game based on the omen they received.\n- You may not give the same player more than one omen nor the same omen to more than one player.\n- On the first night you would die from an attack, your defense becomes Invincible.\n- A list of omens is provided in the thread associated with this role card."},{"name":"Goal:","value":"Give out three omens that negatively impact the player receiving the omen."},{"name":"Omens:","value":"- **Anxiety**: Your defense is now Vulnerable.\n- **Attrition**: Every full day and night cycle, you will lose a charge of a random limited-use ability that you did not use that cycle.\n- **Blindfold**: You will no longer receive any night feedback apart from death messages (does not include ability feedback).\n- **Conceited**: Your defense will not be raised by protective abilities.\n- **Eyepatch**: You have a 50% chance to target a random player with any targeted abilities.\n- **Fragile**: All of your abilities have a 75% chance of failing. Lose this omen the first time it causes an ability to fail.\n- **Hit Marker**: If you visit someone who is attacked, all of their attackers will be redirected to you.\n- **Narcolepsy**: After using an ability, you must wait for another full day and night cycle to pass before using another ability.\n- **PR Team**: You may not send more than ten messages each day.\n- **Revenge**: When you visit a player, you will be dealt an Attack equal to their Attack value."},{"name":"Omens (cont.):","value":"- **Unruly**: If you do not perform your night ability, and you have a night ability that you could have used, you will be poisoned.\n- **Wanted Poster**: You require two-thirds of the majority vote (rounded down) to be lynched.\n- **Whistleblower**: All of your whispers will be shown publicly."}],"meta":{},"desc":"Post 1386\n*If you can't take the heat...*","id":3468,"locked":false}