{"aliases":["1173","bargainer"],"author":"858544846531592222","title":"Bargainer","params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Basic","defense":"None"},"fields":[{"name":"Abilities:","value":"- Attack someone at night.\n- At any point in the game, attempt to strike a deal with someone. They will be privately notified, and given the choice to accept or deny. If they accept, you‘ll gain an upgrade, based on how many deals you‘ve secured.\n— 1: You gain Roleblock immunity. \n— 2: You gain Basic defence.\n— 3: Your attack is upgraded to Powerful.\n— 4: You may now kill 2 people at night. You can disguise the cause of death of the second kill as any other role in GIM. \n— 5: Everyone alive is dealt an Overkill attack and you immediately win the game."},{"name":"Abilities (cont.):","value":"- Anyone who accepts your deal gains a one-use Powerful day gun, though they can't use it on you. People who you attempt to strike deals will not know how many deals you've secured in the past.\n- You can use this ability multiple times in a day/night cycle, but you can only have one deal open at a time. Players have 24 hours to decide whether or not they accept, otherwise it's considered a denial. However, a player may not intentionally stall the timer, so they must make their choice as soon as they see the notification."},{"name":"Attributes:","value":"- You will publicly be revealed as the Bargainer at the start of the game.\n- If you're lynched, everyone who voted you will be dealt an Overkill attack. If you die by any method besides lynching, anyone who contributed to your death will be dealt an Overkill attack. It's up to the host's discretion as to what counts as \"contributing\", but players may ask for clarification on whether or not something qualifies at any time. If you're solo-killed by a Town/Good Faction role, two other Town/Good faction roles will die at random. If your death would end the game, this attribute does not resolve.\n- You're conversion immune."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{},"desc":"Post 1173\n*The ultimate tool is a silver tongue.*","id":35}