{"aliases":["554","gambler"],"author":"803345494650781697","title":"Gambler","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Evil","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Source (deleted):","value":"https://www.blankmediagames.com/phpbb/viewtopic.php?f=27&t=119018"},{"name":"Source (Archive):","value":"https://web.archive.org/web/20220523232700/https://www.blankmediagames.com/phpbb/viewtopic.php?f=27&t=119018"},{"name":"Abilities:","value":"-Bet on two people every night who are most likely to be killed and/or lynched."},{"name":"Attributes:","value":"-If you win a bet, you are able to bet again the next night and also choose between being able to distract a player, or obtaining a self-heal.\n-Distraction blocks a target from using their role’s night ability.\n-Obtaining a self-heal gives you powerful defence when used."},{"name":"Notifications:","value":"-\"You have decided to bet on X and Y.\" (you see this notification on the night when you are placing your bets.)\n-\"You do not have enough money to bet again tonight.\" (you see this notification on the night after you placed your last two bets and your last two bets were both wrong.\")\n- \"At least one of your last two bets were correct!\" (you see this notification on the night after you placed your last two bets and at least one of them was correct. You will receive a special menu interface during the first 7 seconds, prompting you to either distract someone that night or obtain a self-heal. The interface will disappear after 7 seconds. If you chose to obtain a self-heal, you can place your two bets like usual. If you chose to distract someone, you will first choose who you would like to distract and then you can place your two bets.)"},{"name":"Notifications (cont.):","value":"- \"You have obtained a self-heal!\" (you see this message during voting time in the day if you chose to obtain a self-heal the previous night when your last two bets were successful.)"},{"name":"Goal:","value":"Bet correctly three times."}],"meta":{},"desc":"Post 554","id":3749,"locked":false}