{"aliases":["843","crazy_dave","crazydave","crazy","dave","cd"],"author":"765276088183029810","title":"Crazy Dave","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Varies","defense":"Basic"},"fields":[{"name":"Abilities:","value":"> Plant plants to defend your lawn."},{"name":"Attributes:","value":"> You start with 100 sun.\n\n> Every night, gain 50 sun. Other plants can increase this amount.\n\n> You can only have one of each plant unless you have all plants alive, in which case you can plant duplicates.\n\n> If someone visits you, they will be effected by your plants. They will also destroy a random plant.\n\n> Once half the players have died, you can send your plants to attack people. Your visits are astral.\n\n> Your visit will happen before your plants are destroyed."},{"name":"List of plants:","value":"**__ (formatted as [Name] - [cost] | Ability when visited/Ability when visiting.) (If a plant does not have an ability when visiting, it can't visit.)\n> Sunflower - 50 sun | Gain an extra 50 sun per night.\n\n> Sunshroom - 50 sun | Gain 25 sun per night for 2 nights, then gain 100 sun per night. This will be the last plant to be destroyed.\n\n> Peashooter - 50 sun | Deal a basic attack to a visitor/your target.\n\n> Walnut - 50 sun | Gain powerful defense the next time you are attacked. This will be the first plant destroyed when you are visited unless you have a tallnut.\n\n> Fume Shroom - 75 sun | Poison all visitors/poison all visitors to your target.\n\n> Spikeweed - 75 sun | Deal a powerful attack to a visitor.\n\n> Tallnut - 100 sun | Gain invincible defense the next time you are attacked. This is the first plant to be destroyed. (Only 1 can ever be planted.)"},{"name":"List of plants (cont.):","value":"> Cherry Bomb - 200 sun | No ability/deal an Unstoppable attack to your target and a basic attack to all their visitors. (This can only be bought once you can visit.)"},{"name":"Win Con:","value":"> Kill all who oppose you."}],"meta":{},"desc":"Post 843\n*\"Greetings, neighbor! The name's Crazy Dave. But you can just call me Crazy Dave.\"*","id":4028,"locked":false}