{"aliases":["897","the_nameless_samurai","thenamelesssamurai","nameless","samurai","tns","ns"],"author":"521123471460270121","title":"The Nameless Samurai","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Variable","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- **Saber**: Deal a Basic attack to someone. If you succeed in killing them, gain all their attributes. 1 night cooldown.\n- **Lancer**: Choose a player to try to kill. You will fail to kill them and instead deal an Unstoppable attack to two completely random players other than yourself. These attacks cannot be prevented by any means. 1 night cooldown.\n- **Archer**: Deal 10 Unstoppable attacks to someone. You may not target your direct living neighbours with this ability. Additionally, the death messages will flood your target's chat log, causing them to be unable to receive any other messages that night. 1 night cooldown.\n- **Rider**: Deal a Powerful rampage attack to someone. While using this ability, you are roleblock, redirect, detection, and conversion immune. 2 night cooldown."},{"name":"Abilities (cont.):","value":"- **Assassin**: Deal a Basic attack to someone, disguising their cause of death as whatever you choose. If it's a Full Moon, this ability is Astral. If it's Night 4, the attack mimics the mechanics of the disguised cause of death. 1 night cooldown.\n- **Caster**: Add a charge to your Magical Blast and/or attack someone with your Magical Blast, dealing a Powerful attack to them and the number of players adjacent to them equal to twice the amount of charges your Magical Blast has. This will remove all charges from your Magical Blast. 1 night cooldown.\n- **Berserker**: Deal an Unstoppable attack to two players. If you're dead and this ability isn't on cooldown, you may use it once the night after you die the game can't end until then. 2 night cooldown."},{"name":"Attributes:","value":"- Players you kill will have their causes of death hidden unless otherwise specified."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{},"desc":"Post 897\n*I alone walk the path of a thousand stars.*","id":4051,"locked":false}