{"aliases":["1598","an_abomination","anabomination","abomination"],"author":"562746047596593163","title":"An Abomination","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Rock","subalignment":"Espionage","unique":"False","attack":"Spirit Power","defense":"Fallen Angel Aura"},"fields":[{"name":"Abilities:","value":"- (First) Attack a target with the effect of a random killing role.\n- (Second) Select a target to douse. Or, ignite your doused targets.\n- (Third) Infect someone with a Biohazard plague, except Biohazards can catch it and Rocks can't.\n- During the day, spend 2 sun or 10 points for an extra vote.\n- At any phase, produce (night # / 2) sun.\n- With the Necronomicon, choose a player. You will control them and poison them. They will be redirected to the target you controlled them to tomorrow night.\n- **Final Judgement** - Select a target. Roleblock all your visitors and their visitors, then coldsnap.\n- Deathly Gaze (Blood Moon) - Attack all your visitors and negate all negative abilities that were used against you.\n- Place a strike on a target, then rehearse.\n- (Concert) Offer to recruit a player to the Rock. This will only change their goal. They may choose to accept or decline your offer. 2 uses.\n- After killing two people, evolve during the day. You gain the ability to perform a Raid."},{"name":"Attributes:","value":"- Each kill grants 1 Not Saint point. Gain 4 Not Saint points to regain access to the factional chat.\n- You existing can allow Hunting Moons to spawn.\n- If Umbrae doesn't exist, you may call Blood Moons. Otherwise, you are buffed when they call one.\n- On a Hunting Moon, you are also the number ahead of you. You may multitask both abilities.\n- During the Pale Moon Circus Show, you are also the number behind you. You may multitask both abilities.\n- If a Hunting moon occurs during a Pale Moon Circus Show, you are all 3 and may mutlitask all abilities.\n- You have 3 codewords. Your teammates know your role and codewords.\n- Your attack is based on the attacks Spirits do/would have that night.\n- Your defense is based on how many teammates are alive, similar to Fallen Angels.\n- You gain the Necronomicon when no Coven are left.\n- At the beginning of the game, you are randomly the First, Second, or Third. You switch spots similar to the Last, at the beginning of each night."},{"name":"Attributes (cont.):","value":"- For every other striked player, you may perform an extra ability at the same time.\n- Roleblock immune. If someone tries to roleblock you, you will attack them.\n- You have two attributes from a random Android role.\n- Your Concert begins on Day 5. Rehearsing works the same. Your radius is 3."}],"meta":{},"desc":"Post 1598","id":4258,"locked":false}