{"aliases":["1565","degree"],"author":"562746047596593163","title":"Degree","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Something","subalignment":"Support","unique":"False","attack":"Powerful","defense":"None/Basic"},"fields":[{"name":"Abilities:","value":"- Degrees in Temperature: Roleblock a player by freezing their house, or burn a player by burning their house.\n- Degrees in Angles: Rotate the Town and move all players down any amount of slots (moving players down from the lowest slot sets them to 1). This is processed before all other abilities.\n- Degrees in Studying: Learn a skill from another player. Gain a one time use of the ability they are using tonight.\n\nAttributes;\n- You are an Underworld, Mathematic, Everfrost, and Agent all at the same time. You have access to the factional chat if only one of those exists.\n- If multiple exist, you won't know faction members, and they won't know you - only that you exist. Gain permanent Basic defense if this is the case.\n- For obvious reasons, if Agents are the only faction you're part of, you don't get access to the factional chat."},{"name":"Abilities (cont.):","value":"- Regardless of the amount of factions, if you are an Agent, you will receive your code words. You will not know other Agents' code words if there are multiple factions you are part of, however.\n* Factions you are apart of (except Agents) will always be told what you are doing, under the identity of \"Degree\". If someone else is performing a factional ability, you cannot choose to use it.\n- If Underworld exists, you may use the factional douse.\n- If Everfrost exists, you may use the factional roleblock.\n- If Agents exist, you may use the factional kill.\n- If Mathematics exist, you will always know the exact amount of points left.\n- Your abilities never cost points, but getting visited will still generate points for the faction.\n- You may still spend points to attack.\n- You cannot spend points to change roles. Nor can this role be changed into by spending points.\n- For spawning purposes, you count as all Mathematic alignments but Head.\n- You cannot be promoted, unless you are only part of one living faction."},{"name":"Goal:","value":"Underworld, Everfrost, Agent, or Mathematic goal"}],"meta":{"spawn_as":"faction:underworld,everfrost,agent,mathematics"},"desc":"Post 1565","id":4290,"locked":false}