{"aliases":["5151","the_best_gim_host","thebestgimhost","best","gim","host","tbgh","bgh"],"author":"906936197266423839","title":"The Best GIM Host","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Evil","unique":"False","attack":"Modkill","defense":"None (Immortal)"},"fields":[{"name":"Abilities:","value":"- **Stupidify** - Use this on any day. That night, you will get a list of 5 roles, 3 are in the game and two are not. You may add one role of your choosing to the list, then reorder them in any order you like. The host will then give each Stupidified slot two roles to choose from that are on this list; they convert to the one they choose. (2 use)\n- **Unbore** - Use at night. The host must roll for any event in the game the next day. Reroll if the event involves day counters that have already passed. (3 use)\n- **True Chaos** - May only be used when all other abilities are used. First, modkill a player. Then, activate Final Countdown ((old) Event 29), except every dead player gets a new role that YOU get to choose. Also, every role in the game obtains a Modifier. You now reroll into a role and modifier of host’s choosing, and ANY new event starts. Treat the day as day one for the new event."},{"name":"Attributes:","value":"- If this were ever to reroll into a town faction or REF slot, for any reason, **True Chaos** and **Stupidify** may only roll into a town faction or a REF role for that game.\n- One-shot Immortal shield, and the role you get after **True Chaos** either gets a One-shot Overkill attack, or a One-shot Immortal shield. You may decide this after you get the role.\n- This role can win three times;\n- By achieving your goal,\n- By achieving your new goal after **True Chaos**\n- By guessing the whole rolelist, at any point in the game. This includes after **True Chaos**.\n- If anyone ever wins THREE times, they are the new owner of this role."},{"name":"Goal:","value":"Unleash True Chaos onto the world."}],"meta":{},"desc":"Post 5151\n*Okay guys, you have to admit. That was an EPIC troll! /ref*","id":4310,"locked":false}