{"aliases":["1606","caino_arukat","cainoarukat","caino","arukat","ca"],"author":"521123471460270121","title":"Caino Arukat","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"**Dimension Shift**: Move a player into Dai'ar Kul-ya on a space of your choosing.\n**Continuum Fracking**: Create one of your generators in a space on Dai'ar Kul-ya that is not occupied.\n**Time-Space Embodied**: Create one of your artifacts in a space on Dai'ar Kul-ya that is not occupied. Each artifact may only be created once, but artifacts can be recreated 3 nights after being destroyed."},{"name":"Attributes:","value":"**Dai'ar Kul-ya**: You have access to a 3x3x3 three-dimensional cube in which you can place generators, artifacts, and players. If another player attacks you, they are moved onto Dai'ar Kul-ya on a space of their choosing. Players in Dai'ar Kul-ya are removed from the main game and cannot view chats, be interacted with, use abilities, or take other game actions. There is an additional day chat each day that players inside Dai'ar Kul-ya have access to, but there is no lynch. Players within Dai'ar Kul-ya can choose to move one space orthagonally within Dai'ar Kul-ya each night. If they move onto an artifact or generator, it is destroyed. If they move onto another player, the two \"fight\", where each may use an ability of their choice on the other. If they move onto an unoccupied corner space, they can choose to leave Dai'ar Kul-ya. Players know their location in Dai'ar Kul-ya, but they cannot see generators, artifacts, or other players."},{"name":"Attributes (cont.):","value":"**Subspace**: If you would be dealt an attack, instead, the attack is converted into \"damage\"— Basic: 1, Powerful: 2, Unstoppable: 3, Overkill+: 4— and then that damage is divided evenly between him and all unoccupied spaces in Dai'ar Kul-ya. For example, if none of the spaces were occupied and you were dealt a Basic attack, each of them, and you, would each receive 1/28 of a damage, or approximately 0.036 of a damage. If you put a generator or artifact onto a space with damage on it, he takes that damage. If a player is put onto, puts themself onto, or moves onto a space with damage on it, that player takes that damage. Players, including you, have \"HP\" based on their Defense value— None: 1, Basic: 2, Powerful: 3, Invincible: 4, Overprotective: 5— and, upon taking total damage greater than or equal to their HP, they die. Players with Vulnerable defense die immediately upon taking any damage. Players know how much HP they have at all times while in Dai'ar Kul-ya."},{"name":"Attributes (more):","value":"Losing HP does nothing while not in Dai'ar Kul-ya, but if a player leaves Dai'ar Kul-ya then returns, they have the same amount of HP.\n- You may multitask."},{"name":"Generators:","value":"*Each generator produces X a colour of Energy each turn you take, where X is the orthogonal distance between that generator and the specified corner of Dai'ar Kul-ya (the least number of orthogonal moves required to get from one to the other) each night.* \n- Mine: Red, Top-Front-Right\n- Port: Blue, Top-Back-Left\n- Factory: Yellow, Bottom-Front-Left\n- Farm: Green, Bottom-Back-Right"},{"name":"Artifacts:","value":"*Each artifact gives a random player inside Dai'ar Kul-ya among those orthogonally closest to it a status each night. All statuses last 3 nights. The potency of the status given is determined by the total sum of that generator's two colours of Energy that have been produced by your generators so far.*\n- Vessel: Red/Blue, target is moved X spaces in a random orthogonal direction or as far as possbile in Dai'ar Kul-ya each night, then their actual move processes, but this does not cause them to leave Dai'ar Kul-ya if it moves them onto a corner square. X is 0 if Energy is 0, 1 if Energy is between 1 and 10 inclusive, 2 if Energy is between 11 and 20 inclusive, and 3 if Energy is higher than 20."},{"name":"Artifacts (cont.):","value":"- Transmitter: Red/Yellow, information about target is revealed to you each night depending on Energy. If Energy is between 1 and 10 inclusive, you learn the target's goal. If Energy is between 11 and 20 inclusive, you learn their target's role. If Energy is higher than 20, you learn everything the target has done over the course of the entire game.\n- Incinerator: Red/Green, target takes X damage each night. X is 0 if Energy is 0, 0.2 if Energy is between 1 and 10 inclusive, 0.4 if Energy is between 11 and 20 inclusive, and 0.6 if Energy is higher than 20.\n- Helm: Blue/Yellow, target is weakened each night depending on Energy. If Energy is between 1 and 10 inclusive, their defense goes down a tier that night. If Energy is between 11 and 20 inclusive, their defense goes down a tier permanently. If Energy is higher than 20, their defense goes down a tier permanently then they're dealt a Basic attack."},{"name":"Artifacts (more):","value":"- Incubator: Blue/Green, target loses part of their role each night depending on Energy. If Energy is between 1 and 10 inclusive, they lose a random attribute each night. If Energy is between 11 and 20 inclusive, they lose a random attribute and a random ability each night. If Energy is higher than 20, they lose all abilities, attributes, attack, and defense immediately.\n- Mirror: Yellow/Green, you gain target's powers each night depending on Energy. If Energy is between 1 and 10 inclusive, you may use one of their abilities at random. If Energy is between 11 and 20 inclusive, you may use any number of their abilities. If Energy is higher than 20, you may use any number of their abilities and gains any number of their attributes.\n- Rainbow: Red/Blue/Yellow/Green: Target is permanently converted to winning with you if Energy is higher than 50. Only one target may be converted per game."}],"meta":{},"desc":"Post 1606\n*this doesn't have that much shit if you think about it*","id":4391,"locked":false}