{"aliases":["4772","dealer"],"author":"562746047596593163","title":"Dealer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Unstoppable","defense":"Powerful"},"fields":[{"name":"Abilities:","value":"- Target someone to play your twisted game."},{"name":"Attributes:","value":"- __**Part of the Daily Streak faction.**__ You will always have no defense if this is the case, but your game will act as if you had whatever defense you're supposed to.\n- You and your target will spend the night playing a Russian Roulette variation (literally Buckshot Roulette) until someone dies. Your target is blocked from using abilities.\n- At the start of each round, you pick how many bullets and of each type are in the chamber, but not the order.\n- At the start of the night, your target goes first, not you.\n- Both players will always have the Shotgun item.\n- Both you and your target have a certain amount of charges depending on how many lives you have left. When being shot by a live shell, you lose a charge. When a player runs out of charges, they lose and die.\n- If you lose your game, lose a tier of defense. If on None, you die to yourself."},{"name":"Attributes (cont.):","value":"- At the start of every round (when shells are put in the shotgun), both players will draw a certain amount of items, depending on the amount of lives you have. The Shotgun cannot be drawn as an item."},{"name":"Items:","value":"- Shotgun: Shoot yourself or the other player. If you shoot yourself with a blank, take another turn.\n- Handcuffs: Skips the other player's next turn. Cannot be stacked.\n- Sawblade: Shotgun deals two damage. Lasts for one shell, whether blank or live.\n- Magnifying Glass: Learn if the next shell is blank or live.\n- Beer: Rack the shotgun, ending the round if it was the last shell.\n- Cigarette: Takes the edge off, regaining a charge. You cannot go past the maximum amount of charges."},{"name":"Lives:","value":"- Powerful defense: 2 charges, 0 items drawn.\n- Basic defense: 4 charges, 2 items drawn.\n- Powerful defense: 4 charges, 4 items drawn. When running out of charges, gain one final charge, but Cigarettes become redundant."},{"name":"Goal:","value":"Kill 3 players in your twisted game."}],"meta":{},"desc":"Post 4772\n*2 LIVE ROUNDS. 1 BLANK.*","id":4430,"locked":false}