{"aliases":["3091","steve"],"author":"504813861950586891","title":"Steve","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Minecraft","subalignment":"Head","unique":"False","attack":"Dependent","defense":"Powerful"},"fields":[{"name":"Abilities:","value":"**Mine**: Gain either a diamond, gold, iron, stone, or wood. The rarity of each item goes from diamond as the rarest, to wood as the least rare. You may use this ability during the day and night.\n**Craft**: Combine resources in your inventory to craft something.\n**Utilize**: Use an item you have crafted"},{"name":"Attributes:","value":"You are roleblock, redirection, conversion, and control immune.\nYou may multitask."},{"name":"You Can Craft The Following:","value":"Tripwire: Set a trap outside of somebody's house, killing them if they visit.(1 wood, 1 string)\nArrow: Deal a basic astral attack to somebody(You may use this and one other craft in one night)(3 feathers)\nBlaze rod: Set two people alight on fire(3 blaze powder)\nBow: If you craft this, your visits are permanently astral(3 string, 2 wood)\nDiamond sword: Pierces protection, Attack two people at once, Unstoppable(2 diamonds, one wood)\nIron sword: Attack two people at once(2 iron, one wood. Powerful) \nStone sword: Attack one person, pierces protection(Unstoppable)(2 stone, one wood)\nGold Sword: Attacks 4 people, breaks after a use(Powerful)(2 gold, 1 wood)\nWood sword: Attack one person(Basic)(3 wood)\nCooked Meat: Give this to somebody: If they were to die tonight, they do not(1 blaze powder/rod, 1 Meat.)(1 use)\nEye of ender: Become one step closer to unlocking the dragon(1 ender pearl, 1 blaze powder)\nMinecart: Redirect 5 people of your choice into one person(3 Iron)"},{"name":"You Can Craft The Following (cont.):","value":"Enchanted Ender pearl: Upon crafting this, gain an attribute that lets you avoid being lynched once. (5 ender pearls)\nEnchanted Flesh: Upon crafting this, you are allowed to use utilize twice the next night(5 flesh)(1 use)\nEnchanted Blaze powder: Upon crafting this, the next night, you may instantly mod kill 3 people.(5 blaze powder)\nEnchanted Bone: Tame one person, permanently converting them to your side.(1 use)(5 bone)\nEnchanted String: Use this to set a trap, randomly roleblocking half of the current alive players. You may not roleblock minecraft players(5 string)\nEnchanted Leather: Upon crafting this, you may ride on any minecraft role, making you unable to be targeted(5 leather)\nEnchanted Meat: Upon crafting this, you gain a second life (5 meat)\nStrength Potion: If you craft this, your attack is permanently upgraded by one tier(1 bottle, 1 blaze powder)\nSwiftness potion: If you craft this, you may permanently act twice in one night(1 sugar, 1 bottle)"},{"name":"You Can Craft The Following (moar.):","value":"Poison Potion: You may now poison three people in one night(1 poison eye, 1 bottle)"}],"meta":{},"desc":"Post 3091","id":4436,"locked":false}