{"aliases":["2744","daikenkai"],"author":"174251652524539904","title":"Daikenkai","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Powerful","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Select a player at night. You will inflict them with nonsense language from a rotating head, high tension, and a firm beat. They will be roleblocked.\n- Select a player during the day. At the beginning of the following night, from a 5-match janken match I guide comes tactics for big opinions. You will play 5 games of Rock-Paper-Scissors with this player. Whichever player wins the set gets to send any message they want into the other player's channel. (It will be signed with their name.)\n- Select a player at night. 35 plus 4 divided by 2, the partygoers who don't burst open don't know. You will deal that many rampaging attacks at the selected player's house.\n- Select a player at night. This sociable sound demon screwing into an obtuse angle easily, they dunno from or where to, but anyway he divided the sound. You will blackmail this player for the following day."},{"name":"Abilities (cont.):","value":"- Everyone's winding chatter is a dangling handkerchief. When you use this ability at night, all whispers sent during the following day will be sent into the day chat instead of being sent to their intended recipients. The sender and the intended recipient will be listed on the message."},{"name":"Attributes:","value":"- An alteration in the radar and in the nonsense coming over the airwaves. All investigative abilities that target you will be replaced with a random different investigative ability from any role in <#970046125065265202>.\n- If you start snorin', your heartbeat that's goin' up as much as your personality changes. For every night you choose to do nothing, the amount of abilities you may use during the night is permanently increased by 2.\n- Is really greedy, but there's power and land of the priest's staff and since I was born, I've kept on playin' like this. This attribute doesn't do anything.\n- From 3rd street to 4th street, from main street to the carnal desires, pack up the duties left to you, take it all gently, really, you don't have to worry if you extend over to this slow train. Don Pach Don Pach Don Today, on this Japanese island where they're sexin' it up. You are immune to being Roleblocked."},{"name":"Goal:","value":"That time, that time, I give respect, we'll break it all apart, yo, just like this example. Kill all who would oppose you."}],"meta":{},"desc":"Post 2744","id":4437,"locked":false}