{"aliases":["2058","community_role","communityrole","community","role","cr"],"author":"765276088183029810","title":"Community Role","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Varies","defense":"Basic"},"fields":[{"name":"Abilities:","value":"> **Pawn** - Deal a basic attack to a target. For every 3 players you kill with a pawn, you may decide to promote the pawn into any other chess piece, giving you 1 charge of that piece\n>\n> **Knight** - Deal a powerful attack to a target, and bypass all defense values for the night (except permanent values). 2 uses\n>\n> **Bishop** - Grant yourself Powerful defense for the night and attack a target with a Powerful attack. 2 uses\n>\n> **Rook** - Deal a Powerful Rampage attack to a target player. 2 uses.\n>\n> **Queen** - You have the combined abilities of the Pawn, Bishop and Rook, and their attacking values are upped by 1. 1 use.\n>\n> **Stalk** - Choose a player to stalk at night.\n>\n> **Bankrupt** - Send a player into crippling debt, causing them to become **Desperate**.\n>\n> **Pay** - Control a **Desperate** player. They will become **Paid** for their services.\n>\n> **Transform** - During the day, exchange this ability for any ability in GIM. If someone has the role you tried to copy from, how sad, you die instead."},{"name":"Attributes:","value":"> Your visits are Astral.\n>\n> The first time you would die from an attack, you are given invincible defense.\n>\n> You may use **Bankrupt** and one other ability per night.\n>\n> **Stalk:** \n> At the end of the night you stalk them, as well as the night after, you will learn who they visited that night.\n>\n> After two nights, you will deal a Powerful attack to the players they visited the last two nights.\n>\n> If they did not visit, you will deal a Powerful attack to them.\n>\n> You can only be stalking two players at time.\n>\n> **Bankrupt:**\n> Desperate: Player gains Vulnerable defense until Paid.\n>\n> **Pay:**\n> Control: Reveal's the players role, and forces them into your second target.\n>\n> Paid: The player now wins with you as their new goal."},{"name":"Goal:","value":"> Kill all who oppose you."}],"meta":{},"desc":"Post 2058\n*Viri, Bionic, Jd, and Zage all get credit for suggesting roles.*","id":4441,"locked":false}