{"aliases":["2923","black_marketer","blackmarketer","black","marketer","bm"],"author":"888761463647371284","title":"Black Marketer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"Unstoppable","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- During the night, choose a target to coerce. You'll politely ask them to make a deal with you during the next day, which they may not refuse. If they do not make a choice, they will suspiciously be found missing from the game at the start of the night. 1 use. Gain another use for every three deaths in the game."},{"name":"Attributes:","value":"- Whenever someone hovers targeting you during the night, even if the person switches to another target, you'll prompt them to make a deal the next morning. They'll be informed a Black Marketer struck them up, and may make a deal with you. You'll carry some service out for them, and in return... heh.\n- Deals:\n> - You'll roleblock a player of the target's choice tonight. In return, they'll be blackmailed next morning.\n> - You'll allow the player to hear all whispers for the rest of the game. In return, they'll also permanently be delayed – their actions will take place one night later.\n> - You'll investigate a player of the target's choice. In return, they won't be able to view the day chat anymore.\n> - You'll attack a player of the target's choice. In return, they will mysteriously die of a heart attack the next morning.\n- The night after you make a deal, even if you made multiple, you will carry out each deal. Your target learns the feedback."},{"name":"Attributes:","value":"- Once a person's made a specific deal, they won't be able to make that deal with you again.\n- You're redirect and roleblock immune. If you somehow get prevented from carrying out your deals despite your immunities... that sure sucks, doesn't it? Heh.\n- If Cameraman (2351) tries to strike a deal but has already grown desperate, they may not make the investigation deal with you.\n- After completing your goal, you'll mysteriously disappear from the Town."},{"name":"Goal:","value":"Make three deals over the course of the game."}],"meta":{},"desc":"Post 2923\n*Money'll do you no good, heh. I'm looking for something a little more... \"personal\".*","id":4444,"locked":false}