{"aliases":["2914","evoker"],"author":"412110038358818828","title":"Evoker","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"The Evoker has no natural attack {and relies on abilities.","defense":"The Evoker has no defense and relies on abilities}."},"fields":[{"name":"Capabilities:","value":"- **Evoke** is an ability the evoker may use once per game during the night phase on any alive target they wish. Using this ability causes the target to commit suicide via a modkill, but after their death, the target is able to - for that night only - use one of their prior abilities on anyone regardless of any conditions required to do so.\n\n- The evoker may choose to **summon Evocation Fangs** on any target during the night phase as an ability. The target is dealt a basic attack.\n\n- The Evoker starts with the **Totem of Undying** attribute, which can only be triggered once per game. In any scenario where the evoker would die, the Evoker gains total death immunity as long as feelings of true peace exist in the town (unless the attack is from the player modkilling themselves, in which case the player dies guaranteed.)"},{"name":"Capabilities (cont.):","value":"- The Evoker can cause a {dead }player to {**revive as a vex** for a single night once per game. This ability is chosen by the }evoke{r during} th{e day and may }o{nly be }u{sed on dead players. The player is brou}ght{ back to life for the duration of the next night pha}s{e.} {The vex loses the abilities and attributes }of t{hei}r{ original role and may target someone with an }u{nstoppable attack. The evoker and vex establish a night chat, and ideas on who to targ}e{t} {may be }p{ropos}e{d by the Evoker or the Vex, }a{nd both must }c{hoos}e{the same target by the end} o{f the }n{ight. If one of the players de}c{id}e{s} {not to in}p{ut, th}e{ othe}r {player's decision is chosen. If neither can agree on a target or neither choose a target, nothing happens and the vex returns to the land of the dead at the end of the }night."},{"name":"Goal:","value":"The Evoker's goal is to live to see {town lose the game, ensuring that }true peace {never }spread{s} amongst all alive players."}],"meta":{},"desc":"Post 2914","id":4445,"locked":false}