{"aliases":["3078","sporebound"],"author":"888761463647371284","title":"Sporebound","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Infect someone with your touch each night, afflicting the `Spores` status. The status is considered a positive effect for mechanical reasons."},{"name":"Attributes:","value":"- Anyone that visits or is visited by a player with `Spores` will be afflicted with the `Spores` status as well.\n- If a player with `Spores` gets the status again, they will ascend a stage in their consumption. The effects of previous stages are retained upon progression.\n- Stages of Consumption:\n> Stage 1: No effects. This is stage people start on when infected.\n> Stage 2: Players in this stage will secretly require one less vote to be hanged. A minimum of 1 vote will always be required to hang someone.\n> Stage 3: Upon reaching this stage, the player will be informed they're feeling shroomy, and their two closest living neighbors will be afflicted with `Spores`.\n> Stage 4: You may infect an extra player each night for every three players that reach this stage.\n> Stage 5: Players in this stage will require less votes to be hanged, equivalent to the amount of players in this stage.\n- You have a list of who is infected with `Spores` and what stage of consumption they're on."},{"name":"Attributes (cont.):","value":"- You are roleblock and redirect immune to players in Stage 2 and up.\n- You appear as a role of your choice to players in Stage 3 and up, and they also cannot remove `Spores` from players by any means.\n- You are impervious to attacks from players in Stage 4 and up.\n- You are immune to votes from players in Stage 5.\n- You may be afflicted by `Spores`, but are immune to its hampering effects. If this is the case, you would simply afflict the status twice when using your ability."},{"name":"Goal:","value":"Shroom all who would oppose you."}],"meta":{},"desc":"Post 3078\n*Everyone other than me will hate it... 'til I'm everyone other than me.*","id":4569,"locked":false}