{"aliases":["3010","infi-nut","infinut","infi","nut","in"],"author":"888761463647371284","title":"Infi-nut","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Plant","subalignment":"Protective","unique":"False","attack":"None","defense":"Degrading Powerful"},"fields":[{"name":"Abilities:","value":"- (Cost: Free) Produce a sun each night.\n- (Cost: 1 sun) Stand guard at a player's house tonight. If they're attacked, you'll take the hit for them.\n- (Cost: 1 sun) Fortify a player's house. Besides direct attacks, all their visits tonight will be redirected to you.\n- (Cost: 3 sun) Phase through four players at night. All who visit any four of them are redirected to you tonight. If you die on the night you use this ability, your revival will be sped up by a night."},{"name":"Attributes:","value":"- After dying, you'll be revived at the start of the day, two nights later. You'll be given hanging immunity for the duration of the day you're revived. Your defense will be restored to Degrading Basic upon revival.\n- Astral visitors will always bypass your protection.\n- **Degrading Defense**: Every time your defense successfuly blocks an attack, it's lowered by a tier."},{"name":"Squidly's Notes:","value":"- Due to the concurrent revivals, the role may seem powerful at first, but its protective abilities are lackluster and use up sun even if no threats were stopped.\n- A big problem with the revival is that the Infi-nut's identity will inevitably be revealed, so the optimal strategy for the Infi-nut is to waste Town hangings and opposing attacks, trying to get as much attention on itself as possible while its teammates sit happily in the background.\n- A glaring weakness is that the Infi-nut is that if all other Plants die while it's still regenerating, the game will be lost before it revives. Avoid this situation at all costs."}],"meta":{},"desc":"Post 3010\n*For generations, the Infi-nut has stood tall. It didn't just pass the test of time. It created it.*","id":4614,"locked":false}