{"aliases":["3004","rotobaga"],"author":"888761463647371284","title":"Rotobaga","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Plant","subalignment":"Killing","unique":"False","attack":"Basic","defense":"None"},"fields":[{"name":"Abilities:","value":"- (Cost: Free) Produce a sun each night.\n- (Cost: 1 sun) Fly high above the sky tonight, setting your defense to Levitating for this night and the next. See 2302.\n- (Cost: 2 sun) Select a target, and attack their two closest alive neighbors with rutabagas. Fails if the target is visited by more than 2 people tonight, *including* you. Failing doesn't refund any sun. **Locked**: If you successfully kill two targets, generate 1 sun.\n- (Cost: 3 sun) Expend three sun to make your visits use Astral, give you prevention immunity, and **Unlock**."},{"name":"Attributes:","value":"- Using your second ability, you will ignore all protective effects affecting the people you attack. However, any protective effects on your target will also apply to those who you would attack.\n- You may self-target.\n- **Locked**: If you were to attack a fellow Plant member, you would instead protect them with Basic defense made of rutabagas.\n- **Locked**: When selecting a Plant member as the target of your killing ability, you simply ignore all protective effects for those you attack."},{"name":"Squidly's Notes:","value":"- A powerful killing role, giving the Plants 2 KPN for 2 sun if played correctly, but with many flaws.\n- Unlocking is a powerful investment - due to your visits being Astral, it increases the chance of your attack succeeding since your visit no longer counts to the 2-visit cap. It also gives you some semi-reliable defensive capabilities and allows you to bypass protective effects more often.\n- That said, unlocking shouldn't always be your priority, as the locked buffs are situational at best. It's up to you to decide whether or not to take the investment.\n- Whenever you're in a tough situation with a lot of enemies, remember to use your second ability."}],"meta":{},"desc":"Post 3004\n*A rotobaga is a \\*root\\* plant... That \\*flies\\*. Think about that for a second.*","id":4619,"locked":false}