{"aliases":["3374","townie"],"author":"654448067969548338","title":"Townie","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Town","unique":"False","attack":"Variable","defense":"None"},"fields":[{"name":"Abilities:","value":"- Investigate (35) someone.\n- Learn the names of a player's visitors tonight.\n- Check someone, you will learn if they are Suspicious.\n- Bug a player, learning all night feedback they recieved from other than their own role.\n- During the day, You may choose one person to jail for the night.\n- Execute the player you jailed, dealing them an Unstoppable attack. (3 uses)\n- Check someone, if they are a Conversion capable role, Conversion faction member or converted, deal a Basic attack to them.\n- Go on Alert, gaining Basic defense and dealing a Powerful attack to all your visitors.\n- Shoot a player with your gun. (3 uses)\n- Guard a player, if they are attacked, you will intercept the attack, causing yourself to die and dealing the attacker a Powerful attack.\n- Put on a Bulletproof vest, giving yourself basic defense. (1 use)\n- Heal someone, giving them Powerful defense.\n- Protect someone, You will give them Powerful defense and deal a Basic attack to a random player visiting them."},{"name":"Abilities (cont.):","value":"- Place a trap on someone, this will dismantle an active trap if one is placed.\n- Distract someone, roleblocking them.\n- Reveal yourself as the Mayor, your vote now counts as 3.\n- While dead, Seance with a Player during the day, Opening a chat with them at the start of the night, it will close at the end of the night.\n- Use an ability from a dead Town member, you may not use one from the same player twice.\n- Transport 2 Players."},{"name":"Attributes:","value":"- At the end of odd-numbered nights, you will recieve the name of 3 players, at least 1 of them doesnt win with Town.\n- At the end of even-numbered nights, you will recieve the name of 2 players, at least 1 of them wins with Town.\n- You will know who the Evil factions visit each night, Visits are separated by factions.\n- Conversion capable roles, Conversion faction members or converted players who visit you will be dealt a Basic attack and their visit will fail.\n- Roleblock Immunity.\n- If you shoot a Town member with your gun your next night action will be suiciding due to guilt.\n- You may not self-target.\n- You will know when a healed target is attacked.\n- If a player with a trap is visited, the trap will trigger, telling you the role of every visitor.\n- If a player with a trap is attacked, the trap will trigger, attacking the attacker and granting your target Powerful defense.\n- You may have only 1 trap out at a time.\n- Roleblock Immunity."},{"name":"Attributes (cont.):","value":"- You may not gain temporary defense from outside sources when revealed as the mayor.\n- You may privately talk with the dead.\n- Roleblock Immunity.\n- When transporting, Other players targeting your first target will secretly be redirected to your second. Other players targeting your second target will secretly be redirected to your first.\n- Your targets will know that they were transported.\n- Roleblock Immunity."}],"meta":{},"desc":"Post 3374\n*Deodat Lawson*","id":464}