{"aliases":["2808","the_guy_from_blade_and_sorcery:_nomad","the_guy_from_blade_and_sorcery_nomad","theguyfrombladeandsorcery:nomad","theguyfrombladeandsorcerynomad","guy","from","blade","sorcery","nomad","sorcery:","tgfbasn","gfbsn"],"author":"655633028516937729","title":"The Guy From Blade And Sorcery: Nomad","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Variable","defense":"Invincible"},"fields":[{"name":"Abilities:","value":"-Attack a player\n-Use one of your spells"},{"name":"Attributes:","value":"-Players are announced at the start of the game that “The world feels as though you are in a simulation. Your hands move a little behind from where they should be”\n-**Fireball Spell**: Will deal a powerful attack to your enemy\n-Combined: Forms a meteor, and will deal an unstoppable rampage to your target\n-**Gravity Spell**: Push players away, causing anyone who visits you to have their ability fail\n-Combined: Will create a gravity bubble, allowing you to trap people in the air if they visit you. Trapped people will be roleblocked the following night, and will only be able to use abilities on other people inside the bubble for the next 2 nights\n-**Lightning Spell**: Deal a rampaging basic attack to a target\n-Combined: Will shoot a giant laser beam, dealing a powerful attack to your target and their visitors, and you can throw the corpse(s) at another player, dealing a basic attack to them as well."},{"name":"Attributes (cont.):","value":"-Attacking a player regularly will have an even chance to dismember a players limbs. They will have the following effects:\n-Head: Immediately kills the target, dealing an overkill attack\n-Arms: Target can no longer vote, because their pointer fingers are no longer there\n-Legs: Player is roleblocked for the next 3 nights, as their insurance will only pay for a third of the wheelchair cost\n-Torso: Deal a basic attack that bypasses heals to your target\n-Internal Organs: Your target begins bleeding. They have one night to be healed or they will die to a powerful attack\n-You learn what body part was dismembered.\n-Once every body part has been dismembered at least once, you learn to combine spells\n-Every spell requires one mana. You start with 3, and gain .5 every night."},{"name":"Goal:","value":"Kill all who oppose you"}],"meta":{},"desc":"Post 2808\n_Its a VR game where you can kill people with no consequences!_","id":4732,"locked":false}