{"aliases":["1","3897","gen_1_pikachu","gen1pikachu","gen","pikachu","g1p"],"author":"654448067969548338","title":"Gen 1 Pikachu","color":null,"iconURL":"https://cdn.discordapp.com/emojis/956545909355843595.png","imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"Variable","defense":"Variable"},"fields":[{"name":"Abilities:","value":"- Growl: Lower a target's attack by 1 tier this night and the next one. (Learned at night 1)\n- ⚡Thundershock: Deal a basic attack to a target. (Learned at night 1)\n- ⚡Thunder Wave: Inflict Paralysis on a target, they have a 25% chance of being roleblocked every night and their actions will have the lowest possible priority, targets will know they are paralyzed. (Learned at night 2)\n- Quick Attack: Instantly deal a Basic attack to a target. (Learned at night 3)\n- Swift: Deal a Powerful attack to a target, cannot fail by any means other than natural defense. (Learned at night 5)\n- Agility: During the day, choose to act twice next night. (2 uses, learned at night 5)\n- ⚡ Thunder: Deal an Unstoppable attack to a target, might be inaccurate, having an equal chance to hit a random person visiting your target instead. (Learned at night 7)"},{"name":"Attributes:","value":"- You are given 3 names at the start of the game, once per game, you may choose one of them to be your trainer.\n- Learned at X night abilities can only be used on the learned night or after, For each kill you get, all your abilities get learned 1 night before.\n- Gain basic Defense at night (4 - kills), gain Powerful defense at night (7 - kills).\n- ⚡ attacking abilities have their tier switched based on target's role, ⚡ non-attacking abilities fail on completely negated targets.\n> Lowered by 1 tier: Electricity, Grass and Dragon related roles.\n> Increased by 1 tier: Water, Flying/Bird related roles.\n> Completely negated: Ground related roles."},{"name":"Goal:","value":"Ensure your trainer wins or survives."}],"meta":{},"desc":"Post 3897\n*It keeps its tail raised to monitor its surroundings. If you yank its tail, it will try to bite you.*","id":499}