{"aliases":["2618","twelve_nights_of_christmas","twelvenightsofchristmas","twelve","nights","christmas","tnoc","tnc"],"author":"327918538419601409","title":"Twelve Nights of Christmas","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"**Partridge in a Pear Tree:** All players gain Powerful defense for the night. (One Use)\n**Two Turtle Doves:** Choose two players. They become lynchproof for the next day, gain Powerful defense for the night, learn each other's roles, and can win with each other's faction. (One Use)\n**Three French Hens:** Choose three players. One gains the ability to speak with the dead, one changes their win condition to \"Survive until the end of the game.\", and the third gains an ability from a random role. (One Use)\n**Four Calling Birds:** Choose two players. They become Astral and gain roleblock, redirect and detection immunity permanently. (One Use)\n**Five Golden Rings:** Choose a player. Due to their newfound wealth, they become lynchproof and gain three votes permanently. (One Use)\n**Six Geese a-Laying:** Choose a player. When they die, a random player from their faction gains their abilities and attributes and can multitask. If they were the last member of their faction, this goes to anyone. (One Use)"},{"name":"Abilities (cont.):","value":"**Seven Swans a-Swimming:** Choose two players. You will dazzle anyone that visits them, roleblocking them. (One Use)\n**Eight Maids a-Milking:** Choose two players. The first target becomes the \"Mother\" of the other, changing their win condition to \"See your child live until the end of the game.\" If the child dies, the Mother will die as well. When the Mother dies but the child is alive, the Mother gains a two use protection identical to (89) Guardian Angel. (One Use)\n**Nine Ladies Dancing:** Choose five players. They all get roleblocked. (One Use)\n**Ten Lords a-Leaping:** Choose two players. For the next day and night, neither of them are valid targets for other abilities. (One Use)\n**Eleven Pipers Piping:** If you use this ability when an evil faction, plus you, counts for at least 50% of living players, the game immediately ends in that faction's victory. (One Use)"},{"name":"Abilities (moar.):","value":"**Twelve Drummers Drumming:** Choose a player. All players within two houses of that target are redirected to the same player your target visited. If they didn't visit anyone, no effect. (One Use)"},{"name":"Attributes:","value":"- None"},{"name":"Goal:","value":"Survive until the end of the game with at least four other people alive."}],"meta":{},"desc":"Post 2618","id":509}