{"aliases":["5162","screw_you,_spinoff_time","screw_you_spinoff_time","screwyou,spinofftime","screwyouspinofftime","screw","spinoff","time","you,","syst","sst"],"author":"563491765576007680","title":"SCREW YOU, SPINOFF TIME","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Evil","unique":"False","attack":"Variable","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Choose up to four players. One may be yourself. Force them to play a Grand Idea spinoff of your choice. (eg; GIUno, GIMunchkin, BIBuckshot. Non-exhaustive list. You may not choose the same game twice) Those who refuse are hit with an Overkill attack. Said game will have rules that make it short. (eg GIMunchkin probably being to lvl 5 or 7 instead of 10) This ability is last in move priority."},{"name":"Attributes:","value":"- Those who are playing in a grand idea spinoff because of this role are temporarily removed from town with a public mod message relevant to the spinoff. (eg: *guyman and TLHP are taken away to an underground club...* for buckshot) They will still be considered \"in-game\" But may not be targeted or hit by an ability or voted for any reason\n- If you are playing in a grand idea spinoff because of this role, it will be rigged in your favor if possible.\n- Once the spinoff ends, the following happens to players depending on their placement\n2 players: 1st. gains +1 defense stage during the next applicable night 2nd. get hit with a powerful attack\n3 players: 1st. gains a +1 defense stage auto-vest 2nd. nothing 3rd. get hit with an unstoppable attack\n4 players: 1st. gains +1 vote permanently or +1 Defense stage for 3 nights. Player's choice. 2. gains a basic auto-vest 3rd. get hit with a basic attack 4th. get hit with an Overkill attack"},{"name":"Attributes (cont.):","value":"then they will return to town immediately if it is day, or at the beginning of the next day if it is night"},{"name":"Goal:","value":"Cause 3 Spinoff games, winning at least one."}],"meta":{},"desc":"Post 5162","id":5364,"locked":false}