{"aliases":["tengu","114"],"author":"298205270201597955","title":"Tengu","iconURL":"https://cdn.discordapp.com/attachments/930956687580483584/930978937876647966/Tengu.png?ex=654c2533&is=6539b033&hm=4545c0bed5fce44baaa99645469112d4d133f86b8d8a78f4e34e295b4cd5f0c6&","params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Basic/Powerful","defense":"Basic (Powerful)"},"fields":[{"name":"Abilities:","value":"- Attack: Use Basic Attack on a player in the night.\n- Fire Bomb: In the night, use a Powerful Attack a player, clean their role if they die, and deal a Basic Attack to anyone else who visits your target.\n- Shock Bomb: In the night, use a Basic Attack on a player and roleblock them and their visitors.\n- Smoke Bomb: In the night, use a Basic Attack on a player and hide the feedback messages of them and their visitors. They will only be told \"There was too much smoke to see anything!\" and if they survived the night or not."},{"name":"Attributes:","value":"- At the start of the game, certain people will each gain 1 use of the Hire Tengu ability. Those people are the Town Power, every Head of an evil faction, and one random additional player other than them and Tengu. If any lacks a Power/Head, a random member will be given this ability instead.\nHire Tengu: In the night, make the Tengu use a Unstoppable Attack against your target, without visiting Tengu.\n- When hired, you will gain Powerful Defense, Roleblock Immunity, and Control Immunity. Otherwise, you only have Basic Defense.\n- If you're hired, your chosen ability for that night will be cancelled without depleting limited charges. However, if you get hired multiple times, you will attack every target you were hired to kill.\n- Fire Bomb, Shock Bomb, and Smoke Bomb all start at 0 charges. However, each time you are hired, you will gain a charge for one at random, even if you fail to kill your target."},{"name":"Attributes (Cont.):","value":"- When hired, only you will know the results of your attack. Your hirer won't be told anything, even if the attack fails for any reason.\n- You are notified of every person you are hired to kill.\n- If you are hired to kill yourself, your attack will always fail."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{},"desc":"Post 114","id":6}