{"aliases":["-2908","survivor"],"author":"329331408269213696","title":"Survivor","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Attributes:","value":"- At night, you will have nightmares.\n- You have 4 vests which you cannot use.\n- If you successfully go through a nightmare, you will gain powerful defense for the night and use a vest.\n- You regenerate a vest every full moon, but only if you didn't fail the nightmare the night prior.\n- If you die in a nightmare, you will lose a vest. If you die 3 times from the nightmare, you will die in the main game from guilt.\n-During a nightmare, your scene will cut to 13 \"players\" (controlled by the host)\n- There will be 6 \"players\" on your side (aside from you) and 7 on the enemy. You will have the \"Commander\" Role card, seen below.\n- The players all have the name \"Ally\" or \"Enemy\" with a number at the end. Each one will say something in your night chat. If there is a Jailor or Medium which is Seancing you, they can see all of your night messages from the nightmare.\n- All \"Players\" will say something. (The host copy and pastes one of these messages)\n- The voicelines will all pertain to who they are attacking."},{"name":"Attributes (cont.):","value":"- If you do not attack anyone, you will fail the nightmare.\n- If you fail to attack the right person, you will fail the nightmare. You can find the right person to attack by looking in chat.\n- Your allies will all say who they will attack. You must attack the enemy who isn't being attacked."},{"name":"Goal:","value":"Live to see the end of the game"},{"name":"Voicelines:","value":"Allies: (Using the number in the enemy's name)\n\n\"I'm attacking [x]:\"\n\n\"[x] is dead!\"\n\n\"Alright, I'm attacking [x]\"\n\n\"Make sure not to attack [x]. He's mine.\"\n\n\"[x] is going down.\"\n\n\"I'm attacking [x].\"\n\nVoicelines said by \"players\" which supplement the chat\n\"I'm scared.\"\n\n\"Us or them.\"\n\n\"Come back home, see my daughter.\"\n\n\"I should've went to be a doctor...\"\n\nEnemies:\n\n\"I'm attacking [x]\"\n\n\"Point on [x]\"\n\n\"Ha, who is the real winner of this war?\""},{"name":"Commander Rolecard:","value":"**Commander** (Military Command)\nImmunities: Frame\nAttack: Powerful\nDefense: Basic\n\nTI Results:\nMarshall: You are innocent until further notice.\nOperational Medic: You are clear of medical history.\n\nSummary: A member of high command.\n\nAbilities: You shoot one enemy.\nAttributes: If you win this fight, you will get honorably discharged.\n\nGoal: Eliminate the opposing force. Wins with: Millitary\n\nMust kill: Opposition, Defectors\n\nNotifications:\n\"You escaped the nightmare unscathed. You used a vest as a precaution.\"\n\"You failed the nightmare. Only [x] more times.\""}],"meta":{"cannot_spawn":"true"},"desc":"Post -2908\nA war veteran who failed and ran away.\n*Duwiiton made this role on 8/24/2019 and I think it's still funny and needlessly complicated*","id":640,"locked":false}