{"aliases":["4128","cackle"],"author":"654448067969548338","title":"Cackle","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Brainless","subalignment":"Support","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- **Tinkering:** Choose a player each night and provide them with a random item from your inventory.\n- **Peddler:** Once per game, during the day, you may offer a trade by selecting two players. If both players agree, their roles and abilities will be swapped. This trade can only occur on Tuesday and Friday."},{"name":"Attributes:","value":"- During Tuesday and Friday, Cackle may choose the item **Tinkering** gives.\n- Items in Cackle's inventory have unique passive effects that can activate upon being used by the recipient.\n- Cackle has a maximum of 50 unique items in their inventory."},{"name":"Items in Inventory:","value":"1. **Whispering Quill:** When used by a Town Investigative role, the investigation results are whispered directly to the target, bypassing any potential spies.\n2. **Sparkling Elixir:** When used on a player, their next ability will have an additional charge.\n3. **Mirror of Reflection:** When used on a player, any negative effects they receive will be reflected back onto the original caster.\n4. **Dusty Hourglass:** When used on a player, their night action is delayed by one night.\n5. **Shimmering Lantern:** When used on a player, it will reveal the true identity of any disguised players visiting them that night.\n6. **Cursed Coin:** When used on a player, they will have their vote counted as two during the next day.\n7. **Enchanted Compass:** When used on a player, they will be immune to any redirection or transportation effects for that night.\n8. **Mischievous Voodoo Doll:** When used on a player, any role-blocking abilities targeting them will be redirected to another random player."},{"name":"Items In Inventory (cont.):","value":"9. **Flickering Talisman:** When used on a player, they will become immune to being controlled or manipulated for that night.\n10. **Glowing Crystal Ball:** When used on a player, it will reveal the target's exact role to the user.\n11. **Bewitching Potion:** When used on a player, their night ability will target an additional random player.\n12. **Silent Bell:** When used on a player, they will be immune to any form of detection for that night.\n13. **Lucky Rabbit's Foot:** When used on a player, they will have a higher chance of avoiding death that night.\n14. **Dancing Shoes:** When used on a player, they will be immune to being role-blocked or jailed for that night.\n15. **Bubbling Cauldron:** When used on a player, any investigative results on them will be altered to a different random role.\n16. **Warding Amulet:** When used on a player, they will be immune to any form of attack for that night."},{"name":"Items In Inventory (moar.):","value":"17. **Fluttering Fan:** When used on a player, it will grant them an additional vote during the next day.\n18. **Veiled Mask:** When used on a player, their identity will be hidden from investigative roles for that night.\n19. **Glimmering Dagger:** When used on a player, it will bypass their defense and deal a Basic attack.\n20. **Swirling Smoke Bomb:** When used on a player, it will make them appear as a different random role to investigative abilities.\n21. **Mysterious Key:** When used on a player, it will unlock any doors preventing them from performing their night ability.\n22. **Jangling Pocket Watch:** When used on a player, it will cause their night action to be performed twice.\n23. **Shrouded Cloak:** When used on a player, they will be immune to any form of detection or observation for that night.\n24. **Lively Marionette:** When used on a player, it will redirect any harmful abilities targeted at them to a different random player."},{"name":"Items In Inventory (why.):","value":"25. **Whistling Arrow:** When used on a player, it will bypass their defense and deal a Powerful attack.\n26. **Dazzling Feather:** When used on a player, any roles visiting them that night will be revealed to all players.\n27. **Cryptic Scroll:** When used on a player, it will reveal a random true statement about them to all players.\n28. **Magnetic Trinket:** When used on a player, any role-blocking abilities targeting them will be redirected to the user.\n29. **Shadowy Cloak:** When used on a player, they will be immune to being detected by investigative abilities for that night.\n30. **Gleaming Shield:** When used on a player, it will protect them from any form of attack that night.\n31. **Luring Lute:** When used on a player, it will redirect any visiting roles to target them instead.\n32. **Whispering Necklace:** When used on a player, they will be immune to any form of blackmail or silencing for that night."},{"name":"Items In Inventory (stop.):","value":"33. **Soothing Tonic:** When used on a player, it will grant them immunity to being controlled or manipulated for that night.\n34. **Twinkling Crown:** When used on a player, it will reveal the number of players visiting them that night.\n35. **Enigmatic Rune:** When used on a player, their role and ability will be hidden from the night's actions log.\n36. **Radiant Sunflower:** When used on a player, it will grant them immunity to being doused or ignited for that night.\n37. **Arcane Scroll:** When used on a player, it will reveal a random false statement about them to all players.\n38. **Cleansing Stone:** When used on a player, any negative effects they currently have will be removed.\n39. **Gossamer Web:** When used on a player, it will prevent them from performing any night ability.\n40. **Ethereal Lantern:** When used on a player, any harmful abilities targeting them will instead heal them for the same amount."},{"name":"Items In Inventory (please.):","value":"41. **Jester's Mask:** When used on a player, it will make them appear as a Jester to investigative abilities.\n42. **Phantom Cloak:** When used on a player, they will be immune to any form of attack or harmful effect for that night.\n43. **Vanishing Ink:** When used on a player, any investigative results on them will be altered to show them as a Jester.\n44. **Soothing Balm:** When used on a player, it will grant them immunity to being role-blocked or controlled for that night.\n45. **Eerie Pocket Watch:** When used on a player, it will cause their night action to be prevented, but they will be immune to attacks.\n46. **Glittering Gem:** When used on a player, it will reveal a random subset of the roles present in the game to all players.\n47. **Cursed Pendant:** When used on a player, they will be unable to use any abilities or items for that night.\n48. **Pristine Dagger:** When used on a player, it will bypass their defense and deal an Unstoppable attack."},{"name":"Items In Inventory (god.):","value":"49. **Ghostly Cloak:** When used on a player, they will be immune to any form of detection or observation for that night.\n50. **Mystical Orb:** When used on a player, it will reveal the role of the player who targeted them with an ability that night."}],"meta":{},"desc":"Post 4128","id":672}