{"aliases":["2010","3657","2010_era_creepypasta_chain_mail","2010eracreepypastachainmail","era","creepypasta","chain","mail","2eccm"],"author":"329331408269213696","title":"2010 Era Creepypasta Chain Mail","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- During the day, you may whisper to one person, \"*Sorry I have to send this to u  Fwd: Hi my name is Carmen Winstead. I'm 17years old. I am very similar to you... Did I mention to you that I'm dead. A few years ago a group of girls pushed me down a sewer hole to try and embarrass me. When I didn't come back up the police came. The girls said that I had fell and everyone believed them. The police found my body in the sewer. I had a broken neck and my face was torn off. Send this message to 15 people after you read the whole message if you value your life! A boy called Alex  received this message. He just laughed and deleted it. When he was in the shower he heard laughing... MY LAUGHTER! He got really scared, rushed to his phone to repost this message... But he was too late. The next morning his mum entered his bedroom and all she found was a message written in his blood saying, \"You will never have him back!\" No one has found his body yet... because he is with me! A girl called Charlotte received this message"},{"name":"Abilities (cont.):","value":" and she immediately sent it to 13 people (10 more than required). I still watch over every second of her life to make sure that she is safe and to keep her and everyone close to her out of danger. Send this to 3 people in the next 5 minutes if you don't want your fate to be the same as Alex's. Your time starts... NOW! The story is true you can research It on google*\".\n- Each player who receives this whisper must whisper the same message to at least 3 other players by the end of the next day. Each player who doesn't will be visited by you tonight and dealt a basic attack."},{"name":"Attributes:","value":"- May choose to send anonymous whispers up to 2 times\n- You may instead send an alternate chain mail of your choosing (but it has to be at least 100 words and from the 2010s)"},{"name":"Goal:","value":"Kill everyone"}],"meta":{},"desc":"Post 3657","id":716}