{"aliases":["4459","mob_insider","mobinsider","mob","insider","mi"],"author":"329331408269213696","title":"Mob Insider","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Corrupt Cops","subalignment":"Special","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"**Scenario**:","value":"Mafia Negotiations\n*We've got an agreement with the families in Salem. It's just business.*"},{"name":"Factional Traits:","value":"- The Corrupt Cops will consist of the Mob Insider and an Enforcer. The other 2 Corrupt Cop slots become Mafia instead, and consist of a Godfather and a Mafioso.\n- The Corrupt Cops win by killing all who oppose them. The Mafia's factional traits are unaltered. Neither faction will have access to death notes or last wills. The Corrupt Cops and Mafia cannot win together.\n- The Corrupt Cops have a factional chat.\n- At the start of the game, the Corrupt Cops are informed of a town member who is their Partner. The Mafia are unaware of the Partner's name. If the Mafia kill the Partner, the Mafia's factional kill is upgraded to kill two people each night. If the Corrupt Cops are able to keep the Partner alive until Night 4, the Corrupt Cops and Mafia will have their votes count for double the next day\n- If the Corrupt Cops or the Mafia kill a member of the opposing faction, they will lose their Factional Kill the next night."},{"name":"Factional Traits (cont.):","value":"- The Corrupt Cops and Mafia have powerful attack when using the factional kill against each other.\n\n-"},{"name":"Abilities:","value":"- During the day, choose a player to contact. The next night, you'll open a chat with them (non anonymously).\n- At night, choose a player to Blackmail. They can't say anything tomorrow. You can do this up to twice."},{"name":"Attributes:","value":"- RB immune etc (same as escort)\n- You are aware of who the Mafia members are."},{"name":"Goal:","value":"Eliminate all who oppose the Corrupt Cops."}],"meta":{},"desc":"Post 4459\n-","id":928}