{"aliases":["traptrix"],"author":"298205270201597955","title":"Traptrix","color":"072a6c","params":{"type":"Evil"},"fields":[{"name":"Subalignments:","value":"Power, Plant, Insect"},{"name":"Features:","value":"- Only one Traptrix Power may spawn.\n- Factional chat\n- Factional kill\n- At the beginning of the game and every full moon night, each member receives a random trap hole, which is one of the following items that grants them one used of the listed ability:\nChaos Trap Hole: Kill a player and their target if their attack value is Basic or above and they visit someone tonight.\nTraptrix Trap Hole: Kill all players who visit a player of your choice.\nBottomless Trap Hole: Kill a player if they have an attack value of Basic or above.\nTreacherous Trap Hole: Kill two players. This can only be used if no other trap holes have been used.\nNetwork Trap Hole: Kill a player if they interact with a player tonight without visiting that player.\nGravedigger's Trap Hole: Kill a player if they interact with a player tonight that they usually would not be able to.\nAcid Trap Hole: Kill a player if their defense is lower than Powerful."},{"name":"Features (cont.):","value":"Spikes Trap Hole: Kill a player if they attack a player tonight. This may be used any number of times instead of just once.\nAdhesion Trap Hole: Cause a player to lose all attributes and deal a Basic attack to them if their ability doesn't function without attributes or they have no attributes.\nBreak Off Trap Hole: Choose up to five players and deal a Basic attack to all of them whose roles chane tonight.\nDeep Dark Trap Hole: Deal a Powerful attack to a player if they're a Head, Power, Sin, Hero, Captain, Legendary, or Commanding role. Reroll this trap hole immediately if none of these roles exist.\nD.D. Trap Hole: Deal a Powerful attack to a player if they have exactly one ability. \nDouble Trap Hole: Kill a player if their defense value is higher than their attack.\nGiant Trap Hole: Kill two players if they're from the same faction.\nGemini Trap Hole: Deal a Basic attack to a player if they visit tonight."},{"name":"Features (more):","value":"Delusion Trap Hole: Attack a player if they use an ability tonight and have an attack value of Basic or above. If you have used a trap hole before this, you gain that trap hole back.\nVoid Trap Hole: Choose two players. If either of them visit the other, deal a Basic attack to your first target."},{"name":"Goal:","value":"Slay everybody who would oppose you."}],"meta":{"inherit_fields":"Goal:Slay everybody who would oppose you."},"id":54}