{"aliases":["netsec"],"author":"277233013484552202","title":"NETSEC","color":"006b23","iconURL":"https://cdn.discordapp.com/emojis/1025184304264908879.webp?size=40&quality=lossless","params":{"type":"Good"},"fields":[{"name":"Subalignments:","value":"Special, Field Operations, Investigative, Offensive"},{"name":"Features:","value":"- 2166: Operation Leader will always spawn\n- No factional chat\n- No factional kill\n- NETSEC has a 4x3 network of nodes that members can hack. There is a laptop node on each row of the first column and a master node somewhere on the fourth. The host must arbitrarily place any number of laptop nodes on spaces on the second and third columns and up to four server nodes on spaces on the second, third, and fourth, and must connect the nodes across rows and columns such that all the nodes are somehow linked through any number of connections. There can't be two nodes on the same space. \n- Members of evil factions may see the full layout of the network. Other players, including NETSEC members, can only see the first column, and all nodes connected to captured nodes."},{"name":"Features (cont.):","value":"- NETSEC members may capture nodes by hacking them. NETSEC roles have Hacking Skill, which which corresponds to the chance they have to successfully capture a node when hacking it. Very Low is 10%, and then each subsequent tier (Very Low < Low < Below Average < Average < Above Average < High < Very High) increases the chance by 5%. When hacking a laptop node, the chance is increased by 5%, and when hacking the master node, the chance is decreased by 5%. PWNing a node will always capture it unless it's the master node, in which case it only has a 50% chance to capture it.\n- If the master node is captured, NETSEC and the Town win the game."},{"name":"Goal:","value":"Capture the REF network and retrieve the stolen data OR eliminate the REF. (you win with town.)"}],"meta":{"inherit_fields":"Goal:Capture the REF network and retrieve the stolen data OR eliminate the REF. (you win with town.)"},"id":63}