{"aliases":["puppeteer"],"author":"361152876048809984","title":"Puppeteer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Outsider","type":"Destructive","unique":"True"},"fields":[{"name":"Passives:","value":"- Mask: Choose a role to disguise as within the first phase of the game. You will appear to win with others according to the role you chose.\n- Tough Skin: You are immune to Chaos faction’s Night phase attack.\n- Some Strings Attached: You know at all times the state of cards with Strings attached. You know who holds them, how and when they get modified, and how and when they are removed from their owners' hands. (Using, discarding, trading for Card Points, etc.)"},{"name":"Abilities:","value":"- Preparations: Gain a non-special card of your choice. [4 uses, 1 CD]\n- Entangle: Select a player, other than yourself. Choose a card they draw in the next phase (can be Special). It will secretly come with a String attached to it. [Infinite uses, 1 CD]\n- Puppet: Choose a non-King player who used a card with a String attached at any point this game. Next phase, you control all of their card-playing actions. For the duration of that phase, you will know their entire hand and can make them play any and all cards they have. They will be unable to trade or spend their cards of their own volition in any way. This ability will fail if it is Final 3. [1 use, Astral, Unique]\n- Pretend: Play a Reforged Upgraded Attack! on a player. Gains a use whenever a player is killed by you, someone using a card with a String attached, and/or a Reforged attacking card that was actually played by you. [0 uses, Charging]"},{"name":"Abilities (cont.):","value":"- Tug: Steal a card with a String attached. Gains a use whenever a player still holds a card with a String attached at the end of a Phase. [0 uses, 1 CD, Charging]"},{"name":"Goal:","value":"Be the last player remaining, excluding Mountebank and Outsider King."}],"meta":{"track_message_id":"1312154818286190673"},"desc":null,"id":37}