{"aliases":["cryomancer"],"author":"361152876048809984","title":"Cryomancer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Outsider","type":"Destructive","unique":"True"},"fields":[{"name":"Passives:","value":"- Destructive: Your Hand Size is 6, and you draw 1 extra card each phase. You are immune to Chaos’ Night phase attack. You may disguise as any role at any point during the game, and this disguise affects up to Susceptible checks. \n- Commander: If you have more than 3 minions at any given time, you are Revealed as the Cryomancer. You may not directly Duel your minions. You may also remove a minion at any moment."},{"name":"Abilities:","value":"- Snowman: Create a Snowman with 1 HP, 3 Hand Size, and 1 Channel. It draws 2 cards a phase. See below for more details. The first Snowman spawned will not show up on the playerlist, but any subsequently created ones will and may be directly targeted. Gains a use for every player you Kill. [1 use, 1 CD, Recharging]\n- Snow Golem: Create a Snow Golem with 3 HP and 5 Hand Size, and 1 Channel. It draws 3 cards a phase. See below for more details. It appears on the playerlist and may be targeted. Gain a use for every 3 players you Kill. [0 uses, Recharging, 0/3]\n- Snow Abomination: Create a Snow Abomination with 5 HP and 5 Hand Size, and 1 Channel. It draws 2 cards a phase, 1 of which is guaranteed to be Special. See below for more details. It appears on the playerlist and may be targeted. [1 use, Unique, Unlocks D2]"},{"name":"Abilities (cont):","value":"*Snow Minions: Your Minions can ONLY play cards/open channels. They may not enter Rooms with you. Trades/whispers created will appear to come from you. You may trade freely from your Hand or your Minions. Your Minions will not be affected by Event draw increases. Additionally, your Minions Die when you die.*"},{"name":"Goal:","value":"Be the last player remaining, excluding Mountebank/Outsider King."}],"meta":{"track_message_id":"1312154884270854304"},"desc":null,"id":40}