{"aliases":["34","uno"],"author":"298205270201597955","title":"UNO","color":"ed1d26","iconURL":"https://1000marcas.net/wp-content/uploads/2021/05/Uno-logo-2048x1587.png","imageURL":null,"params":{"typical_property_count":"5"},"fields":[{"name":"Features:","value":"- Spread\n- If this spawns, all players draw 7 UNO Cards when the game begins.\n- When someone passes any UNO Property (owned or not), they may play one UNO Card. It must either share the same color, the same number, or the same name as the previously played card. (If there is no previously played card, any card may be played.)\n- When someone has 1 card left, they must say \"UNO\". If they don't, another player may call \"UNO\" before they do, to make that player draw 2 cards.\n- When someone owns an UNO Property, it should make other players draw a specific card (or type of card) whenever they land on it.\n- The owner gets to play an UNO Card if they land on their own UNO Property.\n- UNO Properties may provide UNO Cards that are not in the list below.\n- Once someone gets rid of their last UNO Card, they will permanently unlock the ability to build on any property without requiring full sets or any money.\n- In addition, it is impossible to make someone draw UNO Cards if they have none."},{"name":"Features (cont.):","value":"- Unless stated otherwise, any UNO Property that makes you draw a card is assumed to make you draw a Standard UNO Card from the list below."},{"name":"Standard UNO Cards:","value":"- Red/Green/Blue/Yellow Numbered Cards 0-9\n- Red/Green/Blue/Yellow Draw 2: Target player must draw 2 cards.\n- Red/Green/Blue/Yellow Skip: Target player does not get to play a card.\n- Red/Green/Blue/Yellow Reverse: Target player must move backwards next turn.\n- Wild Card: This card (and any that counts as one) can be player after any card, and any card can be played after it. It can be drawn from any UNO Property unless stated otherwise.\n- Wild Draw 4: Counts as a Wild Card. Target player must draw 4 cards."}],"meta":{},"desc":"Post 34","id":33,"locked":false}