{"aliases":["kingdom_attackers","kingdomattackers","kingdom_attacker","kingdomattacker","kingdom","attackers","attacker","ka"],"author":"654448067969548338","title":"Kingdom Attackers","color":"d1d1d1","params":{"type":"Evil"},"fields":[{"name":"Subalignmnets:","value":"Chaos, Apostles, Souless"},{"name":"Features:","value":"Factional chat\nFactional kill if no members have attacking cards\nAll members have Hell-Bent defense. Cards do not count as visits for Hell-Bent damage, and healing HP removes damage, which is processed after it's dealt and may save members from dying, or provides temporary defense of a tier equal to the amount of HP healed if used on a non-member, Attacks also deal them damage equal to the attack tier, including the visit damage.\nAll members have the following attribute: - Bonded: You cannot Duel a teammate unless forced by another player not in faction.\nMembers draw an Attack! (1), a Block! (12), and 3 random cards at the start of the game, and draw an additional random card at the start of each night.\nMembers may play any number of cards each night along with their abilities. Only one member may play attacking cards each night. Cards are unaffected by roleblocks and redirects."},{"name":"Features (cont.):","value":"Cards are drawn from this document: https://docs.google.com/document/d/1sh6G8P08ELZpy8uPzRb51BVf1t7b2KrcvdVogP_xSKc/edit?usp=drivesdk. Special cards are each 1/5th as likely to be drawn as normal ones, and Duel-won cards cannot be drawn or obtained except for from Duel?!s (44).\nIf a player is attacked by members of this faction multiple times in one night, the attacks become one attack of a tier equal to their combined value with all of those attacks' effects."},{"name":"Goal:","value":"Eliminate all Town, Florae, Sentries, City, Army, Mainframe, Everything, Neutral Killings and opposing evil Factions. You may spare all Crew, Neutral Benigns, Chaos and Evils however."}],"meta":{"inherit_fields":"Goal:Eliminate all Town, Florae, Sentries, City, Army, Mainframe, Everything, Neutral Killings and opposing evil Factions. You may spare all Crew, Neutral Benigns, Chaos and Evils however."},"id":60,"locked":false}