{"aliases":["babas","baba"],"author":"646530450449498112","title":"Babas","color":"7a677e","iconURL":"https://cdn.discordapp.com/emojis/598600402992365571.gif?size=40&quality=lossless","params":{"type":"Evil"},"fields":[{"name":"Subalignments:","value":"Deception, Killing, Meta"},{"name":"Features:","value":"Only 1 Baba Killing may spawn, and at least 1 Baba Meta must spawn.\nFactional chat\nNo factional kill\nAll members have access to text that can form rules. Text can be rearranged to form rules by a living baba member in addition to their normal action. Not all texts have to be used during the night, and unused texts are set aside for later use. Rearranging rules counts as a visit to the Text. Visiting the text works in the same way as visiting the graveyard.\nDuring the day, Baba members may add up to 3 pieces of text to the pool of text. The text and the player who added it are announced in the factional chat.\nEach player will be considered loitering at another players home, or at town square. Players do not know where they are currently loitering at. You are also considered to be facing either up or down.\nWhen a player visits another player, the player is loitering at that home until the player visits again. This applies to all visits, including astral, indirect, or day visits."},{"name":"Features (cont.):","value":"You are considered to be facing the opposite direction of where you came from.\nEvery player starts with the attribute linked with Color, Except the host chooses the color that you are represented by. The color may change in the middle of the game due to host choice, or by force using the rules.\nAt the beginning of every Day, Town will be informed of the current rules in place, what text went unused, and where each BN and BK is loitering at.\nBNs and the BK start the game loitering at town square\nRules are processed and take effect after all priority 0 actions, but before priority 1 abilities process.\nLoitering processes before all actions of the priority are processed, but after the last priority had been processed. If someone has multiple targets with the same priority, the house you hang out at is random. If the location for loitering cannot be determined, the location the player hangs out is determined by the Host. (even if the chosen destination makes literally no sense)\nYou start with 2 “Is” Texts"},{"name":"Features (more):","value":"Available texts are detailed here: https://docs.google.com/document/d/1A9d1hUgpvWWQ60ZIr1I9C-HIKc__LREn/edit?usp=sharing&ouid=114492207829235611017&rtpof=true&sd=true\nim not reading this shit skull"},{"name":"Goal:","value":"Kill all those who oppose the power of the rules"}],"meta":{"inherit_fields":"Goal:Kill all those who oppose the power of the rules"},"id":73,"locked":false}