{"aliases":["node_task_force","nodetaskforce","node","task","force","ntf","nft"],"author":"277233013484552202","title":"Node Task Force","color":"78ff77","iconURL":"https://cdn.discordapp.com/emojis/1040092024034054204.webp?size=40&quality=lossless","params":{"type":"Good"},"fields":[{"name":"Subalignments:","value":"Power, Killing, Investigative, Protective, Support"},{"name":"Features:","value":"-No factional kill\n-No factional chat\n-Cannot co-exist with other good factions, unless these factions are allied together in a special mode.\n-Before each day's lynch, a Node nomination will occur. \n-Starting from the 1st player in the player list, they will select a certain amount of players depending on the day (D#+2, up to 6 players max), or they may choose to pass. If accepted, the next player after them will go the next day, if rejected or passed, the next player after them will nominate new players.\n-If the nominator dies in the middle of the day without nominating, it acts as if they passed. Additionally, dead players cannot be nominators or nominated, they are skipped if it's their turn.\n-Once the nominator has submitted their choice, all players will vote to accept or reject the proposal. A majority accept vote is required for it to go through, results are revealed after the vote as well as who voted what."},{"name":"Features (cont.):","value":"-If rejected, the next player is selected. If a proposal is rejected 5 times in a day, the Node is automatically hacked.\n-If accepted, Node Maintenance begins and day chat and day abilities are paused.\n-During Node Maintenance, NTF members and some Neutrals must choose to Secure to proceed.\n-REFs and Neutrals that want to eliminate NTF may choose to Secure or Hack.\n-If all players chose to Secure, the Node is Secured.\n-If someone chose to Hack, the Node becomes Hacked for whichever faction the Hacker is from, only members of that faction will know they hacked it, everyone else will not know what faction hacked it. Multiple factions can Hack a node.\n-The amount of Hacks is revealed, and the day then proceeds as normal.\n-If 3 Nodes are Secured, the NTF wins automatically.\n-If a faction Hacks 3 Nodes, that faction wins automatically.\n-Finally corrected this not being in here despite it being in the bot for a while"},{"name":"Goal:","value":"Secure the Nodes and prevent your enemies from taking control of them."}],"meta":{"inherit_fields":"Goal:Secure the Nodes and prevent your enemies from taking control of them."},"id":82,"locked":false}