{"aliases":["103","random_grand_idea_mafiatwow_role_generator","randomgrandideamafiatwowrolegenerator","random","grand","idea","mafiatwow","role","generator","rgimrg"],"author":"706083462750404658","title":"Random Grand Idea MafiaTWOW Role Generator","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"???","subalignment":"Chaos","attack_power":"?.?x","defense_power":"?.?x"},"fields":[{"name":"Generic:","value":"[This ability is randomised to any existing Base MafiaTWOW or GIMT ability that has the same ability type (not passive, no ammo, no charge) at the start of the night.]"},{"name":"Passive (Passive):","value":"[This ability is randomised to any existing Base MafiaTWOW or GIMT ability that has the same ability type (any passive ability) at the start of the night.]"},{"name":"Ammo (4x):","value":"[This ability is randomised to any existing Base MafiaTWOW or GIMT ability that has the same ability type (any ability with ammo) at the start of the night. Usage of ammo decreases the amount of ammo available to you on this ability, as usual.]"},{"name":"Charge (0x, Charge ???%):","value":"[This ability is randomised to any existing Base MafiaTWOW or GIMT ability that has the same ability type (any ability with charge) at the start of the game. Once the ability has been used, another ability is rolled with another charge counter.]"},{"name":"Attack Power (Passive):","value":"Your attack power is picked from a random GIMT role every round."},{"name":"Defense Power (Passive):","value":"Your defense power is picked from a random GIMT role every round."},{"name":"Alignment (Passive):","value":"Your alignment is randomised to any faction at the start of the game."},{"name":"Goal (Passive):","value":"Your goal is the goal of your rolled faction. If you are neutral, you may pick between a randomised set of five existing neutral role goal at the start of the game."},{"name":"Goal:","value":"Complete your faction's or randomised Goal."}],"meta":{},"desc":"Post 103","id":144}