{"aliases":["107","evil_otter.","evil_otter","evilotter.","evilotter","evil","otter","otter.","eo"],"author":"304777203588005888","title":"EVIL Otter.","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Neutral","subalignment":">:3","attack_power":"0.0x","defense_power":"1.2x"},"fields":[{"name":"Fishy Smell (Passive):","value":"All players in the game start with a Fish. They do not know they have this Fish, nor are they notified if they lose their Fish.\n- You will know every player that has a Fish, and who doesn't."},{"name":"Thievery! (2x, Charge 50%):","value":"Cause a ruckus at a player's house, roleblocking them. You will also steal a Fish from that player, and every player you outplaced that visits them."},{"name":"Beg For Treats (1x, Locked):","value":"This ability is Unlocked if you ever place in the top 40% of alive players. The next Day phase, all players are alerted that there is an Otter! begging for treats. During that phase, all players may choose to give Otter! a treat instead of voting. If they give Otter! a treat, they give you their Fish if they have one, or a 10% bonus the next Evening if they do not have a Fish."},{"name":"Build the Fishy Pipe Bomb (1x, Locked):","value":"This ability is Unlocked once you have taken 1/2 of all other alive players' Fish (rounded up). You build a Fishy Pipe Bomb! It gives you the following passive\n- **Fishy Pipe Bomb** (Passive): If you die during a Night phase, you will EXPLODE, dealing a 10.0x attack to all visitors, as well as players you visit. If you die during a Day phase, you still EXPLODE, dealing a 10.0x attack to 5 random players or 25% of the total remaining players (rounded up) randomly, whichever is lower."},{"name":"Light It Up! (1x, Locked):","value":"This ability is Unlocked after using Build the Fishy Pipe Bomb. This ability cannot be Roleblocked. Choose a player. They get a Fishy Pipe Bomb (and its passive). This Fishy Pipe Bomb automatically explodes at the end of the following Day phase."},{"name":"Goal:","value":"Build the Fishy Pipe Bomb, and Light It Up! (You win as long as you use Light It Up!, even if you die that night.)"}],"meta":{},"desc":"Post 107","id":148}