{"aliases":["223","broken_clock","brokenclock","broken","clock","bc"],"author":"476226844585230337","title":"Broken Clock","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Town","subalignment":"Investigative","attack_power":"0.0x","defense_power":"0.8x"},"fields":[{"name":"Midnight (passive):","value":"After each night, you’ll be informed of an attack that took place. This message will read as: “\\_ attacked \\_!”. The blanks will be filled in with roles, each blank individually using one of six randomly rolled methods. The methods are: 1) This role is false, and was mentioned in daychat. 2) This role is false, as it does not exist. It is a random, non-role word from the text of the description of the role that performed the attack or got attacked respectively. 3) This role is false, it’s the role that goes in the other blank. 4) This role is false, it’s somebody else’s role (in-game, dead or alive). 5) This role is false, as it doesn’t have adequate attack/defense power to perform/survive the attack, when the actually correct role does, or it has too much attack/defense power, when in reality the role failed to kill the target/defend itself. This method is determined using only evening score and attack/defense power. For example, someone with inadequate defense to survive an attack but gets protected is stil"},{"name":"Midnight (passive) (cont.):","value":"l determined to have inadequate defense, and is thus displayed as a role that has adequate defense when this method is rolled. 6) This role is correct. If any method is impossible for some reason, a new method is rolled. This ability can not be altered by deceptive abilities unless it is specified in said deceptive ability that it can. If no attack occurs, you will be informed that no attack occurred."},{"name":"Fix Cogs (0x, 65% charge):","value":"Any time after charging, choose a method in Midnight to be replaced by the 6th method (“This role is correct.”). You cannot replace any instance of the 6th method with itself."},{"name":"Loud Ticking (3x):","value":"Choose a player at night. Next day phase, if that player was attacked, the role (but not the identity) of the attacker will be revealed in an announcement."}],"meta":{},"desc":"Post 223","id":221}