{"aliases":["233","the_ringleader","theringleader","ringleader"],"author":"134793406252711936","title":"The Ringleader","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Mafia","subalignment":"Head","attack_power":"1.1x","defense_power":"1.1x"},"fields":[{"name":"The Masquerade (Passive):","value":"All of abilities are triggered during the Day and take place during the Evening. Each one will cover the responding phase of the Evening. Participants will not be able to access any chats with other players during the Evening, including factional chats, but each game will have a group chat instead."},{"name":"The Banquet (x1):","value":"Force up to 6 players into this minigame. There will be four \"boxes\": 10% boost, 15% boost, +1 ammo to all abilities, and +1.0x Defense Power. The participants may each choose a box to receive- each box's contents will be divided evenly among all players who chose it. Additionally, you may choose one box to place a bomb in, which will deal a 5.0x Attack Power attack to the lowest scoring player who chooses it."},{"name":"Hearsay (x1):","value":"Force up to 6 players into this minigame. If any of the participants created Hello Neighbors with each other, they will be accessible. Each player will be told a \"rule\" for responding, all of which apply to each of their responses. The response that follows the fewest rules will suffer a 50% penalty, and if this penalty drops their effective score below 0%, that person will die. If there is a tie, you may choose who suffers the penalty."},{"name":"Revolution (x1):","value":"Force an even number, up to 6 players into this minigame. Select one to be the \"Monarch.\" The non-Monarch players may vote to either kill the monarch or not. If the Monarch is Town and not killed, nothing happens. If the Monarch is Town and killed, one random other non-Mafia player involved will also die. If the Monarch is Mafia and not killed, all Mafia members receive one additional ammo for all of their abilities and a 0.5x boost to both their Attack Power and Defense Power."}],"meta":{},"desc":"Post 233\n*It begins.* (Inspiration from Flamigiri's Masquerade)","id":231}