{"aliases":["242","eldritch_being","eldritchbeing","eldritch","being","eb"],"author":"476226844585230337","title":"Eldritch Being","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Neutral","subalignment":"Killing","attack_power":"1.5x (3.0x)","defense_power":"1.5x"},"fields":[{"name":"Vengeful Frenzy (1x, 70%):","value":"Attack a random player (besides yourself). If they’ve ever voted you, your attack power doubles."},{"name":"Stellar Explosion (1x, Locked):","value":"Unlocked after day phase 4 ends, if no day has ended with any votes on you. Choose a target. They and all visitors will be attacked with 1.5x power. Anyone who lives will have permanently halved defense."},{"name":"Incomprehensible (Passive):","value":"Anyone who you share an HN with, and anyone who investigates you, has a percent chance of gaining the Symptom of Insanity passive equal to (100% - your true score that evening). The passive will be gained at the beginning of the night without the player being alerted. A random neutral role will replace “Eldritch Being” in any investigations."},{"name":"Symptom of Insanity (Passive, Locked):","value":"Potentially unlocked by encountering someone who has Incomprehensible. You will lose the passive after experiencing one of the following the next day: 1.) You will receive an HN in the evening. This will contain 10 randomly/arbitrarily picked messages from other HNs this game, all unattributed. 2.) Instead of your chosen night ability, you’ll use a random ability that belongs to a role that existed last game. Your chosen target remains. 3.) The host or someone not in-game asked to do so will occasionally react to your messages in daychat with emotes that seem relevant, but are meaningless. 4.) Your evening score in feedback will be nonsensical. 5.) Your response must follow a restriction/technical of the host’s choice. Failing will penalize you 10%."},{"name":"Common Enemy (Passive):","value":"You can get lynched via hammer without the day ending. Town will be allowed another lynch."},{"name":"Goal:","value":"Be the last player alive."}],"meta":{},"desc":"Post 242\nDistorted Reflection (1x, 70%) Attack someone with their own base attack power, or 0.5x if it’s less than 0.5x, or ambiguous/circumstantial. If they live, they’ll gain Symptom of Insanity.","id":240,"locked":true}