{"aliases":["244","enchanter"],"author":"476226844585230337","title":"Enchanter","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Alchemist","subalignment":"Support","attack_power":"0.1x","defense_power":"1.0x"},"fields":[{"name":"Enchantment Level (Passive):","value":"The abilities you can grant each night depend on your target’s performance. If they place in the bottom third, they will get a random enchantment of level I. The middle third will receive a random II enchantment, and the top third will get a random III."},{"name":"Enchant:","value":"At night, pick a target you have not already enchanted. They will receive one of your locked abilities."},{"name":"Mending (Locked, Passive):","value":"(III) Unlocked upon receiving from Enchant. Your attack and defense power cannot be reduced."},{"name":"Infinity (Locked):","value":"(III) Unlocked upon receiving from Enchant. Choose a target to attack with your attack power. If your base attack power is less than 0.5x, hit with 0.5x."},{"name":"Fire Aspect (Locked, Passive):","value":"(II) Unlocked upon receiving from Enchant. Upon attacking somebody, they’ll ignite, receiving an astral attack for the following three nights. Each attack bears only a fourth of your initial attack score. These don’t take up a night action. Attacking the same target will never burn them again."},{"name":"Protection (Locked, Passive):","value":"(I, II, or III) Unlocked upon receiving from Enchant. 0.1x, 0.2x, or 0.3x, respective of your enchantment level, is added to your defense power."},{"name":"Sharpness (Locked, Passive):","value":"(I, II, or III) Unlocked upon receiving from Enchant. 0.1x, 0.2x, or 0.3x, respective of your enchantment level, is added to your attack power."},{"name":"Thorns (Locked, Passive):","value":"(II) Unlocked upon receiving from Enchant. Anyone who targets you with an attack will be counterattacked with a third of their attack score, even if you die from their attack."},{"name":"Bane of Arthropods (Locked, Passive):","value":"(I) Unlocked upon receiving from Enchant. Any bug-themed roles will take triple damage from your attacks."},{"name":"Looting (Locked, Passive):","value":"(III) Unlocked upon receiving from Enchant. Gain a random ability from anyone you successfully kill."}],"meta":{},"desc":"Post 244","id":242,"locked":false}