{"aliases":["247","band_leader","bandleader","band","leader","bl"],"author":"476226844585230337","title":"Band Leader","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Neutral","subalignment":"Benign","attack_power":"0.0x","defense_power":"1.2x"},"fields":[{"name":"Founding (Passive):","value":"Upon the game starting, you and three other randomly selected players gain a factional chat. This chat is open during day and evening phases. You must agree on a band name before the end of the first evening, or it is host’s choice. The factional chat will be renamed to that."},{"name":"Songwriting (Passive):","value":"you and your bandmates’ responses must be able to be arranged into an ABAB rhyme scheme. Slant rhymes are subject to host’s discretion. Your group is granted a drp per dead bandmate, which must be used to fulfill this. Failing this penalizes all members 30%, unless the result of a dnp."},{"name":"Hit (Passive):","value":"if all members place in the top half, each member’s effective score increases by the highest-placing member’s true score/5."},{"name":"Jam Sesh (0x, 50%):","value":"Roleblock a bandmate."},{"name":"Experimental Track (0x, 120%):","value":"Use anytime before evening. Exempt all band members from the rhyming requirement for the evening."},{"name":"Diss Track (0x, 120%):","value":"Choose any player who was mentioned in a response to start with two extra anonymous votes the following day."},{"name":"Inspiration (1x, 200%):","value":"Use any unlocked ability of a bandmate (dead or alive). If you fail to name an actual ability and its related player, it will fail and no ammo is used."},{"name":"Afterparty (Locked, Passive):","value":"Unlocked by placing top 3. Opens up the band’s chat for the following night phase."},{"name":"Synergy (Passive):","value":"Even with conflicting goals, if only yourself and bandmates are left, the game will end, every member winning."},{"name":"Chased A Dream (Passive):","value":"if all other bandmates die, you will take the role of a random bandmate, and lose this role."},{"name":"Goal:","value":"Survive alongside at least one bandmate until the game ends."}],"meta":{},"desc":"Post 247","id":245,"locked":true}