{"aliases":["296","babooshka"],"author":"476226844585230337","title":"Babooshka","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Neutral","subalignment":"Killing","attack_power":"1.2x","defense_power":"1.2x"},"fields":[{"name":"Paranoia (Passive):","value":"Three random players will be told this role spawned and is targeting them. One of them is actually your target."},{"name":"Pseudonym:","value":"Choose a role to appear as to investigations for the rest of the game. This can be done anytime and can be multitasked."},{"name":"Scented Letters (1x):","value":"You’ll gain one ammo for this ability any time you score above 50%.  Use any non-locked ability from any investigative role, as long as that ability’s exact name appeared in your response last evening (not case sensitive)."},{"name":"Incognito (1x, 100%):","value":"At night, target anyone who placed below you last evening, and receive a % of messages in that HN equal to your score last evening, rounded down. This will count as a visit. The other member of the HN’s messages will be attributed to “anonymous”. If there are ten or less messages, you’ll receive them all."},{"name":"Speculate:","value":"Guess your target’s name and exact role in host/alt DMs. This can be used once every night, and can be multitasked. You will be told either if the player or role is wrong, but never both in one night. You’ll be told if you are completely correct."},{"name":"Heartbreak (Passive):","value":"If your initial goal can ever be reasonably deemed impossible or no longer possible, your new goal is to eliminate all non-neutrals, plus anyone whose goal conflicts with your own. Scented Letters will allow you to use any town killing role’s ability, instead of any investigative ability. This will also trigger if you succeed with Speculate, but without the goal change."},{"name":"Goal:","value":"Successfully identify your target’s name and exact role with Speculate. Then, kill them."}],"meta":{},"desc":"Post 296","id":293,"locked":false}