{"aliases":["299","ship_of_theseus","shipoftheseus","ship","theseus","sot","st"],"author":"476226844585230337","title":"Ship of Theseus","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Dubious","subalignment":"Support","attack_power":"0.5x","defense_power":"1.0x"},"fields":[{"name":"Basis (1x):","value":"Use during any phase. Can be multitasked. Pick someone to target with your other abilities for (potentially) the remainder of the game. If they’re neutral, or share your alignment, it will fail. Restocked automatically if your original target dies."},{"name":"Numbing Agent (2x):","value":"Use during any phase. Can be multitasked. Use on your Basis target. Until they outplace you during the evening, they won’t be notified any time you change an aspect of their role. If they try to use an ability they no longer have, it will silently fail."},{"name":"Dismantle (0x):","value":"Gains 1 stock if you place above your Basis target with a response that contains 2+ verbs. Remove a random ability from them that’s from their original role."},{"name":"Replenish (0x):","value":"Gains 1 stock if you place above your basis target with a response that contains 2+ nouns. Give them a random ability from a random role of your faction/alignment. Repeated uses will give them a random ability from a role whose Subalignment matches that of the first, randomly picked role."},{"name":"Repurpose (Locked):","value":"Unlocked by placing in the top half with a response that contains 2+ adjectives. Can only be used on your Basis target if their original role’s abilities have been replaced by an equal or greater amount of new abilities. Change their alignment, goal, and factional abilities to match your own."},{"name":"Overhaul (0x, 135%):","value":"Can be multitasked with Dismantle or Replenish. Sacrifice as much ammo as you want from one or more abilities. For each ammo sacrificed, you may use Dismantle or Replenish one more time in the same night."},{"name":"Define (Locked, 1x):","value":"Unlocked after using Dismantle, Repurpose, and Replenish on your basis target so each one of their abilities have been replaced with one from your alignment, and their factional abilities, alignment, and goal match your own. Convert yourself to any GIMT role you want."}],"meta":{},"desc":"Post 299","id":296,"locked":true}