{"aliases":["300","queen_of_the_hill","queenofthehill","queen","hill","qoth","qh"],"author":"476226844585230337","title":"Queen of the Hill","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Town","subalignment":"Power","attack_power":"0.0x","defense_power":"1.5x"},"fields":[{"name":"Never Late:","value":"Use during the appropriate phase. If you DNP in a round, you may submit a response to that round later. You will gain a boost of 2-20% this evening based on how much the host liked it out of 10. For any day phase in which you could’ve voted but did not, you may submit a retroactive vote in alt DMs. If this vote changes the lynch, the appropriate parties will be revived and/or killed. If you do not use a night action one night, you may multitask two abilities the following night."},{"name":"Manufactured Activity (Passive):","value":"Each day, there’s an additional lynch that only you may vote on. Your only vote choices will be anyone who has not sent a message today, or, if everyone has sent a message, the 3-4 players who have sent the lowest amount, as well as “abstain.” If you do not vote or send an invalid vote, it will default-lynch a random player within those parameters."},{"name":"Coronation (1x, 100%):","value":"Target someone who sent more messages than you last day phase. If attacked by someone who sent less messages than them, their defense will double."},{"name":"Time Gain (0x, 75%):","value":"Target any player who has been the first or last person to message in any day phase. Increase their attack power or defense power by 50%."},{"name":"Drivel:","value":"Use at night. The next day, two of the following will be options for your Manufactured Activity lynch regardless of activity: The first or last player to respond last evening, the most verbose or concise responder last evening, the player(s) with the fewest or most HNs all game, or someone who has said “snakes”, “rizz”, or “rephrase” in daychat."},{"name":"Alive Longer Than Everything Else (passive):","value":"If you’re alive, town will not auto-lose due to not holding a majority or situations where it is otherwise seemingly impossible to win. You generally have to be dead for town to lose. If this results in a stalemate, best responder next evening wins."}],"meta":{},"desc":"Post 300","id":297,"locked":true}