{"aliases":["305","vault_overseer","vaultoverseer","vault","overseer","vo"],"author":"563491765576007680","title":"Vault Overseer","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Unseen","subalignment":"Protective","attack_power":"1.2x","defense_power":"1.0x"},"fields":[{"name":"Blueprints (2x):","value":"This ability maintains the ammo you had before being converted. Use during evening before voting ends. After voting ends, but before results release, learn the top 3 responders. Decide if they are added to the Vault and gain the Vault passive. You only lose ammo if players are added to the Vault. This ability becomes Locked when 8 or fewer players are alive."},{"name":"Vault (Locked, Passive):","value":"You have access to a factional chat with other Vault players. Your defense power is increased by 1.9x for purpose of attacks by non-Vault players (assuming at least 1 other Vault player is alive). You are immune to any negative effects potentially triggered by your messages during the day phase. During the day, a majority vote of Vault players (in the Vault factional chat) may remove this passive from you."},{"name":"Social Experiment:","value":"Control target player with the Vault passive to attack another player with the Vault passive with their attack power or 1.2x Attack Power, whichever is higher"},{"name":"Deadly Interview (1x, Locked):","value":"** Unlocked the first time a player with the Vault passive dies. During the day, choose a technical restriction for responses (described in 30 characters or less), which will be announced at the beginning of the evening to all Town and Unseen players. The top-scoring player to comply with this technical restriction will gain the Vault passive. In addition, you will astrally attack the lowest placing (non-unseen) player that didn't follow the technical"},{"name":"Employee Discount (Passive):","value":"** Triggered if you place in the top 3. You unlock the Vault passive."}],"meta":{},"desc":"Post 305\n*Converted from Vault-Tec Architect (37)*","id":302,"locked":false}