{"aliases":["311","cleric"],"author":"706083462750404658","title":"Cleric","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Town","subalignment":"Support","attack_power":"0.3x","defense_power":"1.2x"},"fields":[{"name":"Guidance:","value":"Target a player. They may add a quarter of your score towards any Charge ability, or Attack Score."},{"name":"Light:","value":"Target a player in the Day. If you have a greater Defense Score than them, you and all Town Investigatives learn who they visit this round."},{"name":"Mending:","value":"Provide any other player with +1x power to a limited **non-charge, non-locked** ability of your choice. If the targeted player does not have that ability, it will be ignore but you will not learn of it."},{"name":"Resistance:","value":"Target a player. They may add a quarter of your Defense Score towards their Defense Score."},{"name":"Sacred Flame:","value":"Attack a player of your choice. Gain 0.1x Attack Power, with a maximum of 1.0x."},{"name":"Spare the Dying:","value":"Target a player. If they have 0% or DNP, their raw score is now equivalent to a tenth of your Defense Score."},{"name":"Thaumaturgy:","value":"Randomly, one of these effects happen, Astrally...\nSay any message in <#654891597129056269> in the next Day Phase.\nGive every player a boost or penalty equivalent to +1% or -3% in the next Evening Phase.\nRemove one random letter to every response the next Evening Phase.\nSay any message in <#654891597129056269> in the next Evening Phase or Night Phase.\nClose a random HN or open a random HN between two players the next Night Phase.\nStop a player of your choice from attacking, but without information if they attacked or not the next Night Phase.\nThis ability can be used at any time."},{"name":"Toll the Dead:","value":"Attack a player of your choice. Steal a quarter of their Defense Score to your Attack Score."},{"name":"Word of Radiance:","value":"Attack as many people of your choice with half the Attack Power."},{"name":"Temple of the Gods (Locked, Charge 100%):","value":"This ability unlocks when you win. Multitask three other abilities at once."}],"meta":{},"desc":"Post 311","id":309,"locked":false}