{"aliases":["319","imposter_like_the_among_us_one_do_you_get_it","imposterliketheamongusonedoyougetit","imposter","like","among","one","get","iltauodygi","ilaog"],"author":"890576217298858015","title":"imposter like the among us one do you get it","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Mafia","subalignment":"sus","attack_power":"10.0x","defense_power":"2.0x"},"fields":[{"name":"Kill:","value":"Eliminate someone instantly every night, defense power do not matter, alignment also do not matter. Killing someone leaves their body hidden somewhere in <#1242265997105430558> via emoji reaction, crewmates (more on this role later) can find this role by reacting on the same message. The person who found the message first is able to use \"Report\", which occurs a mini evening. If body is not found by evening, Imposter gets a 0.5+ defence boost. This does not stack and expires until the next morning. When using this ability, you must use the word sus in your response in the next responding period."},{"name":"Sabotage (5x, 100%):","value":"Hide an emoji anytime in <#1242825524955582635> , at least 3 people (aside deom the imposter) must react on that message with that emoji within 1.5 hours. If not, the whole day is skipped to the night period. The imposter gains an 1.0+ defense boost. These boosts stay for the rest of the game. If the sabotage is fixed, however, on the next night, you will not be able to use \"Kill\" for 2 nights."},{"name":"Vent:","value":"Every night, you pick a person to vent to (not emotionally). Any actions that person did in a specific time frame of 6 hours will be revealed to you. But! They will know an imposter vented to you next morning."},{"name":"Accuse (2x, 20%):","value":"If usage succeeds, you vote power multiplies by 3. If not, you you be voted 2 times. Can only be use in (that time when you vote someone to get out of the game i guess)"}],"meta":{"post":"319","track_message_id":"1316417665383923726"},"desc":"Post 319","id":317,"locked":false}