{"aliases":["90","alchemist"],"author":"1122288706401861672","title":"Alchemist","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Dubious","subalignment":"Support/Killing","attack_power":"1.2x","defense_power":"0.7x"},"fields":[{"name":"Customers (Passive):","value":"Every night, you recieve a list of random players based on your score. These players become your customers, and any ability mentioning customers refers to this list."},{"name":"Undiscovered Brew (x1, Charge 150%):","value":"You may use any brew for free, even if it is locked or the target is a non-customer. On the night you use this ability, any investigations performed against you will be treated as if you are mafia, even if they ignore investigation modifiers."},{"name":"Berserker Brew (Charge 100%):","value":"Target a customer or yourself. For the rest of the game, their attack power and defense power are doubled, and any actions they make are both astral and rampaging. However, they will unstoppably die at the end of the second night since the use of this ability."},{"name":"Phantom's Cocktail (Charge 100%):","value":"Target a customer. For the following Day, Evening, and Night phase, they will be unvotable, untargetable, and all of their actions will be astral."},{"name":"Poisoned Drink (Charge 100%):","value":"Target a customer. They will unstoppably die the following night."},{"name":"Super Strong Alcohol (Charge 50%):","value":"Target a customer. They will be roleblocked, and if they place below you in the next evening phase, they will also be roleblocked the night afterwards."},{"name":"Mida's Exilir (charge 50%):","value":"Target a customer. They, and anyone they target, will be turned into gold the next day and cannot vote. Additionally, the target will be roleblocked."},{"name":"Regular Alchohol:","value":"Target a customer. They will be roleblocked, with no additional effects."}],"meta":{},"desc":"Post 90\n*Science and Magic are not exclusive, my dear friend. Now, what potion do you want?*","id":89}