{"aliases":["96","undercover_officer","undercoverofficer","undercover","officer","uo"],"author":"134499733849899008","title":"Undercover Officer","color":null,"iconURL":null,"imageURL":null,"params":{"alignment":"Town","subalignment":"Investigative","attack_power":"0.80x","defense_power":"0.75x (1.5x)"},"fields":[{"name":"Cover Story (Passive):","value":"You will be randomly assigned to infiltrate one evil faction present in the game. You will choose a role belonging to this faction and will appear as this role to the faction members. You will have access to the relevant factional chat."},{"name":"Initiation Ritual (2x):","value":"Attack a player. If you kill them and they are town, the Initiation Ritual is considered completed and this ability becomes Locked. If successful, you gain all the Passives of your chosen cover role."},{"name":"Bulletproof Vest (3x):","value":"Double your defense power for the evening."},{"name":"Self Defense (1x, Charge 150%):","value":"Attack a member of your faction."},{"name":"Sabotage (1x, Charge 75%):","value":"Roleblock a member of your faction."},{"name":"Deep Cover (1x, Charge 50%, Locked):","value":"Unlocked when you place in the top half AFTER completing the Initiation Ritual. This ability allows you to use one of the abilities of your chosen cover role each night."},{"name":"Made (Passive):","value":"Triggered if you place in the bottom half twice (or three times, all after you completed the Initiation Ritual). At the beginning of the night phase, it will be announced to your faction that you are the Undercover Officer. You may not use the Sabotage ability this night. No other ability can interfere with this passive."},{"name":"Snitches Get Stitches (Passive):","value":"You may not request Hello Neighbors. You may not reveal, directly or indirectly, the identity of any of your infiltrated faction members. You may not reveal your role to anyone. You may only state you are suspicious of a player or suggest that a player target another. In other words, imagine you are actually undercover and try to win without getting yourself killed."}],"meta":{},"desc":"Post 96","id":95}