{"aliases":["2514","skwithanunnecessaryamountofattributes","sk_with_an_unnecessary_amount_of_attributes","sk","unnecessary","attributes","swauaoa","suaa"],"author":"327918538419601409","title":"SK with an unnecessary amount of attributes","params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Stab someone at night."},{"name":"Attributes:","value":"- Astral\n- Redirect immune\n- Control immune\n- Detection immune\n- Prevention immune\n- Conversion immune\n- Modification immune\n- Suppression immune\n- Modkill immune\n- Blackmail/mute immune\n- Frame immune\n- Autovest immune (Autovests will not affect your attack)\n- Detainment immune (You cannot be jailed or super-rbed)\n- Poison immune\n- If you are roleblocked, you will attack the role blocker in addition to your target.\n- When you automatically kill a roleblocker, the roleblock attempt will fail.\n- Roleblockers that target you will have their wills covered in blood, making it unreadable.\n- At night, you may choose to spare roleblockers instead.\n- If you attack someone within two houses of you, your attack is upgraded by one stage.\n- If you kill someone with natural Basic defense, your defense is upgraded by one stage.\n- When you automatically kill a roleblocker, all targets that are roleblocked the same night will be dealt a Basic attack."},{"name":"Attributes (cont.):","value":"- If exactly one person visits the same target as you, their visit will fail.\n- When you kill a factional leader (see post 2134), you gain an Invincible autovest.\n- Your attack rampages every third night.\n- You learn the role of whoever your target visits that night.\n- If exactly two people visit the same target as you, you will learn their roles.\n- If your target’s defense is too strong to kill, there is a 20% chance that they will be converted to a random Neutral Killing instead. They will be able to win with you.\n- When you successfully kill, you get a random Luxury from 2139 that you will be able to multitask with your normal ability.\n- You know all possible win conditions at the start of the game.\n- If you attack a target, their defense is too strong to kill, and they fail to be converted, your attack will be raised one stage the next time you attempt to attack them."},{"name":"Attributes (moar.):","value":"- While you’re alive, anyone you don’t target that is visited by three or more players will be roleblocked. You cannot be roleblocked this way.\n- You will learn who all opposing evil factions visit each night, but not their roles or effects.\n- Once per game, you may forgo your action to Astrally attack two random players with Powerful attacks.\n- You will gain one use a random ability that was used on you each night.\n- If you kill a player who is one of the targets of a two-player ability that night, you will kill the other player, even if the two-player ability fails.\n- You may choose to grant the two players neighboring your target Powerful defense for the night. This does not skip houses.\n- If you kill a player with a Rampage ability, your attack will Rampage the next night.\n- Once per game, you may go on day alert during the night, stabbing everyone who votes you or performs an ability on you the next day.\n- You may choose to have your attack resolved immediately during the night."},{"name":"Attributes (why.):","value":"- If a player visits you to attempt to convert you, you will stab them.\n- Once per game, you may choose to have whoever you kill that night appear alive until they are visited or voted.\n- There is a 5% chance that each person you kill will gain your win condition after they die. You will be informed if this occurs, and you will be able to revive them at any point.\n- Once per game, you may redirect all of your visitors to whoever you target that night.\n- Once per game, you may disguise the cause of death of whoever you kill that night. The targets will not be cleaned.\n- Once per game, you may choose to stab whoever has the most votes during the day. The day immediately ends after that.\n- Once per game, you may redirect all of your target’s visitors to yourself.\n- Once per game, you may choose to attack everyone that visits you.\n- All of your kills are Cleaned, and you will be able to see the roles and wills of everyone you clean.\n- You may not self-target.\n- Your attributes may not be copied."},{"name":"Attributes (stop.):","value":"- Ten random attributes will be disabled each night. This only lasts for the night. This attribute will not be disabled."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{},"desc":"Post 2514","id":1064}