{"aliases":["4276","the_crook","thecrook","crook"],"author":"654448067969548338","title":"The Crook","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Brainless","subalignment":"Lawbreaker","unique":"False","attack":"Basic","defense":"None"},"fields":[{"name":"Abilities:","value":"- **Pickpocket** (3 uses) - Choose a player each night to pickpocket. You will steal any items or abilities they attempt to use that night, rendering them powerless. The stolen items/abilities are used against them at your discretion.\n- **Forgery** (2 uses) - On odd-numbered nights, you can forge a document, framing a player of your choice. The forged document will appear as incriminating evidence against them the next day.\n- **Smuggle** (Infinite uses) - You can smuggle contraband into the town. Once per night, you can anonymously deliver a forbidden item (such as weapons) to a player, increasing their attack by one level.\n- **Blackmail** (3 uses) - Target a player and gather sensitive information about them. You can then threaten to reveal this information publicly, forcing them to vote as you wish the next day.\n- **Hijack** (2 uses) - Take control of a player's abilities for one night, using them for your own benefit. You will perform their abilities in secret."},{"name":"Abilities (cont.):","value":"- **Arson** (1 use) - Set fire to a player's home, preventing them from using their abilities for the next two nights. They will also be doused in gasoline, making them vulnerable to attack.\n- **Counterfeit** (2 uses) - Craft a convincing counterfeit item and give it to a player. This item will appear genuine, but it won't function as expected, causing confusion and chaos.\n- **Heist** (1 use) - Organize a heist with other Brainless members, redirecting all actions targeted at you and your faction members to a randomly selected player for one night.\n- **Bribery** (3 uses) - Attempt to bribe a player into joining the Brainless faction. If they accept, they will work with you secretly, but their alignment remains unchanged.\n- **Vandalism** (Infinite uses) - Graffiti your signature symbol on a player's house, revealing their alignment to the town."},{"name":"Attributes:","value":"- **Criminal Network** - You are immune to roleblocks and can see the messages between fellow Brainless members at night.\n- **Ruthless** - You can only be killed by a lynch vote.\n- **Undercover Agent** - You appear as a town member to investigative roles.\n- **Crime Syndicate** - During Tuesday and Friday, your abilities have double effectiveness, and you gain an additional use of each ability on those nights."}],"meta":{},"desc":"Post 4276","id":1082}