{"aliases":["4246","surgeon"],"author":"329331408269213696","title":"Surgeon","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Peasant","subalignment":"Chaos","unique":"False","attack":"None/Unstoppable","defense":"Basic Auto-Vest"},"fields":[{"name":"Abilities:","value":"- At night, perform Surgery on someone, healing them (as a doctor would).\n- During the day, if 4+ people are dead for the first time, you harvest body parts from them. The next night, turn the person you're performing Surgery on into a Monster, an entirely new \"player\" controlled by the collective actions of the dead."},{"name":"Attributes:","value":"- When you turn someone into a Monster, they die. Then, a new player is added to the playerlist, \"The Surgeon's Monster\", which is announced to the town. The monster can't vote, but can do night actions and speak in day-chat as a normal player would. The Monster begins with no attack and no defense.\n- The monster can perform any night ability that a dead role could do. Dead players may input which action to do and which target(s), and one random input will be selected. (ie: One dead player suggests using the ability of a dead vigilante to kill a living player: it is chosen at random, so the monster shoots that player.)\n- Each dead player can make the monster say one thing during the day. (The host is the one speaking in day chat on behalf of the monster.)\n- The Monster can be visited, voted for during the day, etc. They are identical to a player mechanically other than the fact they are controlled by the dead and cannot vote others."},{"name":"Destiny:","value":"Create a Monster."},{"name":"Goal:","value":"Have each living Peasant fulfill their Destiny."}],"meta":{},"desc":"Post 4246\n*The bloodied medium asked the surgeon why she had done such. \"Healing you was not the intention of this operation,\" the surgeon answered, \"your body is a catalyst for much more serious work. Don't be so selfish as to deny your fellow townsfolk this gift.\"*","id":1120}