{"aliases":["4254","house_painter","housepainter","house","painter","hp"],"author":"329331408269213696","title":"House Painter","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Peasant","subalignment":"Chaos","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- At night, select up to two targets (including the same person twice). You visit them and apply a layer of paint to their house.\n- At night, you may instead attempt to drive up to three players whose houses you've painted Mad (this is astral). After receiving their results on how many visitors they have tonight, they are aware they are beginning to go Mad, and must guess how many layers of paint are on their house, from 1-3. If they guess incorrectly, they go Mad, being blackmailed the next day."},{"name":"Attributes:","value":"- Players with at least one layer of paint will be unnerved by the paint and stay up at night, seeing how many players visit them each night.\n- For each layer of paint players have, they will see an additional visitor. (ex: 1 layer of paint = +1 visitor, 2 layers = +2 visitors, etc). This visitor is not real and does not trigger visiting effects (obviously).\n- Players are not aware of how many layers of paint are on their house."},{"name":"Destiny:","value":"Drive two players mad."},{"name":"Goal:","value":"Have each living Peasant fulfill their Destiny."}],"meta":{},"desc":"Post 4254\n*The woman thanked the house painter as he left, then examined her new wallpaper. It was a hideous shade of yellow. The pattern of the wallpaper was not symmetrical as one might expect, it started and stopped erratically as if the lines had been born and died while the wall was painted. At night, however, the wallpaper went from unpleasant to frightening in demeanor. When the moonlight struck the pattern, it almost appeared as if a figure was moving in the chaotic lines of the wallpaper. No, it couldn't be just one figure - there must've been thousands of people trapped in the wallpaper, creeping around at night to avoid detection.*","id":1123}