{"aliases":["4255","6104","scp-6104","scp6104","s6","iceskatingtothedeath"],"author":"329331408269213696","title":"SCP-6104","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"SCP","subalignment":"Safe","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Each night, select a variation of the game to broadcast, with varying effects. All players who stay at home will watch the broadcast and be affected. Players are aware of the broadcast and are told of what happens on the screen. (ex: \"You watch a strange TV show about ice-skaters fighting to the death on the rink. A soccer player kicks a ball at enemy skaters in an attempt to knock them down.\")\n- Each variation can only be played once.\n- During the day, force someone to stay at home tomorrow night, up to 3 times per game. Bypasses RB immune"},{"name":"Attributes:","value":"- On the first night, you have an ad-break, and are unable to broadcast."},{"name":"Variations:","value":"- Soccerer: A soccer player kicks a ball at enemy skaters in an attempt to knock them down. Viewers find this so thrilling that they are roleblocked and do not receive any night messages while watching the broadcast.\n- Listening: There is an ear symbol present in the top right of the recording. You learn the name and role of all visitors of people listening to the broadcast tonight.\n- News Break: Despite the game not being paused, a news break begins in the middle of the broadcast. Viewers become politically confused and refuse to vote tommorow.\n- Gambler: The cameras focus on a group of gamblers in the audience seats instead of the game. Viewers get agitated and basic attack a vistiro."},{"name":"Goal:","value":"Prevent the Foundation from recontaining you at all costs."}],"meta":{},"desc":"Post 4255\n*SCP-6104 is a Toshiba L9300 Ultra HD 4k Television. When powered, it will only display the channel for \"Ice Skating... TO THE DEATH!\", a variation of ice skating which takes the form of a combat sport. No other channels are available, and the TV itself is missing hardware to receive radio frequencies to access such channels. Athletes in this sport partake in a bizarre other-dimensional choreographed fight to the death.*\n*I wonder who wrote this SCP haha thats crazy*","id":1124}