{"aliases":["4268","agriculturalist"],"author":"329331408269213696","title":"Agriculturalist","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Peasant","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- At night, choose a player to Root. They will become a potato, being dealt a basic attack as the roots pierce their body (potatoes have an indeterminate growth habit, which means they can continue growing and producing tubers as long as the environmental conditions are favorable.)"},{"name":"Attributes:","value":"- When you Root a player, they become a part of your Crop: you have a shared night chat with all players in your Crop, alive or dead (you share a network of roots that transfer nutrients.)\n- Players in your Crop who were part of a non-neutral faction now win with you instead of their original faction, even while dead (potato tubers draw nutrients and water from the soil.)\n- On night 3, you may Sprout, bringing one player in your Crop back to life, and they remain their original role but win with you (typically, multiple tubers can be harvested from a single plant.)"},{"name":"Destiny:","value":"Add 5 people to your Crop. (Potatoes are typically grown from seed potatoes, whose eyes sprout and grow into new potato plants.)"},{"name":"Goal:","value":"Have each living Peasant fulfill their Destiny. (Potatoes have a fibrous root system. These roots are essential for the potato's growth.)"}],"meta":{},"desc":"Post 4268\n*The agriculturalist always felt Salem was sketchy ever since he came to research tractor design - now he was sure. Potato roots crawled beneath the door, like the searching tendrils of an elder god. He saw something rise to the window of his bedroom, and more roots sprawled from a crack in the floorboard. As he tried to unlock the attic hatch, the roots grasped his limbs, and tore him back down to the floor. The roots pierced into his arteries and ran through his blood vessels until they were crawling around in his heart. He felt the pain subside, and as the roots pumped in fresh nutrients into his body, a new potato grew in his heart until it burst.*","id":1125}