{"aliases":["4659","dreamer"],"author":"329331408269213696","title":"Dreamer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Peasant","subalignment":"Chaos","unique":"False","attack":"None","defense":"Basic Auto-Vest"},"fields":[{"name":"Attributes:","value":"- You start the game with an estranged lover. You know their role, but they don't know yours.\n- They don't know you.\n\n- After 3 nights, your Destiny is no longer to win with your lover, but to see your lover die.\n- If your lover dies before night 4, you die out of grief.\n- When you fulfill your destiny, you leave the town in victory.\n- **__Part of the Daily Streak faction__**\n- If part of the Daily Streak faction, loses its Destiny and instead wins with Daily Streaks. Additionally, when your lover dies after night 4, choose 3 players to deal a basic attack to."},{"name":"Destiny:","value":"Win with your lover before night 4."},{"name":"Goal:","value":"Have each living Peasant fulfill their Destiny"}],"meta":{},"desc":"Post 4659\n*Three knocks on the door. I looked through the peephole and my eyes lit up. Something was off, though. He didn’t run in with a warm smile, like the Grand I once knew. He looked like he was somewhere else, far away. I tried to hug him, and he flinched and pushed me away. I was so scared he was losing his memory, but he remembered me. He just didn’t see the same. One day, he left and didn't tell me where to.*\n\n*Two months later, an older woman dressed in a black came to my door. When she raised her head, I saw it was Grand’s mother. She spoke before I had any time to ask about him.*\n\n*“Grand,” her voice wavered, “he’s passed on.” She stood outside my door teary-eyed and told me about the soldiers who came by her house that morning with bad news. I was the first guy she wanted to tell.*\n\n*And I didn’t know how to react. Whether I was happy or sad that he was gone. So I sat on the floor and drew him. I drew him laughing and smiling, trying to teach me basketball, sitting on the couch curled around me. It eased the pain, to draw the man I once knew, and forget the one who came knocking at my door.*","id":1286,"locked":false}