{"aliases":["4766","goldlewis_dickinson","goldlewisdickinson","goldlewis","dickinson","gd"],"author":"329331408269213696","title":"Goldlewis Dickinson","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Fighter","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Light Punch: Visit a player. Gain 1 Combo if you're the only visitor. Attack them if you have 3+ Combo.\n- [__BEHEMOTH TYPHOON__]: Requires 2 Combo. Swing your coffin at a player, attacking them and the player above them on the playerlist, skipping dead players and yourself. Gain 1 Combo if you kill both targets. 1 night cooldown.\n- [__SKYFISH__]: Requires 2 Combo. Tonight, begin revving your gun, informing visitors of the loud noise. Tomorrow night, instead of doing actions you select players equal to your Security Level (ex: 3 Security, select 3 targets). Shoot at each target's house, rampaging there with a basic attack. Reset Security Level to 1 after use. You are roleblock immune during the second part of this ability. Gain 1 Combo if you kill more than 1 player."},{"name":"Abilities (cont.):","value":"- [__THUNDERBIRD__]: Requires 3 Combo. Send a drone to any player's house, including your own. At the end of each night, see everyone who visits the player's house. At the end of the drone's lifespan, choose a player you saw visit them on any previous night, and powerfully rampage at their house. Gain 1 Combo each night that you see more than 3 visitors. The drone stays on the house for nights equal to your Security Level, then reset Security to Level 1 after use.\n- Overdrive (__DOWN WITH THE SYSTEM__): Requires 5 Combo. Deal an Overkill attack to anyone."},{"name":"Attributes:","value":"- Has a unique mechanic called \"Security Level\". Security starts at Level 1, and is maxed at 3.\n- Each night, gain 1 Security.\n- __**Part of the Daily Streak faction**__"},{"name":"Goal:","value":"Kill the other Fighter, then be the last one standing."}],"meta":{},"desc":"Post 4766\n*SECRETARY OF ABSOLUTE DEFENSE*","id":1332,"locked":false}