{"aliases":["12","god"],"author":"562746047596593163","title":"God","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Overkill","defense":"Immortal"},"fields":[{"name":"Abilities:","value":"- Use the ability of any role in <#970046125065265202> at night. Any. Role.\n- Die someone. They die."},{"name":"Attributes:","value":"- You may use multiple different abilities at once.\n- You may use multiple of the same ability at a time.\n- You can always talk in any Day chat, regardless of the phase or what day it actually is. Even if it's Day 9, you can still talk in the Day 1 chat. You may also talk in all private chats (informed minority, dead, see jailor/wisteria, etc) but cannot see player chats.\n- Hanging immunity.\n- Death immunity.\n- Modkill immunity.\n- Kick immunity.\n- Ban immunity.\n- Mute/timeout immunity.\n- Conversion immunity.\n- Control immunity.\n- Redirect immunity.\n- Roleblock immunity.\n- Occupy immunity.\n- Your ability cannot fail.\n- None of your immunities or other attributes can be bypassed under any circumstance.\n- Your abilities and attributes cannot be removed. They can be copied, but only if it's actually allowed.\n- Your defense will always be set to Immortal.\n- You cannot be removed from the game.\n- The wording of this role can only be modified when a game is not running."},{"name":"Attributes (cont.):","value":"- If your role is removed, delay the removing. Automatically and secretly create a new role with a completely random name, which if ever is mentioned, immediately is changed to a new one. This new role has the exact same abilities and attributes as God.\n- An outside party cannot forcefully switch your role. Only you can switch your role.\n- If the game would only be blocked by you and a Survivor, the game will end and you will lose. So yes, you can technically lose.\n- If you somehow manage to die or exit the game in any way, immediately revive yourself and/or add yourself back into the game. If the game is closed, automatically reopen it. If something prevents revives, immediately attack whatever prevents it then try again. If you still can't, remove them from the game."},{"name":"Goal:","value":"Eliminate all Survivors."}],"meta":{},"desc":"Post 12","id":1422,"locked":false}