{"aliases":["4744","bunker_spider","bunkerspider","bunker","spider","bs"],"author":"562746047596593163","title":"Bunker Spider","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Bunker","subalignment":"Indoors","unique":"False","attack":"Powerful","defense":"None"},"fields":[{"name":"Abilities:","value":"- Lay webs at a player's house.\n- Attack a marked player."},{"name":"Attributes:","value":"- You learn when a player is marked.\n- When a player is webbed, the first player to visit that person (based on time of submitted action) will become marked. Attacking abilities take priority. Additionally, all players who visit you are marked as well.\n- Arachnophobia Mode - Replaces the Bunker Spider with a giant 3D model of the word \"spider\" in bright red capital letters. The role of the name becomes SPIDER.\n- __**Part of the Daily Streak faction**__"}],"meta":{},"desc":"*Bunker Spiders, of the genus Theraphosa, are the largest arachnid found in the Thistle Nebula and the second largest ever discovered. It's believed they evolved to prey on large mammals over the course of a measly several hundred years after the Boat made its trip around the Thistle Nebula. (Refer to: Speculation on Increased Speciation Around the Fading Nebulae)*\n*Bunker Spiders produce silk and lay it around their chosen nesting area, then wait for it to be tripped on. They can be seen waiting on walls, often over doorways where prey could enter unaware. If you find a Bunker Spider 'unprepared' it may freeze as a defensive reaction. In this case they are best left alone. If a Bunker Spider reacts aggressively, it is best not to fight with ordinary tools. They use their webs to make up for their rather slow movement, so take note of your surroundings. Their webs can be broken easily with any blunt tool.*\n*Bunker Spiders can pose a great danger to humans and urban explorers especially, without a great benefit to their ecosystems. A resulting kill-on-sight order has been informally agreed upon between many states home to the Bunker Spider, and it is currently approved by the ITDA as of 10/6/2497.*","id":1669,"locked":false}