{"aliases":["4654","gambler"],"author":"562746047596593163","title":"Gambler","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Support","unique":"False","attack":"Variable","defense":"None"},"fields":[{"name":"Abilities:","value":"- Choose to kill, protect, investigate, or interfere a player. You may self target."},{"name":"Attributes:","value":"- For each action you take on a player, the host rolls a d6 in *your* channel. Your action has different effects based on what number is rolled.\n- Kill: 1 will make your target attack you with a Basic attack, or their attack value if it's higher. 2 will do the same as 1, but the attack Rampages. 3 will attack your target with a Basic attack. 4 will attack your target with a Powerful attack. 5 will attack your target with an Unstoppable attack. 6 will attack your target with an Overkill Rampage attack.\n- Protect: 1 will Basic Poison your target and give them Vulnerable defense that night. 2 will give them Vulnerable defense that night. 3 will give Basic defense. 4 will give Powerful defense. 5 will give Powerful defense and Purge the target. 6 will give the target Overprotective defense, clear __**all**__ negative effects, and make them lynch immune the next day."},{"name":"Abilities (cont.):","value":"- Investigate: 1 will publicly reveal your role and faction. 2 will publicly reveal your role. 3 will reveal your role to your target. 4 will do an Investigator (35) check on your target. 5 will reveal your target's role. 6 reveals your target's role, who they targeted, and who visited them.\n- Interfere: 1 will blackmail you and roleblock you the next night. 2 will blackmail you or roleblock you the next night. 3 will blackmail or roleblock your target. 4 will blackmail and roleblock your target. 5 will blackmail and randomly redirect your target to a random target. 6 will blackmail your target and you can select a second target to control them into. (If a 2 or 3 is rolled, you don't choose which of the two occurs.)\n- __**Part of the Daily Streak faction**__"},{"name":"Goal:","value":"Hang every criminal and evildoer."}],"meta":{},"desc":"Post 4654\n*All in on red!*","id":1718,"locked":false}