{"aliases":["4647","v1_update","v1update","v1","update","vu"],"author":"521123471460270121","title":"V1 Update","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"ULTRAKILL","defense":"Hellbent"},"fields":[{"name":"Attributes:","value":"- You are 3396: V1 but with the two new weapons recently added to ULTRAKILL (they wouldn't fit in the original):\n- **Sharpshooter Revolver** — Deal an Astral Powerful attack to a player. If you didn't use this ability last night, you may instead deal two Astral Powerful attacks to them and one two a random player other than you or them, and also explode any attacks of a tier lower than Unstoppable directed towards you, your target, or the random player, preventing the attacks and dealing a rampaging Powerful attack back at the attacker.\n- **S.R.S. Rocket Launcher** — Deal an Unstoppable attack to a player and their closest living neighbours. If you didn't use this ability for two nights, you may instead shoot a cannonball, dealing an Overkill attack to a player. If the target of your cannonball was also dealt an Astral attack, the cannonball explodes, becoming rampaging. *(1 night cooldown)*\n- You also have these modifications to your weapons based on new tech Rasen learned:"},{"name":"Attributes (cont.):","value":"- **Whiplash Arm** — Alternatively, juggle a coin or rocket that has been shot or suspended, increasing the attack value of the rocket or the attacks redirected by the coin by one.\n- **Freezeframe Rocket Launcher** — You may also jump on a suspended rocket at any time, allowing you to steer it to any player you want. You move above that player on the playerlist after the attack. *(1 night cooldown)*\n- You also have these specifications (they also apply to the original by the way this is just making them clear):\n- **Feedbacker Arm** — You can parry yourself.\n- **Marksman Revolver** — Redirects and duplicates all Astral attacks directed at your target.\n- **Overheat Nailgun** — Silver nails count as regular nails.\n- \"If you didn't use this ability last night\" etc. are TRUE on Night 1."},{"name":"Goal:","value":"NK goal + get at least 6000 style points"}],"meta":{},"desc":"Post 4647\n*IMPERFECT HATRED*","id":1723,"locked":false}