{"aliases":["4210","bounty_hunter","bountyhunter","bounty","hunter","bh"],"author":"562746047596593163","title":"Bounty Hunter","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Piercing","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- During the day, rig the vote. You control who everyone votes, and when. Anyone who has not voted may still appear to place a vote, but it will not actually count, while anyone who already voted will appear to switch their vote. 1 use.\n- At night, interrogate and threaten a target. They are roleblocked (and they know that it was from a Bounty Hunter) and you learn their affiliation with your target (see attributes). Interrogating the same person twice may give a different outcome. 3 uses."},{"name":"Attributes:","value":"- At the beginning of the game, you are assigned a target. This target will always be an evil factional head (randomized if multiple exist), or any evil faction member if no \"head\" role exists. You learn the role of your target.\n- **Piercing** - You ignore *all* defense.\n- You can read whispers. Additionally, you are roleblock immune.\n- Interrogation messages are as such:\n> \"I've got nothing to do with them. I'd rather their head be gone.\" *If player must see your target dead to win and is not a REF member*"},{"name":"Abilities (cont.):","value":"> \"We're the stronger group anyways, so good luck with your mission.\" *If player is part of an REF, but not the REF that your target is in*\n> \"I don't know who that is, but I don't really care.\" *If player is neutral towards your target (such as NBs)*\n> \"I'll never tell you anything.\" *If player is on the same REF as your target. Gain a use of second ability when this occurs.*\n> \"Alright, alright... you're looking for [Target Name].\" *If player is on the same REF as your target, and second time targeting that player. Additionally, your target may choose to instead die to you and hide this message.*\n> You found your target, so you killed them! *If player is your target.*"},{"name":"Goal:","value":"Live to see your target dead *and* the Town lose."}],"meta":{},"desc":"Post 4210\n*Just doin' what's right.*","id":1943,"locked":false}