{"aliases":["3812","exploding_kittens","explodingkittens","exploding","kittens","ek"],"author":"562746047596593163","title":"Exploding Kittens","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Overkill","defense":"Invincible"},"fields":[{"name":"Abilities:","value":"- Force someone to draw 4 cards if you suspect they haven't drawn one within the past day."},{"name":"Attributes:","value":"- Your presence is announced at Day 1.\n- When in the game, all players may choose to, at any time, draw a card, with varying effects. This can be done multiple times per phase.\n- When players draw a card, if it is not played immediately, players can keep it for later. There is no limit to the amount of cards that can be in a hand at once, nor for the amount of cards that can be played at once.\n- All players start with a Defuse.\n- All played cards are publicly announced.\n- Any card that says \"Immune to force drawing\" means that playing it allows you to become immune to Exploding Kitten's ability for one day without drawing a card.\n- Any card that says \"Cat card\" does nothing on its own. Playing two at once allows you to steal a random card from a player, three at once lets you request a specific card from a player, who must give that card to you. If they don't have it, you get nothing."},{"name":"Attributes (cont.):","value":"- The Deck section explains how much of each card spawns. Whether you round up or down, at least one of each card must always spawn."},{"name":"Cards:","value":"- Exploding Kitten: You immediately die unless defused. Played automatically.\n- Defuse: Grants you immunity to an Exploding Kitten. Discarded when triggered.\n- Bearded Cat: Cat card.\n- Catermelon: Cat card.\n- Hairy Potato Cat: Cat card.\n- Rainbow-Ralphing Cat: Cat card.\n- Tacocat: Cat card.\n- Attack: Force the player below you on the player list to draw 2 cards, unless stacked with another Attack or Targeted Attack, each consecutive one adding 2 to the amount of cards that must be drawn. Immune to force drawing.\n- Favor: A player of your choice must give you a card of their choice.\n- Nope: Roleblock a player, or cancel the effects of their most recent card.\n- See the Future 3X: Learn the next 3 cards that will be drawn.\n- Shuffle: Shuffle the deck.\n- Skip: Immune to force drawing.\n- Alter the Future 3X: Learn the next 3 cards that will be drawn. You can change their order.\n- Targeted Attack: Exactly like an Attack, but you choose the target. Immune to force drawing."},{"name":"Cards (cont.):","value":"- Feral Cat: Can be substituted for any cat card.\n- Draw From The Bottom: Immediately draw from the bottom of the deck.\n- Imploding Kitten: Played automatically. The first time this is drawn, you may put it back anywhere in the deck. The second time, you immediately die and this cannot be defused. Removed from play after imploding.\n- Streaking Kitten: While in your hand, allows you to hold one Exploding Kitten.\n- Super Skip: Immune to force drawing. Negates the effects of Attacks.\n- See the Future 5X: Learn the next 5 cards that will be drawn.\n- Alter the Future 5X: Learn the next 3 cards that will be drawn. You can change their order.\n- Swap Top and Bottom: Swap the top and bottom cards of the deck.\n- Garbage Collection: All players are forced to discard one card of their choice, if they have cards.\n- Catomic Bomb: Shuffle the deck. All Exploding Kittens are then moved to the top. Immune to force drawing.\n- Mark: Publicly reveal one random card from another player's hand."},{"name":"Cards (moar.):","value":"- Curse of the Cat Butt: All cards in the target's hand are shuffled and their names hidden.\n- Barking Kitten: When played, if another player has the Barking Kitten, they must defuse it or they die. If nobody has it, you cannot play this again, but it remains in your hand. If you have both, you may select any player to force them to defuse this (or they explode).\n- Bury: Draw a card, then immediately put it anywhere in the deck.\n- Personal Attack: Functions as an Attack, but you must target yourself, and it gives 3 turns instead of 2.\n- I'll Take That: The next time a player draws a card, you steal that card from them. They learn what card it is.\n- Potluck: Beginning from you and going down the player list in order, all players must discard 1 card into the top of the deck."},{"name":"The Deck:","value":"- Exploding Kittens: Same number of cards as players.\n- Defuse: Same number of cards as players, plus 4. The extra 4 goes into the deck, the rest are automatically drawn.\n- Bearded Cat: Same number of cards as players.\n- Catermelon: Same number of cards as players.\n- Hairy Potato Cat: Same number of cards as players.\n- Rainbow-Ralphing Cat: Same number of cards as players.\n- Tacocat: Same number of cards as players.\n- Attack: 3/4ths the amount of cards as players.\n- Favor: 3/4ths the amount of cards as players.\n- Nope: 3/4ths the amount of cards as players.\n- See the Future 3X: 4/5ths the amount of cards as players.\n- Shuffle: 3/4ths the amount of cards as players.\n- Alter the Future 3X: 4/5ths the amount of cards as players.\n- Targeted Attack: 2/3rds the amount of cards as players.\n- Feral Cat: 3/4ths the amount of cards as players.\n- Draw From The Bottom: 3/4ths the amount of cards as players.\n- Imploding Kitten: 1 card.\n- Streaking Kitten: 1 card.\n- Super Skip: 1/3rd the amount of cards as players."},{"name":"The Deck (cont.):","value":"- See the Future 5X: 1/4th the amount of cards as players.\n- Alter the Future 5X: 1/4th the amount of cards as players.\n- Swap Top and Bottom: 2/3rds the amount of cards as players.\n- Garbage Collection: 2 cards.\n- Catomic Bomb: 1 card.\n- Mark: 2/3rds the amount of cards as players.\n- Curse of the Cat Butt: 1/5th the amount of cards as players.\n- Barking Kitten: 2 cards.\n- Bury: 1/2 the amount of cards as players.\n- Personal Attack: 3/4ths the amount of cards as players.\n- I'll Take That: 3/4ths the amount of cards as players.\n- Potluck: 2 cards."},{"name":"Goal:","value":"See 3 players explode, implode, or... bark? (Cause 3 deaths from your cards. Specifically, from the Exploding, Imploding, or Barking Kittens.)"}],"meta":{},"desc":"Post 3812\n*A card game for people who are into kittens and explosions.*\n*And laser beams.*\n*And sometimes goats.*","id":1980,"locked":false}