{"aliases":["2499","artisan"],"author":"888761463647371284","title":"Artisan","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Support","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Place down any of your **c**o**n**t**r**a**p**t**i**o**n**s. You can use this ability multiple times per night as long as you have enough **c**o**n**t**r**a**p**t**i**o**n**s.\n— Each of your **c**o**n**t**r**a**p**t**i**o**n**s can only be used so many times before they break down. In other words, one use of a **c**o**n**t**r**a**p**t**i**o**n** will only function for a certain amount of visits. Each **c**o**n**t**r**a**p**t**i**o**n** can break down in the middle of the night, and visits after it breaks down will not apply. Visits in the same night will take whoever has the highest priority first. If any visitors have the same priority, randomize the order.\n> __Net of Entrapment__: Place the net between two players with adjacent houses. Any who visit the first target will instead visit the second and vice versa.\n> - No one is notified they were affected by this ability.\n> - The net will still take effect if one of the players dies, their visitors would just be redirected to a corpse."},{"name":"Abilities (cont.):","value":"> - Affects the first three visits of either target before it breaks down.\n> __Wooden Statuettes__: Litter wooden statuettes in front of a target's house.\n> - If two or more people visit someone with wooden statuettes, the target will be protected with Basic defense.\n> - Gives no notification for the visitors, but the target will be aware someone protected them if they were attacked.\n> - Affects the first eight total visits of the target before all statuettes are used. The visits do not necessarily need to have triggered the defense.\n> __Blockade__: Place the blockade in front of someone's house. Anyone who visits them will have their visit prevented.\n> - Gives a standard \"visit prevented\" message as feedback.\n> - Affects the first two visits of the target before it breaks down."},{"name":"Attributes:","value":"- Whenever a player dies, you will collect some resources from their corpse. Depending on their actions during the game, you'll get a different resources.\n> - If they were a Town role which never visited a player, gain two `wood`.\n> - If they were a Town role which visited more Town players than non-Towns, gain two `stone`.\n> - If they were a Town role which visited less Town players than non-Towns, or an equal amount of both, gain two `steel`.\n> - If they were a non-Town role, gain one `antimatter`.\n- At any time, you may use a combination of your current materials to craft a **c**o**n**t**r**a**p**t**i**o**n**. Doing so will consume the materials you used. \n> - Combine one `wood` with one `steel` to gain a __Net of Entrapment__.\n> - Combine one `steel` with one `stone` to gain a __Blockade__.\n> - Combine one `wood` with one `stone` to gain __Wooden Statuettes__.\n> - `Antimatter` can substitute __any__ material in the formulas above."},{"name":"Attributes (cont.):","value":"> - Combine two `antimatter` to get one of each **c**o**n**t**r**a**p**t**i**o**n**. \n- If your role gains **P** at the start of it's name by any means, your goal will be changed to that of the Partisans."}],"meta":{},"desc":"Post 2499\n*I have no **time** for this nonsense! I've got deadlines to meet! Where's that shipment when you need it...*","id":2001,"locked":false}