{"aliases":["33","1935","kl-33","kl33","kl","k3"],"author":"521123471460270121","title":"KL-33","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Attributes:","value":"**Enhanced Durability** — Your skin is tough. Under the synthetic skin are military grade ballistic composites, RBC, as well as MSC plates to defend against energy weapon attacks. On top of everything are a few layers of Diamene, two layers of graphene, when hit with a sufficient force, quickly hardens into a material harder than diamond, though goes back to normal once the force dissipates. In other words, you have Basic defense.\n**Enhanced Strength** — You can lift up to 700 kg, having very impressive strength for her size due to enhanced robotic servos. So carrying heavy weapons that normally would require power armor to use effectively is child’s play to you. This is completely useless.\n**Enhanced Agility** — You are agile, both due to your size, strength, and movement programming. This does fucking nothing.\n**CQC Master** — You are well versed in CQC, again brought by combat protocols, which you can also use your weight to your advantage, being heavy for your size. I have no idea what CQC is."},{"name":"Attributes (cont.):","value":"**Master Marksman** — You have enhanced targeting computers, which can easily predict the trajectory of projectiles, given wind and air conditions, as well as predict where a target will be when the projectile gets there, as well as compensating for gravity. This comes with quicker reaction times, due to your robotic nature. Predict the trajectory of my cock in your mouth. \n**Enhanced Sight** — You have powerful lens’ within her eyes, which can allow your to zoom in to things, activate a night vision mode, or transfer to thermal optics at will. They also have a safeguard against flashes, as the lens have an auto-tint feature, like how modern welding helmets auto-darken. Roles are numbered posts in the \\<#970046125065265202> channel in the “Game Related” category of the Grand Idea Mafia (hell) server."},{"name":"Attributes (moar.):","value":"**Relay Chip** — You have an implanted ‘Relay Chip’, which allows you to relay, or teleport, to and from Big MT from anywhere, as well as summon weapons, ammo, or more explosives when you wishes, as it is also linked to an armory somewhere in Big MT. The first person to ping me acknowledging that they've read this gets a scroll. This also allows you to teleport elsewhere at will, though you must know where it is, whether it be line of sight, or through coordinates. Two times two is four.\n**Anti-Gravity Mobility Boots** — You are also equipped with ‘Anti-Gravity Mobility Boots’, which allow you to have even more agility, able to temporarily have low G so you can jump higher and glide, or walk up walls by changing the gravity for yourself. Though, the charge of these boots can be quickly depleted if used a lot. My favourite colour is orange."},{"name":"Abilities:","value":"**G-19 'Bastion'** — [25mm Grenade Rifle. Semi-/automatic, 15 vertical clip size, 90 drum mag size] (High Explosive) (Shaped Charge) (High Explosive Fragmentation). This deals a Basic attack to any player.\n**ARL-12 'Red Glare'** — [49mm semi-/automatic, unguided rocket launcher. 13 mag size] (High Explosive) (Shaped Charge) (Flechette Anti-Personnel) (High Velocity Boosted Kinetic Penetrator). This deals a Basic attack to any player.\n**M-77 'Annabelle'** — [109 mm MP Missile launcher, can fire unguided, thermal guidance, or manual TOW guidance with particle pointer] (High Explosive) (Shaped Charge) (Flechette Anti-Personnel) (High Explosive Plasma) (Electro Pulse) (High Velocity+warheads above) (High Velocity Boosted Kinetic Penetrator). This deals a Basic attack to any player."},{"name":"Abilities (cont.):","value":"**AGL-7 Mine Launcher** — [42mm hexagonal mines, can be timed, proximity, or detonated manually. 18 mag size] (High Explosive) (High Explosive Fragmentation) (Flechette Anti-Personnel) (High Explosive Plasma) (Electro Pulse). This deals a Basic attack to any player.\n**Anti-Gravity Blaster** — [Blast of gravitons, massively repulsive, initially non-lethal]. This roleblocks any player.\n**M-42 'Fat Man'** — [Launches mini-nukes with a heavy duty spring launcher] (Low Yield ‘Little Boy’, 38 m total annihilation diameter) (Standard Yield, 60 m total annihilation diameter) (High Yield ‘Big Kid’ 93 m total annihilation diameter) (MIRV Shell ‘Tiny Tots’, 20 small warheads in one shell, each warhead has 18 meter total annihilation diameter) (Low, standard, high yield warheads can be either contact detonated or time fused). This deals a Powerful attack to any player.\n**M-48 'Esther'** — [Improved Fat Man, longer range, built-in assisted targeting system]. This deals a Powerful attack to any player."},{"name":"Abilities (moar.):","value":"**AGL-6 Grenade Machine Gun** — [46mm Automatic grenade launcher, two-handed weapon. 53 ammo cap]. This deas a Basic attack to any player.\n**AGL-8 Grenade Minigun** — [25mm multi-barrel heavy weapon, uses same ammo as G-19 'Bastion', 9 rounds/sec RoF. 168 ammo cap]. This deals a Basic attack to any player."},{"name":"Goal:","value":"NK Goal"}],"meta":{},"desc":"Post 1935\n*ily zage*","id":2193,"locked":false}