{"aliases":["1001","sorcerer"],"author":"765276088183029810","title":"Sorcerer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Coven","subalignment":"Evil","unique":"False","attack":"Varies","defense":"None"},"fields":[{"name":"Abilities:","value":"> Learn or Upgrade a spell at day, use a learned spell at night."},{"name":"Attributes:","value":"> During Day 1, choose 3 spells to learn.\n\n> Every day after Day 1, you may choose to learn a new spell, or upgrade a spell you have learned.\n\n> All spells have a 2 night cooldown.\n\n> With the Necronomicon, your base spells have no cooldown, you learn the upgraded version of all base spells, and can learn upper spells, which each have a 1 night cooldown and cannot be upgraded. Gain detection immunity. You gain the Necronomicon last."},{"name":"List of base spells:","value":"> Fireball: Deal a basic attack.\n> Upgraded Fireball: Deal a powerful attack."},{"name":"> Freeze:","value":"Roleblock your target.\n> Upgraded Freeze: Roleblock 2 targets tonight and the following night."},{"name":"> Static:","value":"Charge 2 players. If a charged player visits another charged player, both are dealt a basic attack and lose their charge. This has no cooldown, and players do not know they are charged.\n> Upgraded Lightning: Charge 4 players."},{"name":"> Whirlwind:","value":"Players visiting your target unknowingly visit themselves instead. This cannot target coven members.\n> Upgraded Whirlwind: Target 2 players, 1 may be coven."},{"name":"> Natural Protection:","value":"Give yourself and another player basic defense. Any player protected by you will be told they were attacked and protected.\n> Upgraded Natural Protection: Give powerful defense instead, and attack 1 visitor."},{"name":"List of upper spells:","value":"> Meteor: Deal a powerful attack to 2 players."},{"name":"> Blizzard:","value":"Roleblock all non-coven players. Roleblocks through immunity. Gain roleblock immunity the night you use this."},{"name":"> Lightning:","value":"Deal a powerful attack to a target and all their non-coven visitors and any non-coven player they visit that night."},{"name":"> Tornado:","value":"Redirect all abilities to random non-coven members. Gain roleblock immunity while using this."},{"name":"> Earthquake:","value":"Deal a basic attack to 3 targets."}],"meta":{},"desc":"Post 1001\n*Blizzard + Tornado = Chaos*","id":2259,"locked":false}