{"aliases":["2022","3398","recap_of_gim_2022","recapofgim2022","recap","gim","rog2","rg2"],"author":"765276088183029810","title":"Recap of GIM 2022","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral ","subalignment":"Chaos","unique":"False","attack":"Varies","defense":"Basic"},"fields":[{"name":"Abilities:","value":"> Start a subgame the next day in which dead players are not players. This can only be done on N3, N6, etc.\n> Kill as many players as you have charges. All of the kills must neighbor each other, and dead people count as neighbors for this ability.\n> Choose 2 players. If the first player is a town member, deal an Overkill attack to them to deal an Unstoppable attack to the second. If your first target was the Town Power, both kills are Overkill and you can't be killed tonight.\n> Split the game in half, with both sides having an equal amount of players. This counts both living and dead players. 1 use.\n> Choose 2 players. Roleblock them and all their visitors, then deal a basic attack to everyone you roleblocked.\n> Give someone a new attribute.\n> Choose someone during the day to learn one of their abilities. You may use that ability tonight. 1 use.\n> Roleblock up to three players, then coldsnap. 1 use. Only usable starting N3"},{"name":"Abilities (cont.):","value":"> During the day, authorize 1/3 of living players. Only those players can be targeted tonight. 1 use.\n> During the night, choose 2 players. They will be forced into a game of Guess Who tomorrow (2547 for details).\n> If only 4 players remain, you may convert someone into a Locust (Post 40).\nAttributes:\n> The first person to refer to your role as anything other than \"Recap of GIM 2022\" is banned.\n> At the start of the game, gain the attributes and abilities of a random negative numbered \"I Hate Game X\" role.\n> You may use 2 abilities per night, but only one can kill.\n> Losers of the subgame are all dealt a basic attack.\n> Each night, gain a charge for your second ability.\n> Once half the players are dead, gain 3 random town roles from different subalignments.\nWin Con:\n> Live to the end of the game to trap everyone in GIM forever **or** send 1/3 of the players to hell by killing them."}],"meta":{},"desc":"Post 3398\n*\"GIM is good\" mfs when Recap of GIM 2022 spawns*","id":2471,"locked":false}