{"aliases":["3364","violet_beauregarde","violetbeauregarde","violet","beauregarde","vb"],"author":"201033418853580800","title":"Violet Beauregarde","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaotic","unique":"True","attack":"None","defense":"Trust Fund"},"fields":[{"name":"Abilities:","value":"- Steal all the abilities from another player each night, removing them from play indefinitely.  Each ability stolen is liquidated into $1,000,000,000 per ability, which is then put into your trust fund."},{"name":"Attributes:","value":"- Your targets will be able to perform their desired action on the night you steal their abilities.  Additionally, they will be informed that Violet Beauregarde stole their abilities\n- Your trust fund starts out with a balance of $5,000,000,000.\n- Each time you are attacked, subtract money from your trust fund based on the corresponding attack tier (Basic attack reduces trust fund by $1,000,000,000, Unstoppable by $3,000,000,000, etc.  If any attack falls outside of this system, reduce by $2,000,000,000).\n- Attempted roleblocks, redirects, controls or conversions will reduce your trust fund by $500,000,000."},{"name":"Abilities (cont.):","value":"- If an attack/ability used on you causes your trust fund to go into the negative, any funds earned from that night's steal will automatically bring your trust fund balance to $0 and will make you completely vulnerable the following night.  Earnings from the next night's steal will only be added if you survive that night.\n- Being lynched during the day phase will automatically bring your trust fund balance to negative $1, triggering the vulnerability period; any other day phase attacks fall under the aforementioned deduction policy.\n- If you die, all stolen abilities are returned to the affected players."},{"name":"Goal:","value":"Survive till the end, steal the abilities of every living player, or have a trust fund balance of at least $15,000,000,000 at a given time."}],"meta":{},"desc":"Post 3364","id":2494,"locked":false}