{"aliases":["3315","a_role_with_really_weird_and_complex_mechanics_that_serve_no_other_purpose_other_than_to_make_it_complex","arolewithreallyweirdandcomplexmechanicsthatservenootherpurposeotherthantomakeitcomplex","role","really","weird","complex","mechanics","serve","other","purpose","than","make","arwrwacmtsnopottmic","rrwcmsopotmc"],"author":"655633028516937729","title":"A Role With Really Weird And Complex Mechanics That Serve No Other Purpose Other Than To Make It Complex","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Variable","defense":"None"},"fields":[{"name":"Abilities:","value":"-Use one of the three abilities you have at your disposal"},{"name":"Attributes:","value":"-At the start of the game, role 3 roles from the same subalignment. You have these role’s abilities and any immunities they may have\n-If you gain the abilities of killing roles, you only get 2 charges of each ability\n-If you get the abilities of protective roles, they will all grant Invincible defense to your target and Vulnerable defense to their visitors\n-If you get the abilities of investigative roles, every Xth person you check will return false feedback, where X is a random number that ranges from 2-10 chosen by the host. You don’t learn this number\n-If you get the abilities of a support role, then you learn the role of one other member in that faction if it exists when using an ability\n-If you get the abilities of a Head/Power role, then you will be able to use your ability three times"},{"name":"Abilities (cont.):","value":"-If you get abilities from another subalignment, then cause one other player in the game to be converted to a random faction that already exists on night 6. This will not affect conversion-immune players or members of an REF\n-Every time this role wins, I (Spaggyt3) will specify one more subalignment’s effects until there are no more subalignments to give specific effects to\n-This role may be rerolled for free if you find it too confusing\n-The first person to call this role bad is roleblocked through immunities on the first night of the next game they play. This attribute only has a 10% chance of working if this role doesn’t additionally spawn, otherwise it’s guaranteed"},{"name":"Goal:","value":"Cause the death of 3 players from the same subalignment of your ability without dying. This may be through getting them hanged or killing them yourself"}],"meta":{},"desc":"Post 3315\n_This is probably really unbalanced or unfair_","id":2525,"locked":false}