{"aliases":["400","1989","400%_speedrun","400%speedrun","400%","speedrun","1989a"],"author":"298205270201597955","title":"400% SPEEDRUN (First)","params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Variable","defense":"Variable"},"fields":[{"name":"Abilities (first):","value":"- Learn 5 random roles that a player could be at night. Only one will be the ones they actually appear to be. You’ll gain the same results if you investigate them again and their appearance hasn’t changed, and if they’re evil, they will be notified.\n- Learn who a player is visited by at night.\n- Check if a player appears to be suspicious at night. Roles that win with any good faction, and roles that have Detection Immunity, don’t appear as suspicious to you.\n- Discover what feedback a player gets at night.\n- Learn who a player visits at night.\n- During the day, choose a player to Jail. You may open a chat with them, were you will appear as the “Jailor (51)”\n- At night, decide to execute who you’ve jailed with an unstoppable attack. You will lose this ability if you use it on a good faction member. Victims of this will appear to have been executing by the “Jailor (51)”."},{"name":"Abiltiies (first, Cont.):","value":"- Decide to go on alert, granting yourself basic defense and powerful attacking everyone who visits you. Victims that die to this will appear to be killed by the “Veteran (66)” (3 uses)\n- Shoot someone at night with a basic attack. Victims of this will appear to be killed by a “Vigilante (67)” You will die to an unstoppable attack if you shoot a good faction member, which reveals the true role and cause of death.\n- Protect a player from direct attacks at night. You’ll redirect the attack to yourself, and retaliate with a powerful attack.\n- Put on a bulletproof vest at night to grant yourself basic defense. (1 use)\n- Heal a player at night, granting them powerful defense and purging negative effects. You’ll know if they were attacked by anything. You may only target yourself with this once.\n- Protect a player at night with powerful defense. You will deal a basic attack to a random attacker, unless they’re capable of conversion."},{"name":"Abilities (first, Moar):","value":"- Set a trap at a target’s house at night. They’ll gain one-use powerful defense, which will retaliate against the attacker with a powerful attack. You’ll learn the names of all roles that visit the trapped target in the night where it’s triggered. You may only have one trap out at a time, but you may target yourself with this ability to manually remove the trap.\n- Roleblock a player at night.\n- Reveal yourself as the “Mayor (52)” in the day, permanently tripling your voting power after doing so, but preventing yourself from being healed, sending whispers, or receiving whispers.\n- After dying, you may send an anonymous message to a single person at night. If they win, it will count as a victory that will let you restart the game and move on to your Second form.\n- You may choose a dead Good player. You’ll make them use their ability on a different target, learning their role in the process. You can’t use this on a dead person more than once in a game."},{"name":"Abiltiies (first, Last):","value":"- Choose two targets at night. Players visiting the first target will unknowingly be redirected to the second, and vice version. Your targets will know they were transported."},{"name":"Attributes (first):","value":"- Detection Immunity; You will appear as a Town Killing role, though players can still learn you’re the 400% SPEEDRUN by checking your role directly.\n- On odd nights you will have a vision of three players, at least one will be Evil.\n- On even nights you will have a vision of two players, at least one will be Good.\n- Each night, you will learn the names of all players visited by members of Evil factions.\n- If a conversion-capable role visits you, you will automatically retaliate with a basic attack. You will also have basic defense against them.\n- Roleblock Immunity\n- You are able to talk to the dead each night, appearing as the “Medium (60)” when you do.\n- Control Immunity"},{"name":"Attributes (global):","value":"- You start the game in your First form. In addition to these attributes, you will have the attributes and abilities marked as First.\n- You must complete your First Goal. Once you do, the game will restart, with all players retaining the roles they started the game with, but you will move on to your Second form.\n- Completing the game in your Second form will restart it with your Third form, then your Fourth form, then finally you’ll win the game.\n- The game will not restart if you fail to complete your current goal.\n- You won’t be allowed to join factional chats in any form.\n- You can’t target yourself with any abilities except for those that specifically say they can.\n- You may multitask.\n- ALL deaths are cleaned until you reach your Fourth form.\n- Conversion Immunity"},{"name":"Goal:","value":"First: Live to hang every criminal and evildoer."}],"meta":{},"desc":"Post 1989A","id":258}