{"aliases":["400","1989","400%_speedrun","400%speedrun","400%","speedrun","1989c"],"author":"298205270201597955","title":"400% SPEEDRUN (Third)","params":{"faction":"Neutral","subalignment":"Killing","unique":"True","attack":"Variable","defense":"Variable"},"fields":[{"name":"Abilities (third):","value":"- Choose two players. The first one will be controlled into targeting the second, if possible. You will learn the role of the controlled target. You will also hit the first player with a basic attack if this is Night 3 or later, and if they die, players will think the “Coven Leader (28)” killed them.\n- Hex a target each night, making them appear as a “Hex Master (83)” to investigators. If all living non-Coven players other than you are Hexed, they will all die to a unstoppable attacks.\n- Choose to deal a Powerful attack to all visitors. They will be stoned rather than cleaned upon dying. (3 uses)\n- Reanimate a dead player, and make them use their ability on another. You can’t reanimate the same person a second time.\n- Poison a player at night. They will die after a day if they have no defense when poisoned, or if they aren’t healed in time.\n- Choose one: Heal a player, learn a player’s role, or basic attack a player. Each option has a three-day cooldown."},{"name":"Attributes (third):","value":"- Detection Immunity and Basic Defense after Night 3.\n- Roleblock Immunity\n- Control Immunity"},{"name":"Attributes (global):","value":"- You start the game in your First form. In addition to these attributes, you will have the attributes and abilities marked as First.\n- You must complete your First Goal. Once you do, the game will restart, with all players retaining the roles they started the game with, but you will move on to your Second form.\n- Completing the game in your Second form will restart it with your Third form, then your Fourth form, then finally you’ll win the game.\n- The game will not restart if you fail to complete your current goal.\n- You won’t be allowed to join factional chats in any form.\n- You can’t target yourself with any abilities except for those that specifically say they can.\n- You may multitask.\n- ALL deaths are cleaned until you reach your Fourth form.\n- Conversion Immunity"},{"name":"Goal:","value":"Third: Live to kill all who would oppose the Coven."}],"meta":{"cannot_spawn":"true"},"desc":"Post 1989C","id":260}