{"aliases":["2573","chief_executive","chiefexecutive","chief","executive","ce"],"author":"189932350791090176","title":"Chief Executive","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Power","unique":"False","attack":"Unstoppable","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Create a cabinet of five other players on Day/Night 1.\n- Replace a cabinet member with another player or appoint a new member in the event of a death in the cabinet.\n- Declare a state of emergency with respect to three other players. (1 use)\n- Declare war with three other players. (1 use)\n- Issue a pardon to the current player with the most votes."},{"name":"Attributes:","value":"- The five players you choose as your cabinet members will be put into a private chat with you named #the-cabinet. This happens as soon as you confirm your selection. You must also make a line of succession for a vice president. The current vice president gains permanent Basic defense. You may not declare a state of emergency or war without a cabinet. Once you have made your cabinet, it will be announced to the Town that the Chief Executive's term has begun along with the identity of the Chief Executive and vice president. If you die, your cabinet will be immediately disbanded. If you have not made a cabinet by Day 2, you will be impeached."},{"name":"Attributes (cont.):","value":"- When declaring a state of emergency or war, you must state your intentions in #the-cabinet. The alive cabinet members must vote on whether they would like to go through with or reject your declaration. You may override their vote and go through with your declaration immediately, but you may only do this once. If most of the remaining cabinet members confirm your declaration, it will be successful and go through immediately. In the event of a tie, your vice president's vote will be the deciding factor. You may make a declaration at any time, but only if you have a remaining use.\n- To replace a cabinet member you need the absolute majority of the cabinet members to confirm the replacement. If a cabinet member dies, you may appoint a new player to fill their position, but this requires the majority vote of the current cabinet members."},{"name":"Attributes (moar.):","value":"- A successful state of emergency will give your three targets Unstoppable defense for the next two nights. A successful war declaration will immediately deal an Unstoppable Astral attack to all three players. If you kill a Town member with your war declaration, you will immediately be impeached.\n- At any point, the cabinet members may choose to hold an impeachment vote. If there is a unanimous consent among the cabinet members, you will be impeached.\n- Pardoning a player will rescind all votes made against them and make them immune to lynching for the current day. You may not pardon yourself. **This does not require approval from the cabinet.**\n- Impeachment is the equivalent of a Modkill-level attack."}],"meta":{},"desc":"Post 2573\n*My approval rates are down? When are they NOT?*","id":2722,"locked":false}