{"aliases":["3182","overheat"],"author":"724246648372330556","title":"Overheat","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Basic (Overkill)","defense":"None (Basic)"},"fields":[{"name":"Attributes:","value":"- You receive a target at the start of the game. You love them <3. Your target must be part of a non-Neutral faction.\n- If your target dies before you love them six times, you'll die and lose the game.\n- Upon loving your target a fourth time, you'll die if you go a night without loving your target."},{"name":"Abilities:","value":"- Love your target <3. This will have a different effect depending on how many times you've used this ability before.\n> ~ The first time you use this, you'll spend some time getting to know them! You learn their role through frames and protect them with Basic defense for the night.\n> _ _\n> ~ The second time you use this, you'll finally work up the courage to talk to them >///<. They will learn they're the target of an Overheat and you'll protect them with Powerful defense for the night.\n> _ _\n> ~ The third time you use this, you'll start dating!! You'll roleblock your target, gaining roleblock and prevention immunity yourself, and protect them with Unstoppable defense for the night.\n> _ _\n> **~** The fourth time you use this, you'll only want them to look at *you* u_u. You'll deliver a Basic poison to all their visitors and protect them with Overprotective defense for the night. They will no longer be able to whisper.\n> _ _"},{"name":"Abilities (cont.):","value":"> **~** The fifth time you use this, you'll never want them to let you go. You'll permanently prevent all who attempt to visit them besides you and prevent them from visiting. You'll also protect them with Overoveroveroveroverprotective defense.\n> _ _\n> - The sixth time you use this, you'll protect your target with an Overkill attack and your goal will be changed to \"Live to see your target's faction lose the game before the end of the next day.\".\n- Overheat during the day, allowing you to use your ability twice tonight. (1 use)"},{"name":"Goal:","value":"Live to see your target survive until the end of the game. <3"}],"meta":{},"desc":"Post 3182\n*It’s just because I still get worried, please forgive me!*","id":2941,"locked":false}