{"aliases":["326","sheep"],"author":"536648090183270441","title":"Sheep","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"None","defense":"None (Basic)"},"fields":[{"name":"Source:","value":"https://docs.google.com/document/d/1eCUQ1LsNyM0rxjFTrlWgRY6Y4QYRI7Xab1mu0Vl_kzs/edit?usp=drivesdk"},{"name":"Abilities:","value":"-Help someone sleep every night by counting sheeps"},{"name":"Attributes:","value":"-You have a total count of sheeps that starts at 0\n-Town roles add 60 sheeps\n-Mafia roles remove 20 sheeps\n-Coven roles remove 40 sheeps\n-Neutral Benign roles add 10 sheeps\n-Neutral Evil roles remove 10 sheeps\n-Other roles add 20 sheeps\n-Helping someone sleep redirects them to yourself. They will know they were redirected to a Sheep.\n-Helping someone a 2nd time will send them to the Dream World. They cant talk, vote, whisper, use their night/day abilities, nor can they be talked to, voted to and whispered to. They may also not be selected for night/day abilities.\n-If you send someone in the Dream World, you will also send yourself. All that applies to the sent player also applies to you so you cant talk, vote, etc.\n-A private channel which only you and a person in the Dream World can see Is opened (#dreamworld). Only the host may type in dreamworld."},{"name":"Attributes (cont.):","value":"-The playerlist (!! Playerlist, NOT rolelist) Is given to both players in #dreamworld. Then you and the other player take turns choosing one player. The sheep starts first, then the sent player.\n-The host will check the faction of the picked players. Neutral > Mafia > Town > Coven. Other factions are automatically assumed to be Mafia. Whichever picked player Is higher in the priority list given above wins, and the one that picked the winning player gains 1 Dream Point, alongside both picked players getting eliminated from the playerlist and not being able to be picked again. Neither of you will know which faction the picked players are, but you will know who gains a Dream Point.\n-If you both pick the same player, lose 1 Dream Point. If you both pick the same faction, neither gains or loses a point."},{"name":"Attributes (moar.):","value":"-This goes on until all the players in the playerlist are eliminated and the one with most Dream Points wins. If the Sheep wins, the other player Is dealt an Unstoppable Attack (that does not count as an Attack dealt by the Sheep) and the Sheep can decide to add 10, 20 or 30 sheeps or remove 10, 20 or 30 sheeps. If the other player wins, the Sheep cannot target that player anymore, and you cannot use your ability the next night.\n-You have Basic Defense that breaks at the first hit."},{"name":"Goal:","value":"You have a random number of sheep rnged between 1-200. Reach that number of sheeps before the game ends. Number must be a multiple of 10."}],"meta":{},"desc":"Post 326\n*Baa.*","id":2959,"locked":false}