{"aliases":["856","haha_suffer","hahasuffer","haha","suffer","hs"],"author":"536648090183270441","title":"Haha Suffer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos Except Written Differently","unique":"False","attack":"None (Except Written Differently)","defense":"Basic (Except Written Differently)"},"fields":[{"name":"Abilities:","value":"-Pick A Player That Is In The Game (He Must Be In The Game And Must Be Alive)\n-Once Per Game, You Can Write A Post That Goes Exactly To The Character Limit. You Make A Role Based On That Post. With The Host Approval's, You Become That Role. However The Goal Will Be The Same As This Role\n-Once Per Game, Choose A Topic. Everyone Must Make An Essay On That Topic That Goes To Exactly The Character Limit. You Then Rate Everyone's Essays. If They Get A Rating Of 5 Or Lower, They Are Modkilled. However, You Must Be Fair In Your Ratings. If The Host Feels Like You Are Not Being Fair, You Are Instantly Modkilled"},{"name":"Attributes:","value":"-They Will Have To Write A Discord Message That Goes To Exactly The Discord Character Limit (No More No Less) (Otherwise They Will Be Modkilled)\n-Then, Based On That Post, You Make A Role. With The Host's Approval, They Will Become That Role.\n-You Gain A Chat With All That You Converted (You Can Talk In The Chat) (The Converted Can Talk In The Chat)\n-You Have Roleblock Immunity (Roleblocking Does Not Affect You)\n-You Have Control Immunity (Controlling Does Not Affect You)\n-You Have Conversion Immunity (Conversion Does Not Affect You)\n-You Have Redirect Immunity\n(Redirection Does Not Affect You)\n-You Have None Attack\n(That Means That You Cannot Attack)\n-You Have Basic Defense\n(That Means That You Will Not Die to Basic Or Lower Attack)\n-Anyone That Attacks You Has To Write A Post About How You Died That Goes To The Discord Character Limit\n-Anyone That Rolls This Role Gains One Free Reroll\n-Everyone Will Hate Accent For This Role However It Is Pretty Funny Not Gonna Lie"},{"name":"Attributes (cont.):","value":"-One Of Every Pokémon Wins Against The Lions Every Time Due To Even If You Went By In Game Mechanics There Is This Set Called Funbro That Never Runs Out Of PP"},{"name":"Goal:","value":"See At Least Two Converted Players Win"}],"meta":{},"desc":"Post 856\n*AAAAAAAAAAAAAAAA*","id":2965,"locked":false}