{"aliases":["2538","red_riding_hood","redridinghood","red","riding","hood","rrh"],"author":"536648090183270441","title":"Red Riding Hood","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"-Walk into the big, scary woods, as you need to give a little gift to your grandma from your mother. Watch out for the wolf :D!\n-Eat the meat in your picnic basket that smells kinda weird.\n-Take the shortcut to your grandma's house! You certainly dont want to be late. Cannot be used in the nights your defense was lowered due to walking in the woods."},{"name":"Attributes:","value":"-The woods are big, vast and the silence just eats away at your soul. The night you walk in and the night after, your defense will be lowered to Fragile. The third night, you will exit the woods.\n-You've been walking for so long, every step you take makes you feel like you're getting further and further away from safety, and your stomach begins to rumble-- your tummy feels like its going to digest itself. The meat in your basket feels and smells really weirdly, and the appearence looks oddly similiar to that of a human hand, but-- you simply couldn't resist-- eating the meat in your basket will raise your defense to Powerful for the night.\n-Did you hear someone step on a branch? Eh, it's probably nothing. If you take the shortcut, your defense will be lowered to Fragile for tonight.\n-The night after you exit the woods, you will meet your grandma! Look at her, isn't she so sweet? With her...sharp, pointy teeth? Her giant nails? All the grey hair on her face and arms...?"},{"name":"Attributes (cont.):","value":"-If you're lucky, you acted smart and took the shortcut, arriving to your grandma before the wolf could. Otherwise-- scream all you want, nobody will come to save you. You will be dealt an Overkill attack at the end of the night you meet your grandma, IF you didnt take the shortcut."},{"name":"Goal:","value":"Successfully arrive to your grandma's house and then return home."}],"meta":{},"desc":"Post 2538\n*This is the story of a young girl called Red Riding Hood...*","id":2972,"locked":false}