{"aliases":["214","animal_breeder","animalbreeder","animal","breeder","ab"],"author":"536648090183270441","title":"Animal Breeder","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Pale Moon","subalignment":"Killing","unique":"False","attack":"Basic (Powerful) (Unstoppable)","defense":"None"},"fields":[{"name":"Abilities:","value":"-Send your dog to attack someone.\n-Send your tiger to attack someone.\n-Send your wolf to attack someone.\n-Feed one of your animals."},{"name":"Attributes:","value":"-Your Dog will deal a Basic Astral attack to your target.\n-Your Tiger will deal a Powerful Astral attack to your target and a random visitor.\n-Your Wolf will deal a Powerful Astral attack and will bleed your target if they survive.\n-After they attack one night, they must be fed to attack again.\n-Your Dog doesnt need to be fed and can attack at any time. However you may decide to feed It to upgrade its attack from Basic to Powerful.\n-Your Tiger and Wolf need to be fed 1 portion each before they can attack again.\n-Feeding takes 1 night.\n-Once the PMCS begins, your animals dont need feeding and they may instantly attack. Additionally, their attack values are upped to Unstoppable."},{"name":"Messages:","value":"\"You have decided to send your dog to bite someone tonight.\"\n\"You have decided to send your cat to slash someone tonight.\"\n\"You have decided to send your wolf to maul someone tonight.\"\n\"Your cat/wolf Is too tired to fight, you must feed It.\"\n\"You have decided to stay home and feed your cat/wolf tonight.\"\n\"You have decided to stay home and feed your dog to strengthen It tonight.\"\n\"You were bitten by the Animal Breeder's dog!\"\n\"You were slashed by the Animal Breeder's cat!\"\n\"You were mauled by the Animal Breeder's wolf!\"\n\"... they were bitten by the Animal Breeder's dog.\"\n\"...they were slashed by the Animal Breeder's cat.\"\n\"...they were mauled by the Animal Breeder's wolf.\"\n\"The Pale Moon Circus Show has begun! No time for lunch, more time for mauling!\""}],"meta":{},"desc":"Post 214\n*The spectators LOVE my performance! I'm not sure you will, though.*","id":3172,"locked":false}