{"aliases":["208","hoop_specialist","hoopspecialist","hoop","specialist","hs"],"author":"536648090183270441","title":"Hoop Specialist","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Pale Moon","subalignment":"Support","unique":"False","attack":"None (Basic)","defense":"None"},"fields":[{"name":"Abilities:","value":"-Place an Inverting Hoop at a player's house.\n-Place two Transporting Hoops at two player's houses.\n-Move an Hoop."},{"name":"Attributes:","value":"-Placing an Inverting Hoop at a player's house inverts all their values. If they're granted Powerful Defense they will be dealt a Powerful Attack, and If they're dealt a Powerful Attack they will be granted Powerful Defense, etc.\n-You may have 2 Inverting Hoops and up to 2 transporting hoops at all time.\n-Transporting Hoop A redirects all visitors of the hooped target to B. B redirects to A.\n-When the PMCS starts, you may place 2 more hoops at any player's house. You choose the type of hoops. Then, all targets with an Hoop on them are dealt an Astral Unstoppable Attack that Is unaffected by the Inverting Hoop.\n-Your Transporting Hoops dont affect the Clown."},{"name":"Messages:","value":"\"You have decided to place an Inverting Hoop at your target's house tonight.\"\n\"You have decided to place two Transporting Hoops at your targets' houses tonight.\"\n\"You have decided to move an/a Inverting/Transporting Hoop tonight.\"\n\"You placed an Inverting Hoop.\"\n\"You placed two Transporting Hoops.\"\n\"You were stuck in a Magical Hoop and suffocated to death!\"\n\"...they were killed by the Hoop Specialist's Hoops.\"\n\"The Pale Moon Circus Show has begun! Time for some hula hoops!\""},{"name":"SIDE NOTE:","value":"When an Inverting Hoop kills someone, the cause of death will be the role that granted the protection. For example, if Doctor healed a target that was targetted by an Inverting Hoop, It would say \"...they were killed by the Doctor.\""}],"meta":{},"desc":"Post 208\n*Slow movements! Hula Hoop!*","id":3173,"locked":false}