{"aliases":["2045","get_pwned_zage","getpwnedzage","get","pwned","zage","gpz"],"author":"189932350791090176","title":"Get Pwned Zage","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Attributes:","value":"- When this role is rolled, the entire game is converted to a Throne of Lies match.\n- The Good faction is converted to Blue Dragon and the Evil faction will become one of Unseen or Cult (any other Evil factions are removed).\n- The player in slot 1 will be rerolled into either Good King (2028 - faction is Blue Dragon), Evil King (2030 - will be the same faction as the Evil faction), or Neutral King (2031). The King's subalignment will be Special as opposed to whatever's listed in the role card."},{"name":"Attributes (cont.):","value":"- For the Blue Dragon, all players who spawned as the Good faction will be rerolled into a Blue Dragon role (the alignments in the role cards should be treated as Blue Dragon as opposed to Town). One leader-type role is rerolled into Prince (1801 - gains conversion immunity) and any other ones are rerolled into a random Blue Dragon role that isn't King or Prince. Investigative roles will be rerolled into either Maid (1796), Observer (1799), Princess (1802), Paladin (2047), or Sheriff (2046). At least one Paladin or Sheriff must spawn depending on the Evil faction. Any Support roles will be rerolled into either Butler (1792), Court Wizard (2048), Drunk (1793), Mystic (1797), or Noble (1798 - is now Blue Dragon Support). Killing roles will be rerolled into either Hunter (1794) or Knight (1795). Protective roles will be rerolled into either Chronomancer (424) or Physician (1800)"},{"name":"Attributes (moar.):","value":"- If the Evil faction rolls Unseen, spawn a Mastermind (988) and Assassin (989). If the Evil faction rolls Cult, spawn a Cult Leader (959) and Acolyte (960).\n- All Neutral Killing roles are converted into either Reaper (1787), Possessor (1788), or Sorcerer (1789). All Neutral Benign roles are converted into either Mercenary (471) or Alchemist (1791). All Neutral Evil roles are converted into either Fool (2051) or Sellsword (1790). All Neutral Chaos roles are converted into either Inquisitor (2053) or Scorned (2052).\n- If the King dies, there will be an election for a new King the following day. The first three hours of the following day will be dedicated to players choosing to nominate themselves to become the new King. The following three hours will be dedicated to a vote between the nominated players to become King. The player with the most votes becomes the new King. The new King will keep the alignment of their previous faction except for Neutral Killer roles which become Psycho King (2032)."},{"name":"Attributes (stop.):","value":"- Reroll this slot into a random Throne of Lies Neutral role."},{"name":"Goal:","value":"Have the game become Throne of Lies, and pwn Zage."}],"meta":{},"desc":"Post 2045","id":3416,"locked":false}