{"aliases":["1832","wm_godfather","wmgodfather","wm","godfather","wg"],"author":"189932350791090176","title":"WM Godfather","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Mafia","subalignment":"Head","unique":"True","attack":"Basic","defense":"Basic"},"fields":[{"name":"Source:","value":"https://wikimafia.fandom.com/wiki/Godfather"},{"name":"Abilities:","value":"\n\n- Prepare a speech during the day."},{"name":"- If there isn't a Mafia Killing role in the game:","value":"Order your goon to perform the factional Mafia kill each night."},{"name":"Speech Attributes:","value":"\n\n- When you prepare a speech, you will inspire your fellow Mafia, including yourself (and your goon), the following night.\n\n- Being inspired gives all Mafia members temporary roleblock and control immunity, and their visit during the night will be Astral.\n\n- When the Mafia are inspired, members may use the ability of a dead Mafia member instead of their own. However, they cannot use the abilities of Mafia Killing roles.\n\n- You cannot prepare a speech two days in a row.\n\n- You may only prepare a speech three times."},{"name":"Goon Attributes:","value":"\n\n- When you order your goon to perform the factional Mafia kill, you will not visit the target. You will appear to stay home to a Tracker.\n\n- Your goon can be killed as a result of visiting your target. If they are, you will no longer be able to order them to perform the factional Mafia kill.\n\n- If a Lookout or Trapper sees your goon visit their target, they will see that \"The Godfather's Goon\" visited their target.\n\n- Your goon will be seen as a malicious visitor to a Spy.\n\n- If your goon is performing the factional Mafia kill, you will not appear to have blood to a Detective.\n\n- If your goon is attacked by a Bodyguard, the Bodyguard will survive, but your goon will not. The Bodyguard will be notified that they killed your goon.\n\n- When your goon dies, it will be announced to the town that your goon has died."}],"meta":{},"desc":"Post 1832\nDetection immunity","id":3446,"locked":false}