{"aliases":["1274","eevee"],"author":"650477420922535946","title":"Eevee","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"Run Away! (Day, 1 use): Select a player during the day, see which evolution you would become upon evolving should you visit them.\nAdaptability! (Night, 1 use): Become a evolution of your choice by visiting a player, which could be Espeon, Flareon, Umbreon, Jolteon, Sylveon, Vaporeon, Glaceon, or Leafeon, or Shiny Eevee."},{"name":"Umbreon:","value":"Wins with the Umbrae, the blood moon is permanently out while the Umbreon lives, the Umbreon will become the Umbra (Assault) once the current UA dies.\nLeafeon: Wins with the Plants and Florae, adds 2 sun per night for each night the Leafeon lives.\nFlareon: Wins with the Underworld, may perform an extra douse on top of the factional one.\nEspeon: Wins with the Coven, may cause the Necronomicon to be inherited by two members of the Coven while alive, when the Sylveon dies, the first coven member to die will not give another the necronomicon.\nGlaceon: Wins with the Everfrost, may roleblock a player each night, will die in Eyisa's place should Eyisa ever have the ability to die.\nSylveon: Wins with the Pale Moon Circus, secretly shortens the amount of time until the Circus by one day while living, no longer has an effect after the Circus has begun.\nVaporeon: Wins with the Warfleet, may upgrade one member of the Warfleet each night."},{"name":"Umbreon (cont.):","value":"Jolteon: Wins with the Thundercry, may strike one player each night, if all living players are striked, the Thundercry win the game.\nShiny Eevee: wins with any faction not listed above, but only that faction selected, allows an additional factional kill by it's hands. If there is no factional kill, create one for this game.\n(Ex: the Fallen Angels would now have a factional kill that only Shiny Eevee could perform)"},{"name":"Goal:","value":"Pokemon (as Eevee) / Faction Goal (As Evolution)"}],"meta":{},"desc":"Post 1274","id":3823,"locked":false}