{"aliases":["2733","ka_illusionist","kaillusionist","ka","illusionist","ki"],"author":"780421461545713676","title":"KA Illusionist","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Minor Illusion (1-shot): Give someone a notification of your choice during the night. Gain another use on every full moon night.\n- Retcon Illusion (1-shot): Retcon the current and previous day and night phase into nonexistence. Anything that happened during the previous day and night will be reversed and then the next phase begins. This ability resolves at the end of which phase it's used in. Used at night *or* day.\n- Illusion of Death (2-shot): Cause someone to think they're dead. They will appear as cleaned with an unknown cause of death. They will not be allowed to communicate or vote and they won't count to the majority. They will also gain access to the day chat. If they try to use an ability for some reason, or if someone tries to use an ability on them, it will succeed like normally. This effect will wear off after one day."},{"name":"Attributes:","value":"- Confusion (Passive): Whenever an ability/attribute says your name, for example Lookout or Deogen sees [Player] visited your target, it will just show up as \"someone\". So...\n> \"*Del, someone and Jane visited Mac last night.*\"\nAlso, whenever an ability/attribute says your role, it will just show up as \"something\".\n> *\"Mac's role is either Magic Meta Man, Caretaker, Eyisa, something or 9mm Kiwi.\"*\nWhen you die, you will appear as a random role."},{"name":"Goal:","value":"Ensure that a faction that has at least 50% of their members alive wins. You will automatically win if a role with a NK goal or similar wins."}],"meta":{},"desc":"Post 2733\n*hrrmgmg yes i will use my passives and rolesets and scumreading and investigative cards and claimlists and channels to strategically determine that there is like a 70% chance rasen is evil hrmrmgn yes*","id":3886,"locked":false}