{"aliases":["1687","soul_edge","souledge","soul","edge","se"],"author":"174251652524539904","title":"Soul Edge","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Overkill","defense":"Invincible"},"fields":[{"name":"Abilities:","value":"- At night, select a target for the player you are Equipped to to attack. If you both selected different targets, the attack will be directed toward one of them at random, and both you and the player you are Equipped to will be notified."},{"name":"Attributes:","value":"- If a player visits you while you are not Equipped to another player, you become Equipped to that player. They are notified as to who you are and the fact that you have become Equipped to them.\n- Players that you are Equipped to have their Attack value raised to Unstoppable, unless it is higher. This value cannot be lowered.\n- All visits toward you or a player that you are Equipped to will be directed toward both of you, if applicable.\n- Players that you are Equipped to are forced to attack another living player at night. They cannot use any other Night ability unless the role is capable of multitasking. They may choose who to attack, but if they do not choose, they will attack whoever you chose. If neither of you chose a target, their target will be chosen randomly amongst living players, excluding themselves and you.\n- You will absorb the soul of any player that is killed by the player you are Equipped to."},{"name":"Attributes (cont.):","value":"- If you have been Equipped to the same player for the 3rd night in a row, you will absorb their soul at the end of the night. This will deal an Overkill attack to them. You may not die on the night that this happens.\n- If the player that you are Equipped to dies, you become unequipped. If they die as a result of a visit, you will become Equipped to their visitor.\n- You may only be Equipped to one player at a time. If you would become Equipped to multiple players at the same time, the player you become Equipped to is chosen randomly.\n- Each time you are attacked, your Defense value is lowered by one stage.\n- If you are hanged, you will not die, but your role will be revealed. If you are not Equipped to another player at the time this happens, you become Equipped to the first player that voted against you during this day."},{"name":"Goal:","value":"Absorb 5 souls."}],"meta":{},"desc":"Post 1687\n*Those who grasp its hilt are unable to escape its curse, as its spirit invades the mind like a parasite and drives its wielder insane.*","id":3917,"locked":false}