{"aliases":["542","metal_crusher","metalcrusher","metal","crusher","mc"],"author":"780421461545713676","title":"Metal Crusher","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Evil","unique":"False","attack":"Basic","defense":"None (Basic)"},"fields":[{"name":"Abilities:","value":"- (Day) **Cooking Show**: Duel someone in a cooking show. During the night, you and the target will choose three ingredients, who are other players. When you have finished deciding, every player can vote for one of the dishes. They will know the ingredients but the votes are anonymous. Which dish gains the most votes will win, but the loser's dish will be discarded and those three targets will be roleblocked.\n- (Day) **Dance Battle**: Duel someone in a dance battle. During the night, you and the target will choose another player, who's a dance move. They will be controlled and target each other tonight."},{"name":"Abilities (cont.):","value":"- (Day) **Bombs Search**: Duel someone in a bombs search. You will basically play Battleship. During the night, you and the target will hide a bomb in another player's house. You and the target will alternate and visit a player and check for the bomb. If the enemy's bomb isn't there, you will roleblock your target. Then the cycle repeats, on the enemy's turn. Your enemy will use their ability on the target if they fail instead of just a roleblock. If you lose, nothing will happen but if you win, the loser and the player who they gave a bomb to will be attacked."},{"name":"Attributes:","value":"- All of your abilities are astral.\n- You cannot be affected by your abilities. For example, if you're given a Bomb by the enemy, you will not attack yourself if you win. And if you're chosen as an ingredient and your dish loses, you will not be roleblocked.\n- You have a suit of metal that allows you to survive two Basic attacks before it breaks."},{"name":"Goal:","value":"See the good faction lose the game."}],"meta":{},"desc":"Post 542\n*Hello beauties! It's your favourite host, Mettaton! There are some humans in the Town! Give a round of applause for their death!*","id":3965,"locked":false}