{"aliases":["2916","person_who_murders_three_or_more_persons,_with_the_murders_taking_place_over_more_than_a_month_and_including_a_significant_period_of_time_between_them","person_who_murders_three_or_more_persons_with_the_murders_taking_place_over_more_than_a_month_and_including_a_significant_period_of_time_between_them","personwhomurdersthreeormorepersons,withthemurderstakingplaceovermorethanamonthandincludingasignificantperiodoftimebetweenthem","personwhomurdersthreeormorepersonswiththemurderstakingplaceovermorethanamonthandincludingasignificantperiodoftimebetweenthem","person","who","murders","three","more","persons","taking","place","over","than","month","including","significant","period","time","between","them","persons,","pwmtompwtmtpomtamaiaspotbt","pwmtmpmtpomtmisptbt","sk","serial","serial_killer"],"author":"654448067969548338","title":"Person who murders three or more persons, with the murders taking place over more than a month and including a significant period of time between them","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Cause a penetration or rough contact with a sharp or pointed object at close range to your target, Stabbing differs from slashing or cutting in that the motion of the object used in a stabbing generally moves perpendicular to and directly into the victim's body, rather than being drawn across it."},{"name":"Atttributes:","value":"- If you are prevented from doing your night ability due to a roleblocking effect caused by another role, you will cause a penetration or rough contact with a sharp or pointed object at close range to the player who targeted you with the roleblocking effect in addition to your original target chosen at that night by you.\n- When you automatically commit a volitional act or omission that causes the death of the player who targeted you with the roleblocking effect, the night action that caused your night action to fail (commonly know as Roleblock) will not stop you from doing your designated action at night."},{"name":"Attributes (part 2):","value":"- Roles with the night ability of blocking night actions that designate you as their target will have their last will that is shown to the Town upon their death covered in body fluid in the circulatory system of humans and other vertebrates that delivers necessary substances such as nutrients and oxygen to the cells, and transports metabolic waste products away from those same cells, making it unable to be read, thus giving the town the following message:  **Their last will was covered in blood and is unreadable.**.\n- At night, you may choose to not commit homicide through the act of causing a penetration or rough contact with a sharp or pointed object to players who targeted you with a roleblocking effect at night, instead of applying all your other attributes to them."},{"name":"Goal:","value":"Ensure everyone that can stop the game (excluding you) from ending is dead."}],"meta":{},"desc":"Post 2916","id":400}