{"aliases":["1311","cryptid"],"author":"521123471460270121","title":"Cryptid","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Evil","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Attributes:","value":"- Each night, four of the following abilities are chosen at random, and you may use up to two:\n> - Add a new player to the game named \"Guy\" with a random role. You control them.\n> - Remove 25% of the words from a player's role's abilities and attributes at random.\n> - Give a player a \"game x winner\" role of your choice.\n> - Permanently swap two players' names.\n> - Ask a player to face reveal to you. If they don't, they're dealt a Powerful attack.\n> - Paripapparapappapparappa a player. (see 733)\n> - Delay a player's ability. It resolves six hours later.\n> - Bamboozle a player. (see 772)\n> - Reorder the host queue as you wish.\n> - Give yourself a Basic autovest in the next game whose host complies.\n> - Add a player to the end of your conga line. (see 630)\n> - Add a player to the end of your conga line. (see 1594)\n> - Give yourself twice the number of abilities to choose from the next night.\n> - Deal a None attack to a player.\n> - Use an ability from a Rasen role not in <#970046125065265202>."},{"name":"Attributes (cont.):","value":"> - Remove from then return a player to the game, resetting all statuses/etc.\n> - Disable all players' \"read message history\" permission for the next day chat. \n> - Make a player \"Solved 2 by 8\".\n> - Permanently frame a player as 529: WereLion to all investigative effects.\n> - Make a player immune to attacks that aren't the lowest tier needed to kill them tonight.\n> - Use an ability of a role you rerolled this game.\n> - Learn someone's role. This ability rampages and rampages again.\n> - Choose a player. Do everything that was done to them tonight in any previous game again.\n> - Use an ability of any other role with \"Viri\" in it anywhere.\n> - **Twin Drive** a player.\n> - Duel a player the next night. (see 869)\n> - Use an ability of any role in <#1027273158337761362> posted before the game that isn't in <#970046125065265202>.\n> - Give a player a <@&1030218223314014278>.\n> - Convert a player into the role whose number is their Discord tag, if there is one."},{"name":"Goal:","value":"See the Town lose."}],"meta":{},"desc":"Post 1311\n*Hey, I'm normal!*","id":4172,"locked":false}