{"aliases":["5198","jon_arbuckle","jonarbuckle","jon","arbuckle","ja","4998u"],"author":"654448067969548338","title":"Jon Arbuckle","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Unseen","subalignment":"Support","unique":"False","attack":"Basic","defense":"None"},"fields":[{"name":"Abilities:","value":"- Heat some lasagna for your target, giving them Overprotective defense and immunity to negative effects. (1 use)\n- Watch what's on the TV for a long time, learning 2 random notunseen roles in the game and 2 players that have it, but not which one has which specifically. (1 use)\n- Fix the clock that the pesky cat messed with, instantly adding another night phase right after this one, only deaths are announced between them. (1 use)\n- Kick a player, attacking them. You may also aim a player to kick them at, redirecting your kick victim to that player. (1 use)\n- Ask any non unseen player for some food in their fridge, leaning their attributes, you may copy one of them permanently. (1 use)\n- Invine another player's house during the day, they will reject you, they are unable to use a visiting ability the next night and are notified of it. (1 use)"},{"name":"Abilities (cont.):","value":"- During the day, have Odie deal with the rats? i think one was named Nermal? goofy ass name, but anyways, the rats apparently take care of all whispers, so whispering is disabled for the next day. (1 use)\n- Blame one bad thing that happened to a player on Garfield, if they are executed, choose one of your abilities or their abilities, you gain a copy of it with infinite ammo. Can be multitasked. (1 use)"},{"name":"Attributes:","value":"- If you visit or are visited by a dog role, you are forced to pet them, giving them Basic defense.\n- Wolves count as dogs they're just big fluffier dogs.\n- All of the latex roles also count as dogs jon loves furries.\n- You're roleblock immune on irl mondays good job on not being lazy jon. :D"},{"name":"Goal:","value":"Unseen goal."}],"meta":{},"desc":"Post 5198\n*Garfield. you fat cat. You are so big and fat. Why are you so fat. 🧍‍♂️*\n*Converted from Garfield (4998)*","id":4386,"locked":false}