{"aliases":["3473","mr_vigilante","mrvigilante","mr","vigilante","mv"],"author":"327918538419601409","title":"MR Vigilante","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Power","unique":"False","attack":"Variable","defense":"Modified Hellbent"},"fields":[{"name":"Abilities:","value":"-**Tried and True:** Deal a Basic attack to someone and roleblock them. If they are not Town, your next attack is Powerful. If they are Town, you are roleblocked the next night. (2 night cooldown)\n-**Protector of the Town:** Protect a target. The next time they are directly attacked, redirect the attack to yourself and deal a Powerful attack to the attacker. The redirected attack is one stage lower than it should be. (1 night cooldown)\n-**Combat Medic:** Heal a target. You grant them Unstoppable defense for this night and Basic defense for the next night. You may self target, which will additionally heal you for 2 damage previously taken. (3 night cooldown)\n-**Curse the Gods:** Curse a target. If they have defense above Basic, given by either temporary or permanent effects, deal an Unstoppable attack to them. (3 night cooldown)"},{"name":"Abilities (cont.):","value":"-**Elixir of Victory:** Deal a Basic attack to someone, give someone Unstoppable defense for the night, and reveal someone's exact role. You must use each on different targets. (3 night cooldown)"},{"name":"Attributes:","value":"- (Modified) Hellbent Defense: You cannot die. Instead, you have a Damage Zone. Each time you're attacked at night, depending on the attack tier, you'll take an amount of damage. Basic and below will deal 1 damage, Powerful will deal 2 damage, Unstoppable will deal 3 damage and Overkill+ and hanging will deal 4 damage. Once you've taken 4 damage, you will die. For technical purposes, this isn't an attribute, just an explanation. No, I didn't copy and paste *all* of this from Masochist because Masochist actually has 8 HP.\n-**Patience, Jackass, Patience:** If you do not perform your night ability, you may use two night abilities the next night and the Attack/Defense level is increased by one stage.\n-**Keeper of the Necronomicon:** If the Coven is in the game, you will receive the Necronomicon first. With the Necronomicon, you have a Coven goal instead of a Town goal."},{"name":"Goal:","value":"Kill all non-Town roles. If any non-Town roles that don't oppose the Town are alive at the end, the game will end and you will lose."}],"meta":{},"desc":"Post 3473\n*“My philosophy is that no one should belong to another. Obedience is necessary. But slavery is not.” -Vigilante to Ciacca, the Reclamation*","id":4421,"locked":false}