{"aliases":["3396","v1"],"author":"521123471460270121","title":"V1","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"ULTRAKILL","defense":"Hellbent"},"fields":[{"name":"Abilities:","value":"**Feedbacker Arm** — Deal a Basic attack to all of your visitors. You will parry any attackers of a tier lower than Unstoppable you attack this way, preventing the attack and dealing it back at them, but it rampages. \n**Knuckleblaster Arm** — Deal a Powerful attack to all your visitors. You will roleblock any attackers you attack this way. *(1 night cooldown)*\n**Whiplash Arm** — Move yourself directly below or above a player on the playerlist, or move them directly below or above you. You may also redirect them to you. \n**Piercer Revolver** — Deal an Astral Powerful attack to a player. If you didn't use this ability last night, you may deal an Astral Unstoppable attack to them and their target instead. \n**Marksman Revolver** — Deal an Astral Basic attack to a player. You may also shoot a coin, which will redirect each Astral attack to the two targets that most benefit you. This duplicates the attack. You only have four coins."},{"name":"Abilities (cont.):","value":"**Core Eject Shotgun** — Deal a rampaging Powerful attack to a player. If you didn't use this ability for three nights, you may instead shoot a grenade at a player, dealing an Unstoppable attack to them and their closest living neighbours that also hits an additional set of those neighbours' neighbours and so on for each other attack that the first target was dealt. *(2 night cooldown)*\n**Pump Charge Shotgun** — Deal a rampaging Basic attack to a player. If you didn't use this ability last night, you may instead deal a rampaging Powerful attack; if you didn't use it for two nights, you may instead deal a rampaging Powerful-And-A-Half attack; and if you didn't use it for three nights, you may instead deal an Unstoppable attack to yourself and your closest living neighbours. *(1 night cooldown)*"},{"name":"Abilities (moar.):","value":"**Attractor Nailgun** — Fire three silver nails. Each does a Basic attack to a random player other than yourself, with the attacks increasing in tier if multiple hit the same player. You may also first shoot a magnet at a player, causing all nails to hit them tonight. If that player dies tonight, each nail also hits a random one of their visitors. You only have three magnets and ten silver nails.\n**Overheat Nailgun** — Fire two nails. You may instead fire four overheated nails, which deal Unstoppable attacks, but only if you've fired three or more normal nails since the last time you fired overheated nails. You only have eight overheated nails.\n**Electric Railcannon** — Deal an Astral Overkill attack to a player, their target, and their target's target. *(3 night cooldown, during which you also can't use other Railcannons)*\n**Screwdriver Railcannon** — Deal an Overkill attack to a player. You will also deal an Unstoppable attack to them the next two nights, even if they're dead."},{"name":"Abilities (why.):","value":"**Malicious Railcannon** — Deal an Overkill attack to a player and their closest living neighbours. If this hits the same player as the Core Eject Shotgun's grenade, it counts for three attacks (attacking your target's neighbours and their neighbours' neighbours three times over).\n**Freezeframe Rocket Launcher** — Deal an Unstoppable attack to a player and their closest living neighbours. You may instead suspend this attack and cause it to happen on any later night. *(1 night cooldown)*"},{"name":"Attributes:","value":"- You may self-target.\n- You may multitask, but you can't use different variants of the same weapon (like both Nailguns or multiple Arms) at once.\n- You recover a point of Hellbent damage for each tier of each attack you deal.\n- You take an additional Hellbent damage for each tier of each attack you're hit with. This damage can't be recovered until a night after it's dealt. \n- All \"If you didn't use this last night / for X nights\" conditions apply on Night 1.\n- You get 100 style points for each attack you deal beyond the first each night, 100 for each beyond the second, etc."},{"name":"Goal:","value":"NK goal + get at least 5000 style points."}],"meta":{},"desc":"Post 3396\n*INFINITE HYPERDEATH*\nRoleblock and redirect immune","id":4422,"locked":false}