{"aliases":["3141","monkey_village","monkeyvillage","monkey","village","mv"],"author":"504813861950586891","title":"Monkey Village","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Monkey","subalignment":"Support","unique":"False","attack":"None","defense":"Dependent"},"fields":[{"name":"Abilities:","value":"- Each night, you may target a fellow monkey. They gain a buff depending on monkey they are."},{"name":"Sniper Monkey:","value":"The next time they shoot, they do not have a cooldown. if they target a monkey with their Cripple Moab ability, they do not roleblock. If they target a non-monkey, they do not give defense."},{"name":"Ice Monkey:","value":"Whoever they visit tonight gains frostbite."},{"name":"Dart Monkey:","value":"All of their attacks attack one other random non-monkey."},{"name":"Alchemist Monkey:","value":"They gain one more use of transforming tonic presuming they went that upgrade, or they may empower one more person. |"},{"name":"Quincy:","value":"The chance of their attack missing goes down by half."},{"name":"Super Monkey:","value":"You do not count as one for super-monkeys transformation this night. You will deal to him a basic attack, then immediately refresh their auto vest, assuming they cannot transform into sun god using your ability. If they have already summoned the sun god, their attack becomes astral, you do not die to them tonight, and anybody who they attack is modkilled."},{"name":"Engi:","value":"Attacks all visitors. With Bloon Trap, deals a Powerful attack instead."},{"name":"Ace:","value":"Also sees anyone who visits your targets. This will count towards Ground Zero. If upgraded, all attack levels are also increased by one stage."},{"name":"Spike:","value":"Roleblocks whoever the spikes are put on as well, unless they are a Monkey. Reduces all numerical values in the card except for the post number and spike storm count by one until the next night. Spike Storm may place on one extra person."},{"name":"Bucc:","value":"Visit becomes astral, and the ability is changed to a Control with the same properties."},{"name":"Ninja:","value":"They may sabotage two sub alignments, or they may have four bombs out at a time, lasting till the end of the next night."},{"name":"Gwen:","value":"Firestorm will reduce defense to fragile regardless of the original defense, they will now deal powerful attack, and they will not lose cocktails / firestorm upon using them."},{"name":"Boomerang:","value":"They may now only redirect players of three different sub allignemnts or survive a single attack in order to fulfil their unlock criteria. Presuming they have Glaive Lord unlocked, they are no longer seen as visiting anybody who glaive hits, and everybody who gets hit with a glaive will be dealt a basic attack, capping at 3 players. Presuming they have moab domination unlocked, they will now burn and roleblock whoever the original target intended to visit."},{"name":"Attributes:","value":"**Primary Training**\n-After having buffed a primary monkey twice, you may buff a primary monkey in addition to your normal buff. \n-After having buffed a primary monkey thrice, you let a primary monkey you visit act twice the following night. \n**Monkey Intelligence Bureau**\n-After having buffed a monkey twice, you unlock your attribute. \n-After having buffed a monkey thrice, you may let all other monkeys act twice(One Use)\n\n__\n-Your defense value is equal to the amount of monkeys currently in game(Discluding yourself)\n-You cannot spawn as the only monkey. \n-You may only choose one upgrade, outlined in bold.\n-Presuming you choose Monkey Intelligence Bureau, all monkeys in the game are redirection immune, control immune, conversion immune, roleblock immune, and gain basic defense."}],"meta":{},"desc":"Post 3141","id":4423,"locked":false}