{"aliases":["2272","the_rascal","therascal","rascal"],"author":"888761463647371284","title":"The Rascal","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"— Hide within the town during the day. You'll be removed from the current Day channel. The first person to notice you're gone gains an enchanted pickaxe. If you hide without being caught twice, you'll become **Pleased**. If someone notices you while you're **Pleased**, you'll give 'em three enchanted pickaxes instead. If you hide within an hour of the day ending, it won't count towards your pleasedness."},{"name":"Attributes:","value":"— The enchanted pickaxe is an item which someone can use along with their night ability. Depending on random chance, the user can get a certain ore. Also, if you've got multiple pickaxes, you can mine with all of 'em at the same time each night.\n> Coal (44% chance): You can mine twice next night.\n> Copper (15% chance): For every two copper, pick __any__ ore to gain immediately besides Diamond.\n> Iron (15% chance): Get another tier of defense. If you're at none, it'll become basic. Basic becomes powerful, etcetera.\n> Redstone (10% chance): Next night you can mine thrice, multitask and use one of your actual abilities twice.\n> Lapis (10% chance): Double your current amount of pickaxes.\n> Gold (5% chance): Get another **life** - the first time you die, survive the attack, and it'll look like you were healed. This isn't a protection, so a high attack tier doesn't matter."},{"name":"Attributes (cont.):","value":"> Diamond (1% chance): Win the game immediately regardless of the outcome. If you've already won, choose another player to win. You can't gain this ore unless you've mined at least three times.\n— You __**cannot**__ claim, and even implying your role will result in an immediate loss and death. Hiding from the town doesn't count even though it might be obvious you're the Rascal after that.\n— You also can't self-target or self-notice."},{"name":"Goal:","value":"Become **Pleased** and give at least five people some pickaxes."}],"meta":{},"desc":"Post 2272\n*A mischievous creature. Gives pickaxes to those who find it during games of Hide and Seek.*","id":4425,"locked":false}