{"aliases":["4311","colorful_politician","colorfulpolitician","colorful","politician","cp"],"author":"686366122903339040","title":"Colorful Politician","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"None","defense":"Powerful"},"fields":[{"name":"Abilities:","value":" - **Election!**: During Day 1, choose three party heads from the current game's player list. You can choose yourself. During Night 1, the chosen players will be notified that they must choose a color, as well as write a short speech (not exceeding 50 words). Your chosen color will determine the \"policy\" you're fighting for, with the effects being as follows:\n**Red**: You will receive a +2 attack boost. All voters of yours will receive a +1 attack boost. Should you not have any abilities that utilize attack power, you also gain the ability to perform an attack with no additional abilities at night.\n**Blue**: All players who end up not voting for this candidate lose a stage of defense. Should your role possess Vulnerable defense, you will die upon the election results being read."},{"name":"Abilities (cont.):","value":"**Green**: The party head may choose x/2 players, with x being the players who voted for the head, to receive a \"factional\" chat with yourself, including a \"factional\" kill. The players chosen for this are not publicly revealed - these players may also win together, even if they wouldn't originally.\n**Yellow**: The party head must initiate the passing of a shock. In real time, players will pass around this shock - with whoever holds it at the end of the following night being shocked with an Unstoppable force, which also strikes any visitors they may have - players who voted for the head of this party will be immune to the shock.\n**Purple**: The party head and all voters of this party become part of a council. They hold an additional vote that following night to poison 3 non-purple players, which will kill the affected players the following night."},{"name":"Attributes:","value":"- Should any of your selected party heads die at the end of Night 1, you will prevent their death.\n- Players who do not vote in the Day 2 election will be roleblocked the following night."},{"name":"Goal:","value":"See the elected party head win the game."}],"meta":{},"desc":"Post 4311","id":4443,"locked":false}