{"aliases":["2711","fraudulent_artist","fraudulentartist","fraudulent","artist","fa"],"author":"329331408269213696","title":"Fraudulent Artist","color":null,"iconURL":null,"imageURL":" https://cdn.discordapp.com/attachments/970046125065265202/1041881907559944283/image.png?ex=655c02a3&is=65498da3&hm=4275076a70b52b4bb763e8cc70422fc47f5b9bf094af65d14cf6926f3cca868e&","params":{"faction":"Town","subalignment":"Killing/Protective","unique":"False","attack":"Basic","defense":"None"},"fields":[{"name":"Abilities:","value":"- At night, choose a player to interpret your art.\n- The player interpreting your art sees the below image. They must choose from this list of things to interpret the art as:\nA) \"A dayvigi's gun\"\nB) \"A man stressed because he's roleblocked\"\nC) \"A powerful heal from Town of Salem\"\n- You will NOT be told which of these was chosen.\n\n- During the day, choose a player. The effect will happen once the day ends\n- If the interpreter saw \"A dayvigi's gun\", you will shoot the chosen target with a basic attack, and will be told if they have defense.\n- If the interpreter saw \"A man stressed because he's roleblocked\", you will roleblock the target tonight, although you will immediately be told if they have immunity.\n- If the interpreter saw \"A powerful heal from Town of Salem\", you heal your target today and tonight."},{"name":"Attributes:","value":"- If you kill an innocent person, the \"A dayvigi's gun\" option is replaced by the person interpreting your art by \"Suicidal Ideation\", which kills you if you target anyone instead. (see suicide mechanic)"},{"name":"\"You find a painting with a note attatched:","value":"'*Interpret this art.*'\nWhat do you see?\nA) A dayvigi's gun\nB) A man stressed because he's roleblocked\nC) A powerful heal from Town of Salem\""},{"name":"\"You find a painting with a note attatched:","value":"'*Interpret this art.*'\nWhat do you see?\nA) Suicidal ideation\nB) A man stressed because he's roleblocked\nC) A powerful heal from Town of Salem\"\n\n\"They were shot by the Fraudulent Artist.\""},{"name":"Goal:","value":"Hang all criminals and evildoers."}],"meta":{},"desc":"Post 2711\n*Tell me, what do these blots of ink look like to you?*\nTown (Killing/Protective (I don't really remember the sub-alignments))","id":445}