{"aliases":["2961","people_person","peopleperson","people","person","pp"],"author":"504813861950586891","title":"People Person","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Power","unique":"False","attack":"Basic(May only use if using an ability that attacks)","defense":"None"},"fields":[{"name":"Abilities:","value":"Each night, you may investigate one person that you are permitted to. You will recieve their consig result and the abilities of a role they made."},{"name":"Attributes:","value":"May not target themselves\nIf their are no roles alive that you are permitted to check, you will reroll into a random town role.\nList of people you're allowed to check and their consig result:\n:: Your target is the star of the show. They must be Rasen.\n::  Your target is a fish with determination. They must be Lunari.\n::  Your target owns a kingdom in another world, they must be TLHP.\n::  Your target is a kitsune here to play with us, they must be Tox.\n::  Your target is an outsider from another realm, they must be seon.\n::  Your target is a danger to others, they must be Luka.\n::  Your target is obsessed with pizzas, they must be Mac.\n:: Your target has two names at once, they must be  Nik or Nic.\n:: Your target hates quotation marks. They must be Vik.\n:: Your target is a pink robot, they must be Robotica.\n:: Your target has someone who grand idea's on their mafia. They must be Loy.\n:: Your target is a head of an evil faction. They must be JD."},{"name":"Attributes (cont.):","value":":: Your target is a trickster keeping others on edge. They must be Bionic.\n:: Your target corrects their mistakes from previous lives. They must be Spaggy.\n:: Your target is a fan of action that keeps on going. They must be Actionguy.\n:: Your target is a cool gamer, they must be Coolgamer.\n:: Your target transcends humanity. They must be Zerosage.\n:: Your target is unwavering in their robot companion. They must be Noodlemire\n-  If the person you check has never made a role, you will be given the abilties of a random town role instead.\n- You will be given any attributes the host deems needed to allow the ability to function"}],"meta":{},"desc":"Post 2961\n*Your target trancends humanity. They must be Zage*","id":4656,"locked":false}