{"aliases":["2712","festo"],"author":"334031547739144194","title":"Festo","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaotic","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Attributes:","value":"- Roleblock immune\n- Anyone targeting you with an ability will target a random other player instead."},{"name":"Goal:","value":"Survive until you gain 10 points. You gain points every time you *directly or indirectly* cause one of the following to occur (up to host interpretation)\n- Prevent a death (1 point)\n- Someone targets a member of their own faction without killing them (1 point)\n- Someone attacks and kills a member of their own faction (2 points)\n- Another Neutral dies before winning (1 point)\n- 4 actions fail in a single night (2 points)\n- Throw 3 parties (2 points)\n- Use your Hangover ability (1 point)\n- A player other than you accuses the host of a making a host error (2 points)"}],"meta":{},"desc":"Post 2712\n**Abilities**\n1. Throw a Party (infinite, day ability): Choose up to 4 players (you can choose yourself). They will gain a private chat with each other during the night, but can only target or be targeted by the other people at the party.\n2. Drug (1 use): Every player’s action tonight will target a random player instead of their chosen target. Passive abilities or abilities that don’t target other players will fail.\n3. Hangover (3 uses): Choose a player and one of the following effects.\na. The only feedback they will receive this phase is “You slept peacefully” even if they didn't. If they would have died, they won’t.\nb. They will perform a random ability drawn from all abilities in <#970046125065265202> instead of their submitted action.\nc. They will be assigned a random new role based on their original slot.\nd. They will keep their original role, but:\n- If they’re Town, they will switch alignments to one of the other factions in the game, but not gain access to any shared chats or be told who their teammates are.\n- If they’re not Town, they will lose access to any shared chats and can’t send or receive any whispers from their teammates.\n- If they’re a Neutral, you will be told their role.","id":4786,"locked":false}