{"aliases":["2596","nub,_god_of_nationality","nub_god_of_nationality","nub,godofnationality","nubgodofnationality","nub","god","nationality","nub,","ngon","ngn"],"author":"562746047596593163","title":"Nub, God of Nationality","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Civilization","subalignment":"Support","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Learn of a player's nationality, revealing their true faction to you.\n- Attempt to change a target's loyalty. (Costs 4 gold, doubled if outcome would be Civilization) (2 uses)"},{"name":"Attributes:","value":"- Your first ability also reveals subalignment if the target is Neutral.\n- Your second ability fails if your target is conversion immune.\n- If you're changing a target's loyalty to Neutral, you may choose their goal. Options include NK goal, NE goal, and survive."},{"name":"Messages:","value":"- They were decimated by the Demigod of Nationality. (Factional kill)\n- A smiling face appears, revealing your target is loyal to (the) [faction]. (If target is good)\n- A sinister face appears, revealing your target is loyal to (the) [faction]. (If target is evil)\n- A helpful face appears, revealing your target is Neutral Benign. (If target is Neutral Benign)\n- An expressionless face appears, revealing your target is Neutral Killing. (If target is Neutral Killing/Genocidal, or has an NK/NG goal)\n- A face of evil appears, revealing your target is Neutral Chaos. (If target is Neutral Chaos)\n- A face of determination appears, revealing your target is Neutral Evil. (If target is Neutral Evil)\n- A face of mystery appears, revealing your target is some other Neutral. (If target is an unlisted Neutral)\n- You convince your target that they are on the wrong path. They are now (a) [faction]. (On successful ability use)"},{"name":"Messages (cont.):","value":"- You try to convince your target that they are on the wrong path, but they refuse to listen. (If target is conversion immune)\n- A stranger has convinced you to change your path. You are now (a) [faction]. (Given to target on successful ability use)\n- Someone tried to convert you but you are immune. (Given to conversion immune targets, can be replaced by standard failed conversion message)"}],"meta":{},"desc":"Post 2596\n*uwu*","id":4864,"locked":false}