{"aliases":["2554","mimikyu_real_not_fake","mimikyurealnotfake","mimikyu","real","fake","mrnf","mrf"],"author":"521123471460270121","title":"Mimikyu Real Not Fake","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Pokemon","subalignment":"Single","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Play Rough: Choose a player. If they don't have a Mimikyu profile picture, set their defense to **Isolated** for the next three nights. The **Isolated** must be bolded.\n- Let's Snuggle Forever: Choose a player. Permanently set their defense to **Isolated**, **Fragile**, and **Vulnerable** at the same time, which must all be bolded. You may only do this once."},{"name":"Attributes:","value":"- You have 105 Special Defense (Overoveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroverprotective). This only applies to attacks that are magical in flavour.\n- Your attack value cannot be higher than your Special Defense value for any reason."},{"name":"Pokemon Ability:","value":"- Disguise: You have an Overoveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroveroverprotective autovest. Your role is 2301: Pikachu until your autovest is broken. If you evolve as Pikachu, you still return to being Mimikyu Real Not Fake when your autovest is broken."}],"meta":{},"desc":"Post 2554\n*SHIT ASS ROLE*","id":4883,"locked":false}