{"aliases":["2428","master_librarian","masterlibrarian","master","librarian","ml"],"author":"888761463647371284","title":"Master Librarian","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Support","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Select a book from your selection to add to your collection. You have **four** types of books: science books, military manuals, storybooks and mysteries.\n- Give a target a book from your collection during the day. Depending on the type of book, they'll gain a certain buff. The target will be unaware you gave them a book, and will not realize they got buffed whatsoever.\n> **S**cience Books: The target gains scientific knowledge and gains a one-time basic Defense.\n> **M**ilitary Manuals: The target gains military knowledge and their next visit will also Basic attack their target. The cause of death will appear to be from whatever their role is.\n> **S**torybooks: The target will become creative and their visits will permanently use Astral.\n> **M**ysteries: The target will know all the twists. If the target is investigative, their investigation will be immune to framing and detection immunity permanently."},{"name":"Abilities (cont.):","value":" - Throw a book from your collection at someone during the night. The target won't know they got a book thrown at them. Has a different effect based on what book you use.\n> **S**cience Books: The target's science knowledge will be erased and their Defense is set to none.\n> **M**ilitary Manuals: The target forgets why they wanted to fight people and their Attack is set to none.\n> **S**torybooks: The target gets distracted with the pictures and is roleblocked through immunity.\n> **M**ysteries: The target's attributes mysteriously vanish and won't apply tomorrow night."},{"name":"Attributes:","value":"- Once per game, at any time, you may add three random books to your inventory. If you do this, you'll be dealt an Overkill attack three days later because they'll be past their return date."}],"meta":{},"desc":"Post 2428\n*Shhhhhhh! Keep. It. DOWN!*","id":4949,"locked":false}