{"aliases":["2251","white_king","whiteking","white","king","wk"],"author":"562746047596593163","title":"White King","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"True","attack":"Overkill","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- Make a move in the game of chess. Usable on the first move, or after Black makes a move. This ability can be used multiple times per day or night."},{"name":"Attributes:","value":"- A Black King will always spawn if you exist.\n- You can only spawn when the total player count is 16 or higher.\n- If less than 32 players are in the game, first ensure that all non-pawn pieces have a player, then assign all remaining players to pawns. Players can only be d or e pawns if no other pieces are left.\n- You do not affect the spawning of Good/Evil/Neutral/Psycho Kings (2028/30/31/32).\n- At the beginning of the game, your presence will be announced. 8 players will be made pawns, 2 rooks, 2 knights, 2 bishops, and 1 a queen. You are the White King. A player cannot be multiple pieces, and also cannot be a White and Black piece at the same time. Players are notified if they are a piece. You know who your pieces are.\n- \"Making a move\" means making a move in a public game of Chess. The current board and list of moves is always public.\n- If a piece is captured, that player is dealt an Overkill attack instantly."},{"name":"Attributes (cont.):","value":"- If you are checkmated, Black King attacks you, and roleblocks all of your living pieces tonight.\n- Roleblock, control, and redirect immune, because you technically do not target anyone.\n- If you die, you may make two more moves before the enemy wins by default.\n- You must make at least one move per phase. If you don't, the host will find the worst possible move for you to make, and that move will automatically be made. This can be overridden for specific circumstances, such as it never being your turn."},{"name":"Goal:","value":"Checkmate the enemy at all costs."}],"meta":{},"desc":"Post 2251","id":5093,"locked":false}