{"aliases":["2119","assistant_for_accent's_alt_account_(not_wolfi)","assistant_for_accents_alt_account_not_wolfi","assistantforaccent'saltaccount(notwolfi)","assistantforaccentsaltaccountnotwolfi","assistant","for","accents","alt","account","wolfi","accent's","(not","wolfi)","afaaanw","afaaaw"],"author":"765276088183029810","title":"Assistant for Accent's Alt Account (Not Wolfi)","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Sentry","subalignment":"Support","unique":"True","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"> Give an authorized target a scroll.\n\n> During the day, declare someone who has rejected your scroll an enemy of the Sentries."},{"name":"Attributes:","value":"> You have 3 scrolls.\n\n> When someone gets a scroll, they may either choose another role of the same alignment & subalignment, or they make a new role with the same alignment & subalignment. With the hosts approval, they are that role.\n\n> If the host does not approve the first role, you may choose/make another. If the host rejects it again, your target loses the scroll.\n\n> Your target has until the end of the next night to use a scroll.\n\n> If someone doesn't use your scroll in time, chooses not to use your scroll, or gets their scroll denied twice, they will throw the scroll in your face. This both gives you a charge of your ability back, and makes you angry.\n\n> If someone has made you angry by throwing their scroll in your face, you may declare that they are an enemy of the Sentries. This lowers the votes needed to kill them by 2. If this causes the votes needed to kill them to be 0 or less, they instantly get executed."},{"name":"Attributes (cont.):","value":"> This is a **serious** role. It counts as 1 role towards _Rokk getting a scroll from Accent's alt account (not Wolfi)."}],"meta":{},"desc":"Post 2119\n*\"I still can't believe Wolfi is gone. Oh well at least Accent's Alt Account will give me a scroll!\"*","id":5143,"locked":false}