{"aliases":["2028","good_king","goodking","good","king","gk"],"author":"562746047596593163","title":"Good King","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Good","subalignment":"Support","unique":"True","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Royal Finger (Day): Your next vote will count as two, including nightfall votes.\n- Decide Fate (Day, 1 use): Immediately hang a player, or grant a player hanging immunity for the day. The town will be notified if you did either.\n- Guards! (Night, 2 uses): Grant yourself Powerful defense against all attacks.\n- Safeguard (Night, 4 uses): Astrally grant another player Powerful defense against all attacks."},{"name":"Attributes:","value":"- Cannot be jailed by jailor-type roles. Additionally, if you are hanged, the town cannot hang anyone the next day.\n- Conversion immune.\n- Cannot be targeted by investigative abilities, all investigative abilities used on you will fail no matter what.\n- Cannot co-exist with Evil King (2030), Neutral King (2031), and Psycho King (2032).\n- You are revealed as the King at the beginning of the game. The town will not be notified of your alignment.\n- You may choose to have a role that shows above the game's players called King, and may choose the role's color.\n- At the beginning of the game, your role is renamed to [your faction] King.\n- **Q: Why is this Good Support and not Town Support?** A: uhh to prevent an Evil King from spawning in a non-Town role list and being screwed over, look the host has rule 17 if they care that much"},{"name":"CITY KING CHANGES:","value":"- Decide Fate and Royal Finger are usable at day and night.\n- Decide Fate and Royal Finger also to both the target and a specific role (except the latter when pardoning someone)\n- Always applies when City is in the game, even if you are a different good faction's king.\n**ARMY KING CHANGES**\n- Gain a use of Decide Fate, Guards!, and Safeguard when the Marshall reveals themself."},{"name":"Goal:","value":"Good faction goal"}],"meta":{"spawn_if_parent":"type:good"},"desc":"Post 2028","id":5186,"locked":false}