{"aliases":["1750","self-defense_survivor","selfdefensesurvivor","self","defense","survivor","sds"],"author":"562746047596593163","title":"Self-Defense Survivor","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Benign","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Attack a player at night.\n- Switch out one or both of your items during the day."},{"name":"Attributes:","value":"- You start with the Bandage and Stick equipped.\n- You may reequip items multiple times.\n- Having both the Torn Notebook and Cloudy Glasses allows you to only take a maximum of one attack per night. This will always be the lowest valued attack."},{"name":"Weapons:","value":"- Stick: Basic attack. Also roleblocks any animal-type role on attack. (if it was dogs only it would be way too weak)\n- Toy Knife: None attack. Instead, the threat of being stabbed roleblocks players.\n- Tough Glove: Basic attack. Deals 4 attacks at once.\n- Ballet Shoes: Powerful attack. Always processed before everything else.\n- Torn Notebook: Basic attack. You can only take a max of two attacks per night (the lowest value attacks are processed first, all other attacks are automatically blocked and will fail).\n- Frying Pan: Powerful attack. If your target survives, they cannot perform an action tomorrow.\n- Gun: Unstoppable attack."},{"name":"Armors:","value":"- Bandage: No defense. You cannot be poisoned or bled while having it.\n- Faded Ribbon: No defense. Negates the first attack dealt towards you.\n- Manly Bandana: Basic defense. You also will learn everyone who visits you.\n- Old Tutu: Basic defense. The first person to visit you will be redirected to the next player on the player list.\n- Cloudy Glasses: Basic defense. You can only take a max of two attacks per night (the lowest value attacks are processed first, all other attacks are automatically blocked and will fail).\n- Stained Apron: Basic defense. Additionally, if you attack a Protective role, you won't attack them, and instead redirect them to you, and you will be notified of this.\n- Cowboy Hat: No defense. Increase your attack value by one."},{"name":"Goal:","value":"Survive to the end of the game."}],"meta":{},"desc":"Post 1750\nAttack (starting): Basic\nAttack (starting): None","id":5298,"locked":false}