{"aliases":["5418","stapler"],"author":"174251652524539904","title":"Stapler","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Variable","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- **Effect Veiler**: During either the night or day, target a player; That target's abilities will fail until the beginning of the next day. 1 use.\n- **Maxx \"C\"**: During the day, after this ability is used: Gain 1 use of a random limited-use ability you have each time a player votes for you this day, except for Maxx \"C\". 1 use.\n- **Ash Blossom & Joyous Spring**: During either the night or day, when this ability is used: Any ability or attribute that would add a new player into the game will fail until the beginning of the next day. 1 use.\n- **Abyss Dweller**: During either the night or day, when this ability is used: Any ability used by a dead player will fail until the beginning of the next Day. 1 use.\n- **Artifact Lancea**: During the night, when this ability is used: If you die, revive immediately. 1 use.\n- **Bystial Magnamhut**: During the night or day, target 1 dead player; That target cannot cannot be revived for the remainder of the game. 1 use."},{"name":"Abilities (cont.):","value":"- **Kashtira Fenrir**: During the night, target a player and deal a Powerful attack to them. A player killed by this ability cannot be revived for the remainder of the game. Unlimited uses.\n- **Lava Golem**: During the night, target exactly 2 players and deal Unstoppable attacks to both of them. 1 use.\n- **Ravenous Crocodragon Archethys**: During either the night or day, by sacrificing 2 total ability uses from any combination of your limited-use abilities: Target 1 player and deal a Powerful attack to them. Unlimited uses.\n- **Baronne de Fleur**: During the night, when this ability is used: If another player targets you with an ability, that ability fails and you deal a Powerful attack to them. 1 use."},{"name":"Abilities (moar.):","value":"- **Nibiru, the Primal Being**: During the day, if 5 or more votes have been placed against you: Deal Unstoppable attacks to all players who have voted for you, and create a new player in the game whose name is \"Primal Being Token\", is aligned with the Town, and has Attack and Defense values that are the total combination of the Attack and Defense values of each player who was killed by this ability. 1 use.\n- **Divine Arsenal AA-Zeus - Sky Thunder**: During the night or day, by sacrificing 1 ability use from another limited-use ability: Deal Powerful attacks to all other living players. 0 uses."},{"name":"Attributes:","value":"- You may multitask, but only to use **Ravenous Crocodragon Archethys**.\n- During the day, you may choose to trade 1 use of **Baronne de Fleur** in exchange for 1 use of any of the abilities listed above it.\n- The player named \"Primal Being Token\" who was created by **Nibiru, the Primal Being** will not vote or attack unless the ability or attribute of another player forces it to."},{"name":"Goal:","value":"Kill all who would oppose you."}],"meta":{"post":"5418","track_message_id":"1338616463543636028"},"desc":"Post 5418\n*Negate!*","id":5612,"locked":false}