{"aliases":["5458","thrall"],"author":"563491765576007680","title":"Thrall","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Variable","defense":"Basic (None) (Vulnerable)"},"fields":[{"name":"Abilities:","value":" - Create a totem at someone's house. Any future visitors to them have the ability to destroy said totem\n- **Cannibals:** Pay {1,2,5} Totem Power to astrally deal a {basic, powerful, powerful with basic rampage} attack to {1,1,2} player(s). Sate 1 hunger for each player killed this way\n- **Whiteout:** Pay {1,2,4} Totem Power to astrally {Roleblock all investigative abilities, but they learn this ability was used; roleblock all investigative abilities; roleblock all investigative abilities, ignoring roleblock immunity} for {1,1,2} nights. If anyone attempts to investigate you during this effect, and dies before the end of the next night, sate 1 hunger.\n- **Spirit Walk:** Pay {1,3,5} Totem power to gain {Powerful, Unstoppable, invincible} defense for {1,2,3} nights.\n(Regardless of hunger) If anyone attacks you during this effect, and dies before the end of the next night, sate 1 hunger."},{"name":"Abilities (cont.):","value":"- **Hush:** Spend {1,4,6} Totem power to {Make all messages anonymous tomorrow, prevent speaking tomorrow, prevent speaking for two days}. If a player that opposes you is executed during this effect, sate 2 hunger.\n- **Doppelganger:** For {1,2,4} Totem power, appear as {A different neutral subalignment, any alignment or subalignment, any role} for two nights and days. If anyone attempts to investigate you during this effect, and dies before the end of the next night, sate 2 hunger."},{"name":"Attributes:","value":"- You have 0/7 Totem Power. At the start of each night gain 1 Totem Power plus one for each of your totems (You have X)\n- Your hunger level is 0/5. Gain one hunger at the end of the night, if you did not sate it at all since the end of last night. At 3 hunger, gain None defense, at 4, gain vulnerable, at 5, die.\n- You may only use 3 unique abilities (not including making Totems) per game."},{"name":"Goal:","value":"Kill all who would oppose you"}],"meta":{"post":"5458","track_message_id":"1358962208435994727"},"desc":"Post 5458","id":5657,"locked":false}