{"aliases":["5463","d.j._hallyboo","dj_hallyboo","d.j.hallyboo","djhallyboo","dj","hallyboo","d.j.","dh"],"author":"563491765576007680","title":"D.J. Hallyboo","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Chaos","unique":"False","attack":"Null","defense":"Null"},"fields":[{"name":"Abilities:","value":"- Trap a pirate in a Nintendo DS. (killing them, ignoring defense) Fails if the target isnt a pirate. Starts with charges equal to pirate count. Gains a charge if a pirate is created midgame\n- Send a warning to up to three players. If any are pirates, their games crash to an anti-piracy screen, roleblocking them. (They learn the reason) the first time this happens a player, you dont learn you were successful, the second time to the same player, you learn what role you roleblocked, the third time, you learn the exact player you roleblocked. You must choose different players to last night unless pirates outnumber non-pirates"},{"name":"Attributes:","value":"- Players with roles that either imply that they steal or outright state it (such as Pidgeon (3709)) have pirated Mario Party DS. For the purposes of this ability, kidnapping and jailors count as stealing. If someone obtains a stealing ability from something else, they turn into a pirate if they use it. If less than 3 players can steal, random players gain the **Steal** ability until 3 players can steal (each night, steal a use of a random ability from a player of your choice. They cannot use this ability on the next night and you can (once) use it. You may only use this on D.J. Ballyhoo once.)\n- You know the roles that are held by alive pirates. You win, leaving the town, when no pirates are alive.\n- For the purposes of voting, you do not exist (you cannot vote, be voted, or effect the votes required for hammer)\n- Death immunity, except if all alive players are pirates, in which case die\n- Your abilities are multi-taskable if pirates outnumber non-pirates"},{"name":"Attributes (cont.):","value":"- At the beginning of the game the following announcement plays: \"D.J. Hallyboo is upset! As the host, he takes it personally when someone tries to play for free! It would be best to offer a formal apology to <PLAYER NAME>!\""},{"name":"Goal:","value":"Punish all those who have pirated Mario Party DS"}],"meta":{"post":"5463","track_message_id":"1362567258161025105"},"desc":"Post 5463\n*Piracy is no Party!*","id":5662,"locked":false}