{"aliases":["1","passive_ability_-_cultivation","passiveabilitycultivation","passive","ability","cultivation","pac"],"author":"1159466705291059220","title":"Passive ability - Cultivation","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[],"meta":{"post":"1","track_message_id":"1363081563641745539"},"desc":"Post 1\nXXXX) Cultivator - Town Power\nPhases include: Lianqi, Zhuji, Kaiguang, Ronghe, Xindong, Jindan, Yuanying, Chuqiao, Fenshen, Heti, Dongxu, Dacheng, Dujie.\n(So after Lianqi 9 would be Zhuji 1)\nYou unlock different abilities as you progress.\nAbilities are only available while you are of the corresponding phase, unless specified otherwise.\nUpon surpassing Dujie 9, you die, but may give up to 3 of your abilities to up to 3 different players. Each player receives at most one ability\n**Passive ability - Zhuji**\nYou gain basic defense.\n**Passive ability - Kaiguang**\nEach night, you are informed of one random player’s alignment.\n**Passive ability: Ronghe**\nYou have access to both Zhuji and Kaiguang.\n**Night ability - Xindong**\nYou may choose one player. If you die, that player also dies.\n**Day ability - Jindan**\nYou may choose one player. If you are to die, that player dies instead.\n**Passive ability - Yuanying**\nYou cannot die by any means other than being voted out.\n**Day ability - Chuqiao**\nYou may choose one player and learn of their exact role at EoD, and control their action for the night.\n**Passive ability - Fenshen**\nYou are immune to all attacks, and your vote is doubled.\n**Passive ability - Heti**\nYour vote is quadrupled.\n**Night ability - Dongxu (x1)**\nYou may rewind time by one day. (For example, N5 will be followed by D5 rather than D6, and all actions done during D5 and N5 will no longer count)\n**Day/Night ability: Dacheng (x1)**\nYou may choose one ability from a dead player to inherit.\n**Passive ability: Dujie**\nAll your previous abilities become available. Your role is also publicly announced.\nIf two passive abilities conflict, you may choose which one takes effect.","id":5666,"locked":false}