{"aliases":["5","passive:_may_i_take_your_order?","passive_may_i_take_your_order","passive:mayitakeyourorder?","passivemayitakeyourorder","passive","may","take","your","order","passive:","order?","pmityo","pmtyo","5-star"],"author":"1159466705291059220","title":"Passive: May I take your order?","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Other","unique":"False","attack":"None","defense":"None"},"fields":[],"meta":{"cannot_spawn":"true","post":"5-star","track_message_id":"1363081653139935262"},"desc":"Post 5-star\nXXXX) **Uber Eats guy** - Neutral Benign\nWhen visited at night, including astral visits, marks the visitor with an \"Order\" mark. If there is a group visit, only one random player of that group is marked. Uber Eats guy is informed of how many people have an \"Order\" mark, but not who. Players with an \"Order\" mark are informed: \"You've ordered some takeout.\"\nUber Eats guy gains a \"5-star review\" for each order mark removed, and another \"5-star review\" upon successfully protecting a player. If a player is marked with an \"Order\" mark for three nights straight, the \"Order\" mark is removed and Uber Eats guy gains a \"1-star review\".\nIf 2 players successfully receive their orders at once, Uber eats guy gains immunity to death for the night.\nIf 3 players successfully receive their orders at once, Uber Eats guy gains an extra \"5-star review,\" and is immune to death for the night and the next night.\nThe player is then informed: \"Your order didn't arrive on time. Now you're hungry.\"\n\"5-star reviews\" and \"1-star reviews\" cancel with each other. Dies when Uber Eats Guy has 3 \"1-star reviews.\"\n**Night ability: Sorry sir, I was hungry!**\nUber Eats guy may remove an \"Order\" mark from one of the players with the shortest time remaining to protect themselves from being killed. This gives the Uber Eats guy a \"1-star review.\"\nThe player losing the mark is informed: \"The Uber Eats guy was hungry. Now you're sad.\"\n**Night ability: Here's your order!**\nEach night, may choose to visit X players. If a visited player has an \"Order\" mark, that mark is removed, and that player is protected from death that night. (X = 1 + number of \"1-star reviews\" held)\nThe player receiving the order is informed: \"Your order arrived!\"\nIf the player is also attacked during the night but is successfully protected, they are instead informed: \"Your order arrived, it was super delicious!\"\n**Win condition:** Have 3 or more \"5-star reviews.\"","id":5667,"locked":false}