{"aliases":["2139","aztec"],"author":"327918538419601409","title":"Aztec","params":{"faction":"Civilizations","subalignment":"Scientific","unique":"Yes","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Choose from one of three random Luxuries to use, presented at the start of the night.\n- Choose from any Luxury to use. Cannot select any Luxuries that generate Gold. (Costs 4 Gold)"},{"name":"Attributes:","value":"- Citrus, Coffee, Cotton, Furs, Incense, Jade, Marble, Olives, Salt, Silver, Spices, and Turtles may all be used on yourself.\n- You may not choose any Luxury you have previously used with your paid ability."},{"name":"Messages:","value":"“They were slain by an Aztec Eagle Warrior.” (Factional Kill)\n“You have gained the abilities of (Role)!” (Amber preservation)\n“You feel more awake tonight. You may act twice!” (Coffee)\n“They were impaled by an Ivory tusk.” (Ivory Kill)\n“They were obliterated by the British East India Company.” (Tea Kill)\n“They fell victim to lung cancer.” (Tobacco Kill)\n“You retreated into a shell!” (Turtle)\n“You were caught in a fishing net. You cannot leave your house!” (Whales)\n“They were killed in a drunken brawl.” (Wine Kill)"},{"name":"Luxuries:","value":"Amber: Give to a target. When that target dies, their ability will be preserved, and you can give it to any Civilization. \nCitrus: Heal a target for one stage higher than their base defense value\nCocoa: Your target’s ability rampages.  Does not apply to killing effects.\nCoffee: Your target may use their ability twice the next night.\nCotton: Your target gains a Basic autovest.\nDiamonds: Generate 4 Gold\nFurs: Scare off one visitor to your target\nGypsum: Your target cannot perform any day abilities the next day\nHoney: Roleblock your target\nIncense: Your target gains roleblock and control immunity this night.\nIvory: Your target’s visit will automatically deal a Basic attack.\nJade: Choose a target. Generate 2 gold for all of their visitors that night.\nMarble: Build a statue of someone. Any visitors to them will be directed at the statue.\nMercury: Deal a Powerful poison to a target.\nOlives: Visits directed at your target will target a neighbor at random."},{"name":"Luxuries Cont'd:","value":"Pearls: 50% chance of generating 6 gold. 50% chance of doing nothing.\nSalt: Give to a target. When that target dies, their corpse will not be seen until it’s visited or voted.\nSilk: Your target’s visit is Astral.\nSilver: Anyone targeting your target will have their abilities reflected at themselves.\nSpices: Your target has three votes the next day.\nSugar: Your target’s visit will be redirected to a random target.\nTea: If England is alive, deal an Unstoppable attack. Otherwise, this does nothing.\nTobacco: Your target gains a 25% chance to be dealt an Overkill attack each night for the rest of the game.\nTruffles: Your target’s defense is reduced to Vulnerable.\nTurtles: The next night, your target gains Invincible defense, but cannot perform any night abilities. \nWhales: Your target can no longer vote or visit until they are visited.\nWine: Target three people. They each have a ⅓ chance of being dealt a Basic attack."}],"meta":{},"desc":"Post 2139","id":57}