{"aliases":["3186","adhd_juggernaut","adhdjuggernaut","adhd","juggernaut","aj"],"author":"329331408269213696","title":"ADHD Juggernaut","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Powerful","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- You may choose a player to attack on Full Moon nights at 0 kills\n- You may choose a player to attack every night after your first kill"},{"name":"Attributes:","value":"- Appears innocent\n- Levels up after every kill:\n1st - Can attack every night instead of every full moon\n2nd - You rampage when you attack\n3rd - You gain unstoppable attack\n4th - You heal yourself after killing a player\n5th - You roleblock your target\n6th - Poison your target's visited player\n7th - You gain a Necronomicon, controlling your target at night to visit your second target\n8th - You order a Mafioso to kill your target, performing your attack astrally\n9th - You ambush your own house, killing one player who visits you but all visitors know your name\n10th - Gain a Vampire Hunter guard, preventing you from being converted to any faction\n11th - You gain overkill attack\n12th - In addition to your abilities, select a target to Douse. Select yourself to ignite all Doused targets.\n13th - When you are roleblocked, cleanse your roleblocker and kill them\n14th - Choose one of three potions to use in addition to other abilities: one learns role of target, one attacks target, one protects target"},{"name":"Attributes (cont.):","value":"15th - Hex your Doused target at night\n16th - Poison your first target at night, then roleblock your second target at night, then spread the plague to your third target at night in addition to the other effects\n17th - Investigate a player at night, learning whether they are good or bad\n18th - Talk to the dead at night, appearing as the medium\n19th - Infect someone with the Plague at night. When everyone is infected, Pestilence is announced to arrive and you can target a player to attack as Pestilence each night\n20th - Your vote counts as 3 and you are the Mayor\n21st - When you are hanged, haunt someone to deal an unstoppable attack to someone at night while dead\n22nd - Your win condition is now \"Live until the game's end\""},{"name":"Goal:","value":"Kill everyone"}],"meta":{},"desc":"Post 3186","id":648}