{"aliases":["3228","citizen"],"author":"329331408269213696","title":"Citizen ","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Town","subalignment":"Support","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- If you are dead, you may Seance a living player to tell them a message."},{"name":"Attributes:","value":"- You will speak to the dead anonymously each night you are alive.\n- You may only speak to a living person once."},{"name":"Goal:","value":"Town goal"}],"meta":{},"desc":"Post 3228\n\"*She waits until night falls, then gently takes out her crystal ball. She murmurs her secret words, foreign to others' ears but warmly familiar to her own. The opaque clouds swirling within the glass clear away to reveal a shining, translucent orb of clarity.*\n*The town has called her foolish many times for meddling with \"fake magic,\" but they know not of the true nature of her powers. They say dead men tell no tales, but that isn't true for the Medium. As she moves her hands lightly over the gleaming crystal, words from the souls of the dearly departed begin to appear before her. She sifts through their words, carefully looking for any snippets of information that may help the Town. Her eyes light up – the town Sheriff had found a member of the Mafia, but had not been able to tell the Town before being stabbed by the Serial Killer at large. The next morning, she informs her fellow townspeople of the Sheriff's final discovery. The Mafia member is hanged and the townspeople cheer, but this victory does not come without a price. She is shot the next night by the Mafia, come to seek revenge for their brother's spilled blood.*\n*Her life may be over, but her job is not. The next night, the Medium performs her final, miraculous act from beyond the grave. She speaks to the Mayor of Salem, sharing the final pieces of information gleaned from the dead. As the night ends, she knows she can rest easy. The Town will be all right.*\"\n- Flavor Text from HOM3STUCK413 on the ToS wiki","id":649}