{"aliases":["2764","furry_keeper","furrykeeper","furry","keeper","fk","1950u"],"author":"327918538419601409","title":"Furry Keeper","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Unseen","subalignment":"Support","unique":"False","attack":"None","defense":"None"},"fields":[{"name":"Abilities:","value":"- Give someone an animal every night, except it's actually just a furry and it does different things depending on the subalignment of your target."},{"name":"Attributes:","value":"- You will know what your furry did."},{"name":"What the Furry Does:","value":"(Killing/Assault/Keter/Single/Entity): If your target attacked someone, they will see their target's defense was too strong to kill. They will actually be roleblocked through immunities, and any attack they performed (even if delayed) will fail.\n(Investigative/Investigator/Informant/Investigating): If your target relies on getting someone's role, they will see their target as a (2285) Furry. Otherwise, they will receive no feedback and they cannot perform any abilities that day.\n(Protective/Protection/Bouncer/Defensive/Protector): Their target receives Vulnerable defense that night instead of what they would normally receive.\n(Support/Militaristic/Euclid/Communication/Supportive): Their attributes are nullified for this night and the next day/night cycle.\n(Power/Head/Legendary/AAAAAAAA/Hero): They are converted into a random Neutral non-Killing role.\n(Deception/Saboteur/Sabotage): Their target is informed exactly of what happened to them."},{"name":"What the Furry Does (cont.):","value":"(Espionage/Hitman/Omega/Agent): Their win condition changes to the Unseen goal.\n(Town/Green): They become a random Town role.\n(Mafia/Red): They become a random Mafia role.\n(Coven): They become a random Coven role.\n(Benign/White): Their role is publicly revealed, similar to (52) Mayor.\n(Blue): They become a random Serial Killer. This can be any role with Serial Killer in the name.\n(Evil/Beta/All-Rounder/Black): You learn their exact role.\n(Production/Economic): Your target will not generate any currency for their faction.\n(Offensive): Their target will become undoused, the node they target cannot be hacked for two nights, and if they attack someone they will be roleblocked through immunity.\n(Commanding/Commander/Object): Your target loses communication with their faction for two days and two nights.\n(Onslaught): All existing strikes fade.\n(Chaos/Chaotic/Casual): Instead of their normal target, they will use their ability on three random targets. This will never target an Unseen."},{"name":"What the Furry Does (moar.):","value":"(Base/Evolved): If evolved, they will revert back into their Base form and all evolution progress is reset.\n(Operation): Their faction will not gain points from their abilities for this night and the next.\n(Algebraic/Religious/Scientific): Their paid abilities cost 5 more permanently.\n(Geometric/of the Sun/Special): Modkill them because i hate them\n(King): Their abilities with cooldowns gain an extra night of cooldown until the next usage.\n(Sexyman): All seduced targets are released from their seduction.\n(Nutrition/Other): They will instead use one of their other abilities on their target at random.\n(Woodwind/Brass/Percussion/String/Digital/Vocal): The concert starts one day later.\n(Sin/Command/Field Operations): Lose all uses of their limited-use abilities.\n(Fire/Air/Water/Earth/Dark/Light): Unlocked abilities become locked for two days and two nights."}],"meta":{},"desc":"Post 2764\n*Don't ask where I got them.*\n*Converted from (1950) Animal Keeper*","id":717}