{"aliases":["3724","personified_mascot_of_fast_food_chain_\"wendy's\"_inside_a_fanfiction","personified_mascot_of_fast_food_chain_wendys_inside_a_fanfiction","personifiedmascotoffastfoodchain\"wendy's\"insideafanfiction","personifiedmascotoffastfoodchainwendysinsideafanfiction","personified","mascot","fast","food","chain","wendys","inside","fanfiction","\"wendy's\"","pmoffcwiaf","pmffcwif"],"author":"329331408269213696","title":"Personified Mascot of Fast Food Chain \"Wendy's\" Inside a Fanfiction","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Neutral","subalignment":"Killing","unique":"False","attack":"Basic","defense":"Basic (Autovest x2)"},"fields":[{"name":"Abilities:","value":"- Hire either Ronald McDonald, the Burger King, or Colonel Sanders to kill your target. (You still visit the target).\n- Ronald McDonald will roleblock a random visitor (prioritizing good players) and deal a basic attack, trapping them in a McDonalds kids' play-area.\n- The Burger King will heal you and deal a basic attack, giving you a delicious burger.\n- Colonel Sanders will deal a basic attack and clean his target."},{"name":"Attributes:","value":"- On night 4, the mascot whose ability you've used the most becomes your love interest, changing your abilities and win condition. Your abilities will be replaced by new ones.\n- Ronald McDonald: At night, stalk a player. If they have a visitor, you rampage at their house with a basic attack. Win by killing everyone and rampaging at least 3 times.\n- Burger King: During the day, duel a player tommorow night (same as pirate). If you win the duel, you are healed and permanently upgrade your defense one stage (and kill your victim). At night, you also deal a basic attack to one player in addition to your duel. Win by killing everyone and winning two duels."},{"name":"Attributes (cont.):","value":"- Colonel Sanders: At night, spread Super-Salmonella to a player, and deal a basic attack to another. When a player with Super-Salmonella visits another player or is visited by another player, they also get Super-Salmonella. When all players are infected with Super-Salmonella, you transform into the Kentucky Frier, gaining an unstoppable rampage and invincible defense. Win by transforming into the Kentucky Frier and killing all players.\n- If you tie for a love interest, you don't gain a love interest until the tie is broken."},{"name":"Town Goal:","value":"Win with your love interest's win condition."}],"meta":{},"desc":"Post 3724","id":728}