{"aliases":["4191","the_scribbler","thescribbler","scribbler"],"author":"654448067969548338","title":"The Scribbler","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Brainless","subalignment":"Penman","unique":"False","attack":"None","defense":"Basic"},"fields":[{"name":"Abilities:","value":"- **Scribble (3 uses)**: Choose a player each night and give them a random one of the 50 tools in your arsenal. The tool can have various effects, such as granting temporary protection, redirecting actions, revealing information, or even causing chaos. The player will be informed of the tool they received, but not its specific effect."},{"name":"Attributes:","value":"- During Tuesday and Friday, the Scribbler's Scribble ability gains an additional use.\n- **Master Craftsman**: The tools created by the Scribbler cannot be removed or stolen by other players."},{"name":"Goal:","value":"Rot the brains of the Town."},{"name":"Tools:","value":"1. **Healing Hammer**: Allows the target to heal themselves once during the night.\n2. **Rusty Nail**: Weakens the target's defense for one night, making them more vulnerable to attacks.\n3. **Disguise Kit**: Allows the target to appear as a different role to investigations for one night.\n4. **Mirror Shield**: Reflects the next attack targeting the holder back to the attacker.\n5. **Cursed Ink**: Causes any written messages from the target to be scrambled and unreadable.\n6. **Lucky Coin**: Grants the target a second chance if they are attacked at night, protecting them from death.\n7. **Whispering Shell**: Allows the target to send a whisper to another player anonymously.\n8. **Paralyzing Dart**: Prevents the target from using their abilities for one night.\n9. **Bouncing Boomerang**: If the target is attacked, the attacker has a chance to be hit instead."},{"name":"Tools (cont.):","value":"10. **Smoke Bomb**: Creates a cloud of smoke around the target, blocking any investigations or actions targeted at them.\n11. **Siren's Song**: Forces all players visiting the target to switch targets for one night.\n12. **Enchanted Pen**: Allows the target to change one word in a Last Will or Death Note before it is revealed.\n13. **Teleportation Stone**: Allows the target to switch places with another player for one night.\n14. **Nocturnal Owl**: Gives the target night vision, allowing them to see the visits to their target.\n15. **Mimic's Mask**: Allows the target to use the ability of another player for one night.\n16. **Loud Horn**: Reveals the target's role to all players during the next day.\n17. **Misdirection Manual**: Redirects any actions targeted at the target to another player for one night.\n18. **Bewitching Brew**: Confuses the investigative results of all players targeting the holder for one night."},{"name":"Tools (moar.):","value":"19. **Silent Shoes**: Prevents the target from being detected by Lookouts or Trackers for one night.\n20. **Truth Serum**: Forces the target to tell the truth during the next day.\n21. **Invisible Ink**: Allows the target to write a hidden message in their Last Will or Death Note.\n22. **Nightmare Powder**: Causes the target to have a nightmare, preventing them from using their abilities for one night.\n23. **Fortune Cookie**: Gives the target a hint about another player's role during the next day.\n24. **Guardian Feather**: Protects the target from a single night attack.\n25. **Liar's Dice**: Allows the target to change their voting choice during the day.\n26. **Hidden Dagger**: If the target is attacked, there is a chance they will counter-attack the attacker."},{"name":"Tools (help.):","value":"27. **Befuddling Brew**: Mixes up the target's investigative results for one night.\n28. **Decoy Doll**: Creates a decoy of the target, drawing any attacks away from them for one night.\n29. **Shapeshifter's Potion**: Allows the target to change their appearance to another player for one night.\n30. **Silencing Scroll**: Silences the target, preventing them from speaking during the next day.\n31. **Psychic Crystal**: Reveals the target's alignment (Town, Mafia, or Neutral) to them.\n32. **Chaos Compass**: Randomizes the target's voting choice during the day.\n33. **Caltrops**: Injures any player visiting the target, causing them to lose one defense for one night.\n34. **Ethereal Elixir**: Allows the target to visit another player without being detected by Lookouts or Trackers."},{"name":"Tools (stop.):","value":"35. **Truthful Mirror**: Forces the target to see their true reflection, revealing their true role during the next day.\n36. **Charming Charm**: Makes the target more persuasive, increasing their voting power during the day.\n37. **Sleeping Potion**: Puts the target to sleep, preventing them from using their abilities for one night.\n38. **Voodoo Doll**: Allows the target to transfer any negative effects they receive to another player.\n39. **Distracting Dance**: Distracts all players during the next day, preventing them from voting.\n40. **Whisper Detector**: Reveals any whispers sent to or from the target during the next day.\n41. **Lethal Lollipop**: Kills the target if they use an ability during the next night.\n42. **Bouncing Bubbles**: Causes any investigative results targeted at the holder to bounce to another random player."},{"name":"Tools (please.):","value":"43. **Enigmatic Envelope**: Sends an anonymous message to another player on behalf of the target.\n44. **Shroud of Shadows**: Makes the target immune to investigations for one night.\n45. **Witch's Brew**: Grants the target the ability to control another player's actions for one night.\n46. **Summoning Scroll**: Summons a random Neutral Evil role to target the holder for one night.\n47. **Cursed Candles**: Causes the target's role to appear suspicious to Investigators for one night.\n48. **Lucky Rabbit's Foot**: Increases the target's chances of surviving an attack for one night.\n49. **Evasive Elixir**: Allows the target to avoid being detected by Lookouts or Trackers for one night.\n50. **Fool's Mirror**: Reflects the target's investigative results back to them, showing a different role."}],"meta":{},"desc":"Post 4191","id":873}