{"aliases":["4240","farmer"],"author":"329331408269213696","title":"Farmer","color":null,"iconURL":null,"imageURL":null,"params":{"faction":"Peasant","subalignment":"Chaos","unique":"False","attack":"None","defense":"Basic Auto-vest"},"fields":[{"name":"Abilities:","value":"- During the day, choose someone to Defraud.\n- At night, the player you Defrauded will have a chat with you anonymously - you are able to talk to them and try to convince them in their decision. They will receive the message below, and have to choose one Parcel to select.\n\n\"A strange man knocks on your door. He offers you a Parcel of land!\"\nSelect a plot of land:\n1. **Fairfield Farm**\n2. **Mountainview Ridge**\n3. **Red River Ranch**"},{"name":"Attributes:","value":"- You can see what players have voted for what Parcels at any time.\n- When you die, there will be fighting of every parcel of land between everyone who voted for it.\n- The person who voted on it with the highest base attack will kill anyone else who voted for the parcel with equal or lower attack, ignoring all defense.\n- People with equal attack will kill each other. There cannot be a tie, only a no-win.\n- You cannot be healed from these.\n- If someone is not contested at the end (either because they are the only one who voted, or because they killed everyone else) and gains a parcel of land, they will permanently gain an extra vote."},{"name":"Destiny:","value":"Kill two people after your death via fighting for parcels."},{"name":"Goal:","value":"Have each living Peasant fulfill their Destiny."}],"meta":{},"desc":"Post 4240\n*Night by night, he told the Sheriff, the Godfather, and the Vigilante of the lands they could acquire. 'With soil this fertile, it's almost worth dying for!' He promised the land to them in his will, and they would get it as inheritance when the time came. He did have land - that much he wasn't lying about, but not as much as the town thought he did. They could fight over it as far as he cared; the money would do wonders for him now.*","id":937}